/* automatically generated by rust-bindgen */

#[doc(hidden)]

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[repr(C)]
    #[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
    pub struct __BindgenBitfieldUnit<Storage, Align>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        storage: Storage,
        align: [Align; 0],
    }

    impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        #[inline]
        pub fn new(storage: Storage) -> Self {
            Self { storage, align: [] }
        }

        #[inline]
        pub fn get_bit(&self, index: usize) -> bool {
            debug_assert!(index / 8 < self.storage.as_ref().len());

            let byte_index = index / 8;
            let byte = self.storage.as_ref()[byte_index];

            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)
            } else {
                index % 8
            };

            let mask = 1 << bit_index;

            byte & mask == mask
        }

        #[inline]
        pub fn set_bit(&mut self, index: usize, val: bool) {
            debug_assert!(index / 8 < self.storage.as_ref().len());

            let byte_index = index / 8;
            let byte = &mut self.storage.as_mut()[byte_index];

            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)

        pub type basic_string_const_pointer = u8;
        pub type basic_string_reference = u8;
        pub type basic_string_const_reference = u8;
        pub type basic_string_iterator = u8;
        pub type basic_string_const_iterator = u8;
        pub type basic_string_reverse_iterator = u8;
        pub type basic_string_const_reverse_iterator = u8;
        pub type basic_string__Use_memcpy_move = u8;
        pub type basic_string__Is_elem_cptr = u8;
        pub type string = [u64; 4usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct vector {
            pub _address: u8,
        }
        pub type vector__Mybase = u8;
        pub type vector__Alty = u8;
        pub type vector__Alty_traits = u8;
        pub type vector_value_type = u8;
        pub type vector_allocator_type = u8;
        pub type vector_pointer = u8;
        pub type vector_const_pointer = u8;
        pub type vector_reference = u8;
        pub type vector_const_reference = u8;
        pub type vector_size_type = u8;
        pub type vector_difference_type = u8;
        pub type vector_iterator = u8;
        pub type vector_const_iterator = u8;
        pub type vector_reverse_iterator = u8;
        pub type vector_const_reverse_iterator = u8;
        pub mod experimental {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub mod filesystem {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct unordered_set {
            pub _address: u8,
        }
        pub type unordered_set__Mytraits = u8;
        pub type unordered_set__Mybase = u8;
        pub type unordered_set_hasher = u8;
        pub type unordered_set_key_type = u8;
        pub type unordered_set_key_equal = u8;
        pub type unordered_set_key_compare = u8;
        pub type unordered_set_value_type = u8;
        pub type unordered_set_allocator_type = u8;
        pub type unordered_set_size_type = u8;
        pub type unordered_set_difference_type = u8;
        pub type unordered_set_pointer = u8;
        pub type unordered_set_const_pointer = u8;
        pub type unordered_set_reference = u8;
        pub type unordered_set_const_reference = u8;
        pub type unordered_set_iterator = u8;
        pub type unordered_set_const_iterator = u8;
        pub type unordered_set_local_iterator = u8;
        pub type unordered_set_const_local_iterator = u8;
        pub type unordered_set__Alnode = u8;
        pub type unordered_set__Alnode_traits = u8;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct _iobuf {
        pub _Placeholder: *mut ::std::os::raw::c_void,
    }
    #[test]
    fn bindgen_test_layout__iobuf() {
        assert_eq!(
            ::std::mem::size_of::<_iobuf>(),
            8usize,
            concat!("Size of: ", stringify!(_iobuf))
        );
        assert_eq!(
            ::std::mem::align_of::<_iobuf>(),
            8usize,
            concat!("Alignment of ", stringify!(_iobuf))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_iobuf>()))._Placeholder as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_iobuf),
                "::",
                stringify!(_Placeholder)
            )
        );
    }
    pub type FILE = root::_iobuf;
    pub mod v8 {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HeapProfiler {
            _unused: [u8; 0],
        }
        pub mod internal {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Isolate {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Object {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ScriptStreamingData {
                _unused: [u8; 0],
            }
            pub mod wasm {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                #[repr(C)]
                #[derive(Debug, Copy, Clone)]
                pub struct NativeModule {
                    _unused: [u8; 0],
                }
                #[repr(C)]
                #[derive(Debug, Copy, Clone)]
                pub struct StreamingDecoder {
                    _unused: [u8; 0],
                }
            }
            pub const kApiPointerSize: ::std::os::raw::c_int = 8;
            pub const kApiDoubleSize: ::std::os::raw::c_int = 8;
            pub const kApiIntSize: ::std::os::raw::c_int = 4;
            pub const kApiInt64Size: ::std::os::raw::c_int = 8;
            pub const kHeapObjectTag: ::std::os::raw::c_int = 1;
            pub const kWeakHeapObjectTag: ::std::os::raw::c_int = 3;
            pub const kHeapObjectTagSize: ::std::os::raw::c_int = 2;
            pub const kHeapObjectTagMask: isize = 3;
            pub const kSmiTag: ::std::os::raw::c_int = 0;
            pub const kSmiTagSize: ::std::os::raw::c_int = 1;
            pub const kSmiTagMask: isize = 1;
            pub const kSmiShiftSize: ::std::os::raw::c_int = 31;
            pub const kSmiValueSize: ::std::os::raw::c_int = 32;
            pub const kSmiMinValue: ::std::os::raw::c_int = -2147483648;
            pub const kSmiMaxValue: ::std::os::raw::c_int = 2147483647;
            pub const Internals_kHeapObjectMapOffset: ::std::os::raw::c_int = 0;
            pub const Internals_kMapInstanceTypeOffset: ::std::os::raw::c_int = 12;
            pub const Internals_kStringResourceOffset: ::std::os::raw::c_int = 24;
            pub const Internals_kOddballKindOffset: ::std::os::raw::c_int = 40;
            pub const Internals_kForeignAddressOffset: ::std::os::raw::c_int = 8;
            pub const Internals_kJSObjectHeaderSize: ::std::os::raw::c_int = 24;
            pub const Internals_kFixedArrayHeaderSize: ::std::os::raw::c_int = 16;
            pub const Internals_kContextHeaderSize: ::std::os::raw::c_int = 16;
            pub const Internals_kContextEmbedderDataIndex: ::std::os::raw::c_int = 5;
            pub const Internals_kFullStringRepresentationMask: ::std::os::raw::c_int = 15;
            pub const Internals_kStringEncodingMask: ::std::os::raw::c_int = 8;
            pub const Internals_kExternalTwoByteRepresentationTag: ::std::os::raw::c_int = 2;
            pub const Internals_kExternalOneByteRepresentationTag: ::std::os::raw::c_int = 10;
            pub const Internals_kIsolateEmbedderDataOffset: ::std::os::raw::c_int = 0;
            pub const Internals_kExternalMemoryOffset: ::std::os::raw::c_int = 32;
            pub const Internals_kExternalMemoryLimitOffset: ::std::os::raw::c_int = 40;
            pub const Internals_kExternalMemoryAtLastMarkCompactOffset: ::std::os::raw::c_int = 48;
            pub const Internals_kIsolateRootsOffset: ::std::os::raw::c_int = 72;
            pub const Internals_kUndefinedValueRootIndex: ::std::os::raw::c_int = 4;
            pub const Internals_kTheHoleValueRootIndex: ::std::os::raw::c_int = 5;
            pub const Internals_kNullValueRootIndex: ::std::os::raw::c_int = 6;
            pub const Internals_kTrueValueRootIndex: ::std::os::raw::c_int = 7;
            pub const Internals_kFalseValueRootIndex: ::std::os::raw::c_int = 8;
            pub const Internals_kEmptyStringRootIndex: ::std::os::raw::c_int = 9;
            pub const Internals_kNodeClassIdOffset: ::std::os::raw::c_int = 8;
            pub const Internals_kNodeFlagsOffset: ::std::os::raw::c_int = 11;
            pub const Internals_kNodeStateMask: ::std::os::raw::c_int = 7;
            pub const Internals_kNodeStateIsWeakValue: ::std::os::raw::c_int = 2;
            pub const Internals_kNodeStateIsPendingValue: ::std::os::raw::c_int = 3;
            pub const Internals_kNodeStateIsNearDeathValue: ::std::os::raw::c_int = 4;
            pub const Internals_kNodeIsIndependentShift: ::std::os::raw::c_int = 3;
            pub const Internals_kNodeIsActiveShift: ::std::os::raw::c_int = 4;
            pub const Internals_kFirstNonstringType: ::std::os::raw::c_int = 128;
            pub const Internals_kOddballType: ::std::os::raw::c_int = 131;
            pub const Internals_kForeignType: ::std::os::raw::c_int = 135;
            pub const Internals_kJSSpecialApiObjectType: ::std::os::raw::c_int = 1040;
            pub const Internals_kJSApiObjectType: ::std::os::raw::c_int = 1056;
            pub const Internals_kJSObjectType: ::std::os::raw::c_int = 1057;
            pub const Internals_kUndefinedOddballKind: ::std::os::raw::c_int = 5;
            pub const Internals_kNullOddballKind: ::std::os::raw::c_int = 3;
            pub const Internals_kNumIsolateDataSlots: u32 = 4;
            extern "C" {
                #[link_name = "\u{1}?CheckInitializedImpl@Internals@internal@v8@@SAXPEAVIsolate@3@@Z"]
                pub fn Internals_CheckInitializedImpl(isolate: *mut root::v8::Isolate);
            }
        }
        /// An object reference managed by the v8 garbage collector.
        ///
        /// All objects returned from v8 have to be tracked by the garbage
        /// collector so that it knows that the objects are still alive.  Also,
        /// because the garbage collector may move objects, it is unsafe to
        /// point directly to an object.  Instead, all objects are stored in
        /// handles which are known by the garbage collector and updated
        /// whenever an object moves.  Handles should always be passed by value
        /// (except in cases like out-parameters) and they should never be
        /// allocated on the heap.
        ///
        /// There are two types of handles: local and persistent handles.
        ///
        /// Local handles are light-weight and transient and typically used in
        /// local operations.  They are managed by HandleScopes. That means that a
        /// HandleScope must exist on the stack when they are created and that they are
        /// only valid inside of the HandleScope active during their creation.
        /// For passing a local handle to an outer HandleScope, an EscapableHandleScope
        /// and its Escape() method must be used.
        ///
        /// Persistent handles can be used when storing objects across several
        /// independent operations and have to be explicitly deallocated when they're no
        /// longer used.
        ///
        /// It is safe to extract the object stored in the handle by
        /// dereferencing the handle (for instance, to extract the Object* from
        /// a Local<Object>); the value will still be governed by a handle
        /// behind the scenes and the same rules apply to these values as to
        /// their handles.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Local<T> {
            pub val_: *mut T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        /// A MaybeLocal<> is a wrapper around Local<> that enforces a check whether
        /// the Local<> is empty before it can be used.
        ///
        /// If an API method returns a MaybeLocal<>, the API method can potentially fail
        /// either because an exception is thrown, or because an exception is pending,
        /// e.g. because a previous API call threw an exception that hasn't been caught
        /// yet, or because a TerminateExecution exception was thrown. In that case, an
        /// empty MaybeLocal is returned.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct MaybeLocal<T> {
            pub val_: *mut T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        pub const kInternalFieldsInWeakCallback: ::std::os::raw::c_int = 2;
        pub const kEmbedderFieldsInWeakCallback: ::std::os::raw::c_int = 2;
        /// An object reference that is independent of any handle scope.  Where
        /// a Local handle only lives as long as the HandleScope in which it was
        /// allocated, a PersistentBase handle remains valid until it is explicitly
        /// disposed using Reset().
        ///
        /// A persistent handle contains a reference to a storage cell within
        /// the V8 engine which holds an object value and which is updated by
        /// the garbage collector whenever the object is moved.  A new storage
        /// cell can be created using the constructor or PersistentBase::Reset and
        /// existing handles can be disposed using PersistentBase::Reset.
        ///
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct PersistentBase<T> {
            pub val_: *mut T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        /// Helper class traits to allow copying and assignment of Persistent.
        /// This will clone the contents of storage cell, but not any of the flags, etc.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct CopyablePersistentTraits {
            pub _address: u8,
        }
        pub type CopyablePersistentTraits_CopyablePersistent<T> = root::v8::Persistent<T>;
        /// A PersistentBase which allows copy and assignment.
        ///
        /// Copy, assignment and destructor behavior is controlled by the traits
        /// class M.
        ///
        /// Note: Persistent class hierarchy is subject to future changes.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct Persistent<T> {
            pub _base: root::v8::PersistentBase<T>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        /// A stack-allocated class that governs a number of local handles.
        /// After a handle scope has been created, all local handles will be
        /// allocated within that handle scope until either the handle scope is
        /// deleted or another handle scope is created.  If there is already a
        /// handle scope and a new one is created, all allocations will take
        /// place in the new handle scope until it is deleted.  After that,
        /// new handles will again be allocated in the original handle scope.
        ///
        /// After the handle scope of a local handle has been deleted the
        /// garbage collector will no longer track the object stored in the
        /// handle and may deallocate it.  The behavior of accessing a handle
        /// for which the handle scope has been deleted is undefined.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct HandleScope {
            pub isolate_: *mut root::v8::internal::Isolate,
            pub prev_next_: *mut *mut root::v8::internal::Object,
            pub prev_limit_: *mut *mut root::v8::internal::Object,
        }
        #[test]
        fn bindgen_test_layout_HandleScope() {
            assert_eq!(
                ::std::mem::size_of::<HandleScope>(),
                24usize,
                concat!("Size of: ", stringify!(HandleScope))
            );
            assert_eq!(
                ::std::mem::align_of::<HandleScope>(),
                8usize,
                concat!("Alignment of ", stringify!(HandleScope))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<HandleScope>())).isolate_ as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(HandleScope),
                    "::",
                    stringify!(isolate_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<HandleScope>())).prev_next_ as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(HandleScope),
                    "::",
                    stringify!(prev_next_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<HandleScope>())).prev_limit_ as *const _ as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(HandleScope),
                    "::",
                    stringify!(prev_limit_)
                )
            );
        }
        extern "C" {
            /// Counts the number of allocated handles.
            #[link_name = "\u{1}?NumberOfHandles@HandleScope@v8@@SAHPEAVIsolate@2@@Z"]
            pub fn HandleScope_NumberOfHandles(
                isolate: *mut root::v8::Isolate,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}?Initialize@HandleScope@v8@@IEAAXPEAVIsolate@2@@Z"]
            pub fn HandleScope_Initialize(
                this: *mut root::v8::HandleScope,
                isolate: *mut root::v8::Isolate,
            );
        }
        extern "C" {
            #[link_name = "\u{1}?CreateHandle@HandleScope@v8@@KAPEAPEAVObject@internal@2@PEAVIsolate@42@PEAV342@@Z"]
            pub fn HandleScope_CreateHandle(
                isolate: *mut root::v8::internal::Isolate,
                value: *mut root::v8::internal::Object,
            ) -> *mut *mut root::v8::internal::Object;
        }
        extern "C" {
            #[link_name = "\u{1}??0HandleScope@v8@@QEAA@PEAVIsolate@1@@Z"]
            pub fn HandleScope_HandleScope(
                this: *mut root::v8::HandleScope,
                isolate: *mut root::v8::Isolate,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DHandleScope@v8@@QEAAXXZ"]
            pub fn HandleScope_HandleScope_destructor(this: *mut root::v8::HandleScope);
        }
        impl HandleScope {
            #[inline]
            pub unsafe fn NumberOfHandles(
                isolate: *mut root::v8::Isolate,
            ) -> ::std::os::raw::c_int {
                HandleScope_NumberOfHandles(isolate)
            }
            #[inline]
            pub unsafe fn Initialize(&mut self, isolate: *mut root::v8::Isolate) {
                HandleScope_Initialize(self, isolate)
            }
            #[inline]
            pub unsafe fn CreateHandle(
                isolate: *mut root::v8::internal::Isolate,
                value: *mut root::v8::internal::Object,
            ) -> *mut *mut root::v8::internal::Object {
                HandleScope_CreateHandle(isolate, value)
            }
            #[inline]
            pub unsafe fn new(isolate: *mut root::v8::Isolate) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                HandleScope_HandleScope(&mut __bindgen_tmp, isolate);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                HandleScope_HandleScope_destructor(self)
            }
        }
        /// A HandleScope which first allocates a handle in the current scope
        /// which will be later filled with the escape value.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct EscapableHandleScope {
            pub _base: root::v8::HandleScope,
            pub escape_slot_: *mut *mut root::v8::internal::Object,
        }
        #[test]
        fn bindgen_test_layout_EscapableHandleScope() {
            assert_eq!(
                ::std::mem::size_of::<EscapableHandleScope>(),
                32usize,
                concat!("Size of: ", stringify!(EscapableHandleScope))
            );
            assert_eq!(
                ::std::mem::align_of::<EscapableHandleScope>(),
                8usize,
                concat!("Alignment of ", stringify!(EscapableHandleScope))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<EscapableHandleScope>())).escape_slot_ as *const _
                        as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(EscapableHandleScope),
                    "::",
                    stringify!(escape_slot_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0EscapableHandleScope@v8@@QEAA@PEAVIsolate@1@@Z"]
            pub fn EscapableHandleScope_EscapableHandleScope(
                this: *mut root::v8::EscapableHandleScope,
                isolate: *mut root::v8::Isolate,
            );
        }
        impl EscapableHandleScope {
            #[inline]
            pub unsafe fn new(isolate: *mut root::v8::Isolate) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                EscapableHandleScope_EscapableHandleScope(&mut __bindgen_tmp, isolate);
                __bindgen_tmp
            }
        }
        /// A SealHandleScope acts like a handle scope in which no handle allocations
        /// are allowed. It can be useful for debugging handle leaks.
        /// Handles can be allocated within inner normal HandleScopes.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct SealHandleScope {
            pub isolate_: *mut root::v8::internal::Isolate,
            pub prev_limit_: *mut *mut root::v8::internal::Object,
            pub prev_sealed_level_: ::std::os::raw::c_int,
        }
        #[test]
        fn bindgen_test_layout_SealHandleScope() {
            assert_eq!(
                ::std::mem::size_of::<SealHandleScope>(),
                24usize,
                concat!("Size of: ", stringify!(SealHandleScope))
            );
            assert_eq!(
                ::std::mem::align_of::<SealHandleScope>(),
                8usize,
                concat!("Alignment of ", stringify!(SealHandleScope))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<SealHandleScope>())).isolate_ as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SealHandleScope),
                    "::",
                    stringify!(isolate_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<SealHandleScope>())).prev_limit_ as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SealHandleScope),
                    "::",
                    stringify!(prev_limit_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<SealHandleScope>())).prev_sealed_level_ as *const _
                        as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SealHandleScope),
                    "::",
                    stringify!(prev_sealed_level_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0SealHandleScope@v8@@QEAA@PEAVIsolate@1@@Z"]
            pub fn SealHandleScope_SealHandleScope(
                this: *mut root::v8::SealHandleScope,
                isolate: *mut root::v8::Isolate,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DSealHandleScope@v8@@QEAAXXZ"]
            pub fn SealHandleScope_SealHandleScope_destructor(this: *mut root::v8::SealHandleScope);
        }
        impl SealHandleScope {
            #[inline]
            pub unsafe fn new(isolate: *mut root::v8::Isolate) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                SealHandleScope_SealHandleScope(&mut __bindgen_tmp, isolate);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                SealHandleScope_SealHandleScope_destructor(self)
            }
        }
        /// The superclass of values and API object templates.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Data {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Data() {
            assert_eq!(
                ::std::mem::size_of::<Data>(),
                1usize,
                concat!("Size of: ", stringify!(Data))
            );
            assert_eq!(
                ::std::mem::align_of::<Data>(),
                1usize,
                concat!("Alignment of ", stringify!(Data))
            );
        }
        /// A container type that holds relevant metadata for module loading.
        ///
        /// This is passed back to the embedder as part of
        /// HostImportModuleDynamicallyCallback for module loading.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct ScriptOrModule {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_ScriptOrModule() {
            assert_eq!(
                ::std::mem::size_of::<ScriptOrModule>(),
                1usize,
                concat!("Size of: ", stringify!(ScriptOrModule))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptOrModule>(),
                1usize,
                concat!("Alignment of ", stringify!(ScriptOrModule))
            );
        }
        extern "C" {
            /// The name that was passed by the embedder as ResourceName to the
            /// ScriptOrigin. This can be either a v8::String or v8::Undefined.
            #[link_name = "\u{1}?GetResourceName@ScriptOrModule@v8@@QEAA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn ScriptOrModule_GetResourceName(
                this: *mut root::v8::ScriptOrModule,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// The options that were passed by the embedder as HostDefinedOptions to
            /// the ScriptOrigin.
            #[link_name = "\u{1}?GetHostDefinedOptions@ScriptOrModule@v8@@QEAA?AV?$Local@VPrimitiveArray@v8@@@2@XZ"]
            pub fn ScriptOrModule_GetHostDefinedOptions(
                this: *mut root::v8::ScriptOrModule,
            ) -> root::v8::Local<root::v8::PrimitiveArray>;
        }
        impl ScriptOrModule {
            #[inline]
            pub unsafe fn GetResourceName(&mut self) -> root::v8::Local<root::v8::Value> {
                ScriptOrModule_GetResourceName(self)
            }
            #[inline]
            pub unsafe fn GetHostDefinedOptions(
                &mut self,
            ) -> root::v8::Local<root::v8::PrimitiveArray> {
                ScriptOrModule_GetHostDefinedOptions(self)
            }
        }
        /// An array to hold Primitive values. This is used by the embedder to
        /// pass host defined options to the ScriptOptions during compilation.
        ///
        /// This is passed back to the embedder as part of
        /// HostImportModuleDynamicallyCallback for module loading.
        ///
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct PrimitiveArray {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_PrimitiveArray() {
            assert_eq!(
                ::std::mem::size_of::<PrimitiveArray>(),
                1usize,
                concat!("Size of: ", stringify!(PrimitiveArray))
            );
            assert_eq!(
                ::std::mem::align_of::<PrimitiveArray>(),
                1usize,
                concat!("Alignment of ", stringify!(PrimitiveArray))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?New@PrimitiveArray@v8@@SA?AV?$Local@VPrimitiveArray@v8@@@2@PEAVIsolate@2@H@Z"]
            pub fn PrimitiveArray_New(
                isolate: *mut root::v8::Isolate,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::PrimitiveArray>;
        }
        extern "C" {
            #[link_name = "\u{1}?Length@PrimitiveArray@v8@@QEBAHXZ"]
            pub fn PrimitiveArray_Length(
                this: *const root::v8::PrimitiveArray,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}?Set@PrimitiveArray@v8@@QEAAXPEAVIsolate@2@HV?$Local@VPrimitive@v8@@@2@@Z"]
            pub fn PrimitiveArray_Set(
                this: *mut root::v8::PrimitiveArray,
                isolate: *mut root::v8::Isolate,
                index: ::std::os::raw::c_int,
                item: root::v8::Local<root::v8::Primitive>,
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Get@PrimitiveArray@v8@@QEAA?AV?$Local@VPrimitive@v8@@@2@PEAVIsolate@2@H@Z"]
            pub fn PrimitiveArray_Get(
                this: *mut root::v8::PrimitiveArray,
                isolate: *mut root::v8::Isolate,
                index: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::Primitive>;
        }
        impl PrimitiveArray {
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::PrimitiveArray> {
                PrimitiveArray_New(isolate, length)
            }
            #[inline]
            pub unsafe fn Length(&self) -> ::std::os::raw::c_int {
                PrimitiveArray_Length(self)
            }
            #[inline]
            pub unsafe fn Set(
                &mut self,
                isolate: *mut root::v8::Isolate,
                index: ::std::os::raw::c_int,
                item: root::v8::Local<root::v8::Primitive>,
            ) {
                PrimitiveArray_Set(self, isolate, index, item)
            }
            #[inline]
            pub unsafe fn Get(
                &mut self,
                isolate: *mut root::v8::Isolate,
                index: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::Primitive> {
                PrimitiveArray_Get(self, isolate, index)
            }
        }
        /// The optional attributes of ScriptOrigin.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct ScriptOriginOptions {
            pub flags_: ::std::os::raw::c_int,
        }
        pub const ScriptOriginOptions_kIsSharedCrossOrigin:
            root::v8::ScriptOriginOptions__bindgen_ty_1 = 1;
        pub const ScriptOriginOptions_kIsOpaque: root::v8::ScriptOriginOptions__bindgen_ty_1 = 2;
        pub const ScriptOriginOptions_kIsWasm: root::v8::ScriptOriginOptions__bindgen_ty_1 = 4;
        pub const ScriptOriginOptions_kIsModule: root::v8::ScriptOriginOptions__bindgen_ty_1 = 8;
        pub type ScriptOriginOptions__bindgen_ty_1 = i32;
        #[test]
        fn bindgen_test_layout_ScriptOriginOptions() {
            assert_eq!(
                ::std::mem::size_of::<ScriptOriginOptions>(),
                4usize,
                concat!("Size of: ", stringify!(ScriptOriginOptions))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptOriginOptions>(),
                4usize,
                concat!("Alignment of ", stringify!(ScriptOriginOptions))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptOriginOptions>())).flags_ as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOriginOptions),
                    "::",
                    stringify!(flags_)
                )
            );
        }
        /// The origin, within a file, of a script.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct ScriptOrigin {
            pub resource_name_: root::v8::Local<root::v8::Value>,
            pub resource_line_offset_: root::v8::Local<root::v8::Integer>,
            pub resource_column_offset_: root::v8::Local<root::v8::Integer>,
            pub options_: root::v8::ScriptOriginOptions,
            pub script_id_: root::v8::Local<root::v8::Integer>,
            pub source_map_url_: root::v8::Local<root::v8::Value>,
            pub host_defined_options_: root::v8::Local<root::v8::PrimitiveArray>,
        }
        #[test]
        fn bindgen_test_layout_ScriptOrigin() {
            assert_eq!(
                ::std::mem::size_of::<ScriptOrigin>(),
                56usize,
                concat!("Size of: ", stringify!(ScriptOrigin))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptOrigin>(),
                8usize,
                concat!("Alignment of ", stringify!(ScriptOrigin))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptOrigin>())).resource_name_ as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOrigin),
                    "::",
                    stringify!(resource_name_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptOrigin>())).resource_line_offset_ as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOrigin),
                    "::",
                    stringify!(resource_line_offset_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptOrigin>())).resource_column_offset_ as *const _
                        as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOrigin),
                    "::",
                    stringify!(resource_column_offset_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ScriptOrigin>())).options_ as *const _ as usize },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOrigin),
                    "::",
                    stringify!(options_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ScriptOrigin>())).script_id_ as *const _ as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOrigin),
                    "::",
                    stringify!(script_id_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptOrigin>())).source_map_url_ as *const _ as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOrigin),
                    "::",
                    stringify!(source_map_url_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptOrigin>())).host_defined_options_ as *const _
                        as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptOrigin),
                    "::",
                    stringify!(host_defined_options_)
                )
            );
        }
        /// A compiled JavaScript script, not yet tied to a Context.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct UnboundScript {
            pub _address: u8,
        }
        pub const UnboundScript_kNoScriptId: ::std::os::raw::c_int = 0;
        #[test]
        fn bindgen_test_layout_UnboundScript() {
            assert_eq!(
                ::std::mem::size_of::<UnboundScript>(),
                1usize,
                concat!("Size of: ", stringify!(UnboundScript))
            );
            assert_eq!(
                ::std::mem::align_of::<UnboundScript>(),
                1usize,
                concat!("Alignment of ", stringify!(UnboundScript))
            );
        }
        extern "C" {
            /// Binds the script to the currently entered context.
            #[link_name = "\u{1}?BindToCurrentContext@UnboundScript@v8@@QEAA?AV?$Local@VScript@v8@@@2@XZ"]
            pub fn UnboundScript_BindToCurrentContext(
                this: *mut root::v8::UnboundScript,
            ) -> root::v8::Local<root::v8::Script>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetId@UnboundScript@v8@@QEAAHXZ"]
            pub fn UnboundScript_GetId(this: *mut root::v8::UnboundScript)
                -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}?GetScriptName@UnboundScript@v8@@QEAA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn UnboundScript_GetScriptName(
                this: *mut root::v8::UnboundScript,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Data read from magic sourceURL comments.
            #[link_name = "\u{1}?GetSourceURL@UnboundScript@v8@@QEAA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn UnboundScript_GetSourceURL(
                this: *mut root::v8::UnboundScript,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Data read from magic sourceMappingURL comments.
            #[link_name = "\u{1}?GetSourceMappingURL@UnboundScript@v8@@QEAA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn UnboundScript_GetSourceMappingURL(
                this: *mut root::v8::UnboundScript,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Returns zero based line number of the code_pos location in the script.
            /// -1 will be returned if no information available.
            #[link_name = "\u{1}?GetLineNumber@UnboundScript@v8@@QEAAHH@Z"]
            pub fn UnboundScript_GetLineNumber(
                this: *mut root::v8::UnboundScript,
                code_pos: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        impl UnboundScript {
            #[inline]
            pub unsafe fn BindToCurrentContext(&mut self) -> root::v8::Local<root::v8::Script> {
                UnboundScript_BindToCurrentContext(self)
            }
            #[inline]
            pub unsafe fn GetId(&mut self) -> ::std::os::raw::c_int {
                UnboundScript_GetId(self)
            }
            #[inline]
            pub unsafe fn GetScriptName(&mut self) -> root::v8::Local<root::v8::Value> {
                UnboundScript_GetScriptName(self)
            }
            #[inline]
            pub unsafe fn GetSourceURL(&mut self) -> root::v8::Local<root::v8::Value> {
                UnboundScript_GetSourceURL(self)
            }
            #[inline]
            pub unsafe fn GetSourceMappingURL(&mut self) -> root::v8::Local<root::v8::Value> {
                UnboundScript_GetSourceMappingURL(self)
            }
            #[inline]
            pub unsafe fn GetLineNumber(
                &mut self,
                code_pos: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int {
                UnboundScript_GetLineNumber(self, code_pos)
            }
        }
        /// A compiled JavaScript module, not yet tied to a Context.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct UnboundModuleScript {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_UnboundModuleScript() {
            assert_eq!(
                ::std::mem::size_of::<UnboundModuleScript>(),
                1usize,
                concat!("Size of: ", stringify!(UnboundModuleScript))
            );
            assert_eq!(
                ::std::mem::align_of::<UnboundModuleScript>(),
                1usize,
                concat!("Alignment of ", stringify!(UnboundModuleScript))
            );
        }
        /// A location in JavaScript source.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Location {
            pub line_number_: ::std::os::raw::c_int,
            pub column_number_: ::std::os::raw::c_int,
        }
        #[test]
        fn bindgen_test_layout_Location() {
            assert_eq!(
                ::std::mem::size_of::<Location>(),
                8usize,
                concat!("Size of: ", stringify!(Location))
            );
            assert_eq!(
                ::std::mem::align_of::<Location>(),
                4usize,
                concat!("Alignment of ", stringify!(Location))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<Location>())).line_number_ as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Location),
                    "::",
                    stringify!(line_number_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<Location>())).column_number_ as *const _ as usize },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Location),
                    "::",
                    stringify!(column_number_)
                )
            );
        }
        /// A compiled JavaScript module.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Module {
            pub _address: u8,
        }
        pub const Module_Status_kUninstantiated: root::v8::Module_Status = 0;
        pub const Module_Status_kInstantiating: root::v8::Module_Status = 1;
        pub const Module_Status_kInstantiated: root::v8::Module_Status = 2;
        pub const Module_Status_kEvaluating: root::v8::Module_Status = 3;
        pub const Module_Status_kEvaluated: root::v8::Module_Status = 4;
        pub const Module_Status_kErrored: root::v8::Module_Status = 5;
        /// The different states a module can be in.
        ///
        /// This corresponds to the states used in ECMAScript except that "evaluated"
        /// is split into kEvaluated and kErrored, indicating success and failure,
        /// respectively.
        pub type Module_Status = i32;
        pub type Module_ResolveCallback = ::std::option::Option<
            unsafe extern "C" fn(
                context: root::v8::Local<root::v8::Context>,
                specifier: root::v8::Local<root::v8::String>,
                referrer: root::v8::Local<root::v8::Module>,
            ) -> root::v8::MaybeLocal<root::v8::Module>,
        >;
        #[test]
        fn bindgen_test_layout_Module() {
            assert_eq!(
                ::std::mem::size_of::<Module>(),
                1usize,
                concat!("Size of: ", stringify!(Module))
            );
            assert_eq!(
                ::std::mem::align_of::<Module>(),
                1usize,
                concat!("Alignment of ", stringify!(Module))
            );
        }
        extern "C" {
            /// Returns the module's current status.
            #[link_name = "\u{1}?GetStatus@Module@v8@@QEBA?AW4Status@12@XZ"]
            pub fn Module_GetStatus(this: *const root::v8::Module) -> root::v8::Module_Status;
        }
        extern "C" {
            /// For a module in kErrored status, this returns the corresponding exception.
            #[link_name = "\u{1}?GetException@Module@v8@@QEBA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn Module_GetException(
                this: *const root::v8::Module,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Returns the number of modules requested by this module.
            #[link_name = "\u{1}?GetModuleRequestsLength@Module@v8@@QEBAHXZ"]
            pub fn Module_GetModuleRequestsLength(
                this: *const root::v8::Module,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the ith module specifier in this module.
            /// i must be < GetModuleRequestsLength() and >= 0.
            #[link_name = "\u{1}?GetModuleRequest@Module@v8@@QEBA?AV?$Local@VString@v8@@@2@H@Z"]
            pub fn Module_GetModuleRequest(
                this: *const root::v8::Module,
                i: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Returns the source location (line number and column number) of the ith
            /// module specifier's first occurrence in this module.
            #[link_name = "\u{1}?GetModuleRequestLocation@Module@v8@@QEBA?AVLocation@2@H@Z"]
            pub fn Module_GetModuleRequestLocation(
                this: *const root::v8::Module,
                i: ::std::os::raw::c_int,
            ) -> root::v8::Location;
        }
        extern "C" {
            /// Returns the identity hash for this object.
            #[link_name = "\u{1}?GetIdentityHash@Module@v8@@QEBAHXZ"]
            pub fn Module_GetIdentityHash(this: *const root::v8::Module) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Instantiates the module and its dependencies.
            ///
            /// Returns an empty Maybe<bool> if an exception occurred during
            /// instantiation. (In the case where the callback throws an exception, that
            /// exception is propagated.)
            #[link_name = "\u{1}?InstantiateModule@Module@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@P6A?AV?$MaybeLocal@VModule@v8@@@2@0V?$Local@VString@v8@@@2@V?$Local@VModule@v8@@@2@@Z@Z"]
            pub fn Module_InstantiateModule(
                this: *mut root::v8::Module,
                context: root::v8::Local<root::v8::Context>,
                callback: root::v8::Module_ResolveCallback,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Evaluates the module and its dependencies.
            ///
            /// If status is kInstantiated, run the module's code. On success, set status
            /// to kEvaluated and return the completion value; on failure, set status to
            /// kErrored and propagate the thrown exception (which is then also available
            /// via |GetException|).
            #[link_name = "\u{1}?Evaluate@Module@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Module_Evaluate(
                this: *mut root::v8::Module,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Returns the namespace object of this module.
            ///
            /// The module's status must be at least kInstantiated.
            #[link_name = "\u{1}?GetModuleNamespace@Module@v8@@QEAA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn Module_GetModuleNamespace(
                this: *mut root::v8::Module,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Returns the corresponding context-unbound module script.
            ///
            /// The module must be unevaluated, i.e. its status must not be kEvaluating,
            /// kEvaluated or kErrored.
            #[link_name = "\u{1}?GetUnboundModuleScript@Module@v8@@QEAA?AV?$Local@VUnboundModuleScript@v8@@@2@XZ"]
            pub fn Module_GetUnboundModuleScript(
                this: *mut root::v8::Module,
            ) -> root::v8::Local<root::v8::UnboundModuleScript>;
        }
        impl Module {
            #[inline]
            pub unsafe fn GetStatus(&self) -> root::v8::Module_Status {
                Module_GetStatus(self)
            }
            #[inline]
            pub unsafe fn GetException(&self) -> root::v8::Local<root::v8::Value> {
                Module_GetException(self)
            }
            #[inline]
            pub unsafe fn GetModuleRequestsLength(&self) -> ::std::os::raw::c_int {
                Module_GetModuleRequestsLength(self)
            }
            #[inline]
            pub unsafe fn GetModuleRequest(
                &self,
                i: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::String> {
                Module_GetModuleRequest(self, i)
            }
            #[inline]
            pub unsafe fn GetModuleRequestLocation(
                &self,
                i: ::std::os::raw::c_int,
            ) -> root::v8::Location {
                Module_GetModuleRequestLocation(self, i)
            }
            #[inline]
            pub unsafe fn GetIdentityHash(&self) -> ::std::os::raw::c_int {
                Module_GetIdentityHash(self)
            }
            #[inline]
            pub unsafe fn InstantiateModule(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                callback: root::v8::Module_ResolveCallback,
            ) -> root::v8::Maybe<bool> {
                Module_InstantiateModule(self, context, callback)
            }
            #[inline]
            pub unsafe fn Evaluate(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Module_Evaluate(self, context)
            }
            #[inline]
            pub unsafe fn GetModuleNamespace(&mut self) -> root::v8::Local<root::v8::Value> {
                Module_GetModuleNamespace(self)
            }
            #[inline]
            pub unsafe fn GetUnboundModuleScript(
                &mut self,
            ) -> root::v8::Local<root::v8::UnboundModuleScript> {
                Module_GetUnboundModuleScript(self)
            }
        }
        /// A compiled JavaScript script, tied to a Context which was active when the
        /// script was compiled.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Script {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Script() {
            assert_eq!(
                ::std::mem::size_of::<Script>(),
                1usize,
                concat!("Size of: ", stringify!(Script))
            );
            assert_eq!(
                ::std::mem::align_of::<Script>(),
                1usize,
                concat!("Alignment of ", stringify!(Script))
            );
        }
        extern "C" {
            /// A shorthand for ScriptCompiler::Compile().
            #[link_name = "\u{1}?Compile@Script@v8@@SA?AV?$MaybeLocal@VScript@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VString@v8@@@2@PEAVScriptOrigin@2@@Z"]
            pub fn Script_Compile(
                context: root::v8::Local<root::v8::Context>,
                source: root::v8::Local<root::v8::String>,
                origin: *mut root::v8::ScriptOrigin,
            ) -> root::v8::MaybeLocal<root::v8::Script>;
        }
        extern "C" {
            /// Runs the script returning the resulting value. It will be run in the
            /// context in which it was created (ScriptCompiler::CompileBound or
            /// UnboundScript::BindToCurrentContext()).
            #[link_name = "\u{1}?Run@Script@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Script_Run(
                this: *mut root::v8::Script,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Returns the corresponding context-unbound script.
            #[link_name = "\u{1}?GetUnboundScript@Script@v8@@QEAA?AV?$Local@VUnboundScript@v8@@@2@XZ"]
            pub fn Script_GetUnboundScript(
                this: *mut root::v8::Script,
            ) -> root::v8::Local<root::v8::UnboundScript>;
        }
        impl Script {
            #[inline]
            pub unsafe fn Compile(
                context: root::v8::Local<root::v8::Context>,
                source: root::v8::Local<root::v8::String>,
                origin: *mut root::v8::ScriptOrigin,
            ) -> root::v8::MaybeLocal<root::v8::Script> {
                Script_Compile(context, source, origin)
            }
            #[inline]
            pub unsafe fn Run(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Script_Run(self, context)
            }
            #[inline]
            pub unsafe fn GetUnboundScript(&mut self) -> root::v8::Local<root::v8::UnboundScript> {
                Script_GetUnboundScript(self)
            }
        }
        /// Compilation data that the embedder can cache and pass back to speed up
        /// future compilations. The data is produced if the CompilerOptions passed to
        /// the compilation functions in ScriptCompiler contains produce_data_to_cache
        /// = true. The data to cache can then can be retrieved from
        /// UnboundScript.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ScriptCompiler_CachedData {
            pub data: *const u8,
            pub length: ::std::os::raw::c_int,
            pub rejected: bool,
            pub buffer_policy: root::v8::ScriptCompiler_CachedData_BufferPolicy,
        }
        pub const ScriptCompiler_CachedData_BufferPolicy_BufferNotOwned:
            root::v8::ScriptCompiler_CachedData_BufferPolicy = 0;
        pub const ScriptCompiler_CachedData_BufferPolicy_BufferOwned:
            root::v8::ScriptCompiler_CachedData_BufferPolicy = 1;
        pub type ScriptCompiler_CachedData_BufferPolicy = i32;
        #[test]
        fn bindgen_test_layout_ScriptCompiler_CachedData() {
            assert_eq!(
                ::std::mem::size_of::<ScriptCompiler_CachedData>(),
                24usize,
                concat!("Size of: ", stringify!(ScriptCompiler_CachedData))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptCompiler_CachedData>(),
                8usize,
                concat!("Alignment of ", stringify!(ScriptCompiler_CachedData))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_CachedData>())).data as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_CachedData),
                    "::",
                    stringify!(data)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_CachedData>())).length as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_CachedData),
                    "::",
                    stringify!(length)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_CachedData>())).rejected as *const _
                        as usize
                },
                12usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_CachedData),
                    "::",
                    stringify!(rejected)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_CachedData>())).buffer_policy as *const _
                        as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_CachedData),
                    "::",
                    stringify!(buffer_policy)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0CachedData@ScriptCompiler@v8@@QEAA@PEBEHW4BufferPolicy@012@@Z"]
            pub fn ScriptCompiler_CachedData_CachedData(
                this: *mut root::v8::ScriptCompiler_CachedData,
                data: *const u8,
                length: ::std::os::raw::c_int,
                buffer_policy: root::v8::ScriptCompiler_CachedData_BufferPolicy,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DCachedData@ScriptCompiler@v8@@QEAAXXZ"]
            pub fn ScriptCompiler_CachedData_CachedData_destructor(
                this: *mut root::v8::ScriptCompiler_CachedData,
            );
        }
        impl ScriptCompiler_CachedData {
            #[inline]
            pub unsafe fn new(
                data: *const u8,
                length: ::std::os::raw::c_int,
                buffer_policy: root::v8::ScriptCompiler_CachedData_BufferPolicy,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ScriptCompiler_CachedData_CachedData(
                    &mut __bindgen_tmp,
                    data,
                    length,
                    buffer_policy,
                );
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                ScriptCompiler_CachedData_CachedData_destructor(self)
            }
        }
        /// Source code which can be then compiled to a UnboundScript or Script.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ScriptCompiler_Source {
            pub source_string: root::v8::Local<root::v8::String>,
            pub resource_name: root::v8::Local<root::v8::Value>,
            pub resource_line_offset: root::v8::Local<root::v8::Integer>,
            pub resource_column_offset: root::v8::Local<root::v8::Integer>,
            pub resource_options: root::v8::ScriptOriginOptions,
            pub source_map_url: root::v8::Local<root::v8::Value>,
            pub host_defined_options: root::v8::Local<root::v8::PrimitiveArray>,
            pub cached_data: *mut root::v8::ScriptCompiler_CachedData,
        }
        #[test]
        fn bindgen_test_layout_ScriptCompiler_Source() {
            assert_eq!(
                ::std::mem::size_of::<ScriptCompiler_Source>(),
                64usize,
                concat!("Size of: ", stringify!(ScriptCompiler_Source))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptCompiler_Source>(),
                8usize,
                concat!("Alignment of ", stringify!(ScriptCompiler_Source))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).source_string as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(source_string)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).resource_name as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(resource_name)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).resource_line_offset
                        as *const _ as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(resource_line_offset)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).resource_column_offset
                        as *const _ as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(resource_column_offset)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).resource_options as *const _
                        as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(resource_options)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).source_map_url as *const _
                        as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(source_map_url)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).host_defined_options
                        as *const _ as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(host_defined_options)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_Source>())).cached_data as *const _
                        as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_Source),
                    "::",
                    stringify!(cached_data)
                )
            );
        }
        #[repr(C)]
        pub struct ScriptCompiler_ExternalSourceStream__bindgen_vtable(::std::os::raw::c_void);
        /// For streaming incomplete script data to V8. The embedder should implement a
        /// subclass of this class.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ScriptCompiler_ExternalSourceStream {
            pub vtable_: *const ScriptCompiler_ExternalSourceStream__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_ScriptCompiler_ExternalSourceStream() {
            assert_eq!(
                ::std::mem::size_of::<ScriptCompiler_ExternalSourceStream>(),
                8usize,
                concat!("Size of: ", stringify!(ScriptCompiler_ExternalSourceStream))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptCompiler_ExternalSourceStream>(),
                8usize,
                concat!(
                    "Alignment of ",
                    stringify!(ScriptCompiler_ExternalSourceStream)
                )
            );
        }
        extern "C" {
            /// V8 calls this method to set a 'bookmark' at the current position in
            /// the source stream, for the purpose of (maybe) later calling
            /// ResetToBookmark. If ResetToBookmark is called later, then subsequent
            /// calls to GetMoreData should return the same data as they did when
            /// SetBookmark was called earlier.
            ///
            /// The embedder may return 'false' to indicate it cannot provide this
            /// functionality.
            #[link_name = "\u{1}?SetBookmark@ExternalSourceStream@ScriptCompiler@v8@@UEAA_NXZ"]
            pub fn ScriptCompiler_ExternalSourceStream_SetBookmark(
                this: *mut ::std::os::raw::c_void,
            ) -> bool;
        }
        extern "C" {
            /// V8 calls this to return to a previously set bookmark.
            #[link_name = "\u{1}?ResetToBookmark@ExternalSourceStream@ScriptCompiler@v8@@UEAAXXZ"]
            pub fn ScriptCompiler_ExternalSourceStream_ResetToBookmark(
                this: *mut ::std::os::raw::c_void,
            );
        }
        /// Source code which can be streamed into V8 in pieces. It will be parsed
        /// while streaming. It can be compiled after the streaming is complete.
        /// StreamedSource must be kept alive while the streaming task is ran (see
        /// ScriptStreamingTask below).
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ScriptCompiler_StreamedSource {
            pub impl_: *mut root::v8::internal::ScriptStreamingData,
        }
        pub const ScriptCompiler_StreamedSource_Encoding_ONE_BYTE:
            root::v8::ScriptCompiler_StreamedSource_Encoding = 0;
        pub const ScriptCompiler_StreamedSource_Encoding_TWO_BYTE:
            root::v8::ScriptCompiler_StreamedSource_Encoding = 1;
        pub const ScriptCompiler_StreamedSource_Encoding_UTF8:
            root::v8::ScriptCompiler_StreamedSource_Encoding = 2;
        pub type ScriptCompiler_StreamedSource_Encoding = i32;
        #[test]
        fn bindgen_test_layout_ScriptCompiler_StreamedSource() {
            assert_eq!(
                ::std::mem::size_of::<ScriptCompiler_StreamedSource>(),
                8usize,
                concat!("Size of: ", stringify!(ScriptCompiler_StreamedSource))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptCompiler_StreamedSource>(),
                8usize,
                concat!("Alignment of ", stringify!(ScriptCompiler_StreamedSource))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ScriptCompiler_StreamedSource>())).impl_ as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ScriptCompiler_StreamedSource),
                    "::",
                    stringify!(impl_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}?GetCachedData@StreamedSource@ScriptCompiler@v8@@QEBAPEBUCachedData@23@XZ"]
            pub fn ScriptCompiler_StreamedSource_GetCachedData(
                this: *const root::v8::ScriptCompiler_StreamedSource,
            ) -> *const root::v8::ScriptCompiler_CachedData;
        }
        extern "C" {
            #[link_name = "\u{1}??0StreamedSource@ScriptCompiler@v8@@QEAA@PEAVExternalSourceStream@12@W4Encoding@012@@Z"]
            pub fn ScriptCompiler_StreamedSource_StreamedSource(
                this: *mut root::v8::ScriptCompiler_StreamedSource,
                source_stream: *mut root::v8::ScriptCompiler_ExternalSourceStream,
                encoding: root::v8::ScriptCompiler_StreamedSource_Encoding,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DStreamedSource@ScriptCompiler@v8@@QEAAXXZ"]
            pub fn ScriptCompiler_StreamedSource_StreamedSource_destructor(
                this: *mut root::v8::ScriptCompiler_StreamedSource,
            );
        }
        impl ScriptCompiler_StreamedSource {
            #[inline]
            pub unsafe fn GetCachedData(&self) -> *const root::v8::ScriptCompiler_CachedData {
                ScriptCompiler_StreamedSource_GetCachedData(self)
            }
            #[inline]
            pub unsafe fn new(
                source_stream: *mut root::v8::ScriptCompiler_ExternalSourceStream,
                encoding: root::v8::ScriptCompiler_StreamedSource_Encoding,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ScriptCompiler_StreamedSource_StreamedSource(
                    &mut __bindgen_tmp,
                    source_stream,
                    encoding,
                );
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                ScriptCompiler_StreamedSource_StreamedSource_destructor(self)
            }
        }
        #[repr(C)]
        pub struct ScriptCompiler_ScriptStreamingTask__bindgen_vtable(::std::os::raw::c_void);
        /// A streaming task which the embedder must run on a background thread to
        /// stream scripts into V8. Returned by ScriptCompiler::StartStreamingScript.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ScriptCompiler_ScriptStreamingTask {
            pub vtable_: *const ScriptCompiler_ScriptStreamingTask__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_ScriptCompiler_ScriptStreamingTask() {
            assert_eq!(
                ::std::mem::size_of::<ScriptCompiler_ScriptStreamingTask>(),
                8usize,
                concat!("Size of: ", stringify!(ScriptCompiler_ScriptStreamingTask))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptCompiler_ScriptStreamingTask>(),
                8usize,
                concat!(
                    "Alignment of ",
                    stringify!(ScriptCompiler_ScriptStreamingTask)
                )
            );
        }
        pub const ScriptCompiler_CompileOptions_kNoCompileOptions:
            root::v8::ScriptCompiler_CompileOptions = 0;
        pub const ScriptCompiler_CompileOptions_kProduceParserCache:
            root::v8::ScriptCompiler_CompileOptions = 1;
        pub const ScriptCompiler_CompileOptions_kConsumeParserCache:
            root::v8::ScriptCompiler_CompileOptions = 2;
        pub const ScriptCompiler_CompileOptions_kProduceCodeCache:
            root::v8::ScriptCompiler_CompileOptions = 3;
        pub const ScriptCompiler_CompileOptions_kProduceFullCodeCache:
            root::v8::ScriptCompiler_CompileOptions = 4;
        pub const ScriptCompiler_CompileOptions_kConsumeCodeCache:
            root::v8::ScriptCompiler_CompileOptions = 5;
        pub const ScriptCompiler_CompileOptions_kEagerCompile:
            root::v8::ScriptCompiler_CompileOptions = 6;
        pub type ScriptCompiler_CompileOptions = i32;
        pub const ScriptCompiler_NoCacheReason_kNoCacheNoReason:
            root::v8::ScriptCompiler_NoCacheReason = 0;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseCachingDisabled:
            root::v8::ScriptCompiler_NoCacheReason = 1;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseNoResource:
            root::v8::ScriptCompiler_NoCacheReason = 2;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseInlineScript:
            root::v8::ScriptCompiler_NoCacheReason = 3;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseModule:
            root::v8::ScriptCompiler_NoCacheReason = 4;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseStreamingSource:
            root::v8::ScriptCompiler_NoCacheReason = 5;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseInspector:
            root::v8::ScriptCompiler_NoCacheReason = 6;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseScriptTooSmall:
            root::v8::ScriptCompiler_NoCacheReason = 7;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseCacheTooCold:
            root::v8::ScriptCompiler_NoCacheReason = 8;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseV8Extension:
            root::v8::ScriptCompiler_NoCacheReason = 9;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseExtensionModule:
            root::v8::ScriptCompiler_NoCacheReason = 10;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecausePacScript:
            root::v8::ScriptCompiler_NoCacheReason = 11;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseInDocumentWrite:
            root::v8::ScriptCompiler_NoCacheReason = 12;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseResourceWithNoCacheHandler:
            root::v8::ScriptCompiler_NoCacheReason = 13;
        pub const ScriptCompiler_NoCacheReason_kNoCacheBecauseDeferredProduceCodeCache:
            root::v8::ScriptCompiler_NoCacheReason = 14;
        /// The reason for which we are not requesting or providing a code cache.
        pub type ScriptCompiler_NoCacheReason = i32;
        extern "C" {
            /// Compiles the specified script (context-independent).
            /// Cached data as part of the source object can be optionally produced to be
            /// consumed later to speed up compilation of identical source scripts.
            ///
            /// Note that when producing cached data, the source must point to NULL for
            /// cached data. When consuming cached data, the cached data must have been
            /// produced by the same version of V8.
            ///
            /// \param source Script source code.
            /// \return Compiled script object (context independent; for running it must be
            /// bound to a context).
            #[link_name = "\u{1}?CompileUnboundScript@ScriptCompiler@v8@@SA?AV?$MaybeLocal@VUnboundScript@v8@@@2@PEAVIsolate@2@PEAVSource@12@W4CompileOptions@12@W4NoCacheReason@12@@Z"]
            pub fn ScriptCompiler_CompileUnboundScript(
                isolate: *mut root::v8::Isolate,
                source: *mut root::v8::ScriptCompiler_Source,
                options: root::v8::ScriptCompiler_CompileOptions,
                no_cache_reason: root::v8::ScriptCompiler_NoCacheReason,
            ) -> root::v8::MaybeLocal<root::v8::UnboundScript>;
        }
        extern "C" {
            /// Compiles the specified script (bound to current context).
            ///
            /// \param source Script source code.
            /// \param pre_data Pre-parsing data, as obtained by ScriptData::PreCompile()
            /// using pre_data speeds compilation if it's done multiple times.
            /// Owned by caller, no references are kept when this function returns.
            /// \return Compiled script object, bound to the context that was active
            /// when this function was called. When run it will always use this
            /// context.
            #[link_name = "\u{1}?Compile@ScriptCompiler@v8@@SA?AV?$MaybeLocal@VScript@v8@@@2@V?$Local@VContext@v8@@@2@PEAVSource@12@W4CompileOptions@12@W4NoCacheReason@12@@Z"]
            pub fn ScriptCompiler_Compile(
                context: root::v8::Local<root::v8::Context>,
                source: *mut root::v8::ScriptCompiler_Source,
                options: root::v8::ScriptCompiler_CompileOptions,
                no_cache_reason: root::v8::ScriptCompiler_NoCacheReason,
            ) -> root::v8::MaybeLocal<root::v8::Script>;
        }
        extern "C" {
            /// Returns a task which streams script data into V8, or NULL if the script
            /// cannot be streamed. The user is responsible for running the task on a
            /// background thread and deleting it. When ran, the task starts parsing the
            /// script, and it will request data from the StreamedSource as needed. When
            /// ScriptStreamingTask::Run exits, all data has been streamed and the script
            /// can be compiled (see Compile below).
            ///
            /// This API allows to start the streaming with as little data as possible, and
            /// the remaining data (for example, the ScriptOrigin) is passed to Compile.
            #[link_name = "\u{1}?StartStreamingScript@ScriptCompiler@v8@@SAPEAVScriptStreamingTask@12@PEAVIsolate@2@PEAVStreamedSource@12@W4CompileOptions@12@@Z"]
            pub fn ScriptCompiler_StartStreamingScript(
                isolate: *mut root::v8::Isolate,
                source: *mut root::v8::ScriptCompiler_StreamedSource,
                options: root::v8::ScriptCompiler_CompileOptions,
            ) -> *mut root::v8::ScriptCompiler_ScriptStreamingTask;
        }
        extern "C" {
            /// Compiles a streamed script (bound to current context).
            ///
            /// This can only be called after the streaming has finished
            /// (ScriptStreamingTask has been run). V8 doesn't construct the source string
            /// during streaming, so the embedder needs to pass the full source here.
            #[link_name = "\u{1}?Compile@ScriptCompiler@v8@@SA?AV?$MaybeLocal@VScript@v8@@@2@V?$Local@VContext@v8@@@2@PEAVStreamedSource@12@V?$Local@VString@v8@@@2@AEBVScriptOrigin@2@@Z"]
            pub fn ScriptCompiler_Compile1(
                context: root::v8::Local<root::v8::Context>,
                source: *mut root::v8::ScriptCompiler_StreamedSource,
                full_source_string: root::v8::Local<root::v8::String>,
                origin: *const root::v8::ScriptOrigin,
            ) -> root::v8::MaybeLocal<root::v8::Script>;
        }
        extern "C" {
            /// Return a version tag for CachedData for the current V8 version & flags.
            ///
            /// This value is meant only for determining whether a previously generated
            /// CachedData instance is still valid; the tag has no other meaing.
            ///
            /// Background: The data carried by CachedData may depend on the exact
            /// V8 version number or current compiler flags. This means that when
            /// persisting CachedData, the embedder must take care to not pass in
            /// data from another V8 version, or the same version with different
            /// features enabled.
            ///
            /// The easiest way to do so is to clear the embedder's cache on any
            /// such change.
            ///
            /// Alternatively, this tag can be stored alongside the cached data and
            /// compared when it is being used.
            #[link_name = "\u{1}?CachedDataVersionTag@ScriptCompiler@v8@@SAIXZ"]
            pub fn ScriptCompiler_CachedDataVersionTag() -> u32;
        }
        extern "C" {
            /// Compile an ES module, returning a Module that encapsulates
            /// the compiled code.
            ///
            /// Corresponds to the ParseModule abstract operation in the
            /// ECMAScript specification.
            #[link_name = "\u{1}?CompileModule@ScriptCompiler@v8@@SA?AV?$MaybeLocal@VModule@v8@@@2@PEAVIsolate@2@PEAVSource@12@W4CompileOptions@12@W4NoCacheReason@12@@Z"]
            pub fn ScriptCompiler_CompileModule(
                isolate: *mut root::v8::Isolate,
                source: *mut root::v8::ScriptCompiler_Source,
                options: root::v8::ScriptCompiler_CompileOptions,
                no_cache_reason: root::v8::ScriptCompiler_NoCacheReason,
            ) -> root::v8::MaybeLocal<root::v8::Module>;
        }
        extern "C" {
            /// Compile a function for a given context. This is equivalent to running
            ///
            /// with (obj) {
            /// return function(args) { ... }
            /// }
            ///
            /// It is possible to specify multiple context extensions (obj in the above
            /// example).
            #[link_name = "\u{1}?CompileFunctionInContext@ScriptCompiler@v8@@SA?AV?$MaybeLocal@VFunction@v8@@@2@V?$Local@VContext@v8@@@2@PEAVSource@12@_KQEAV?$Local@VString@v8@@@2@2QEAV?$Local@VObject@v8@@@2@W4CompileOptions@12@W4NoCacheReason@12@@Z"]
            pub fn ScriptCompiler_CompileFunctionInContext(
                context: root::v8::Local<root::v8::Context>,
                source: *mut root::v8::ScriptCompiler_Source,
                arguments_count: usize,
                arguments: *mut root::v8::Local<root::v8::String>,
                context_extension_count: usize,
                context_extensions: *mut root::v8::Local<root::v8::Object>,
                options: root::v8::ScriptCompiler_CompileOptions,
                no_cache_reason: root::v8::ScriptCompiler_NoCacheReason,
            ) -> root::v8::MaybeLocal<root::v8::Function>;
        }
        extern "C" {
            /// Creates and returns code cache for the specified unbound_script.
            /// This will return nullptr if the script cannot be serialized. The
            /// CachedData returned by this function should be owned by the caller.
            #[link_name = "\u{1}?CreateCodeCache@ScriptCompiler@v8@@SAPEAUCachedData@12@V?$Local@VUnboundScript@v8@@@2@@Z"]
            pub fn ScriptCompiler_CreateCodeCache(
                unbound_script: root::v8::Local<root::v8::UnboundScript>,
            ) -> *mut root::v8::ScriptCompiler_CachedData;
        }
        extern "C" {
            /// Creates and returns code cache for the specified unbound_module_script.
            /// This will return nullptr if the script cannot be serialized. The
            /// CachedData returned by this function should be owned by the caller.
            #[link_name = "\u{1}?CreateCodeCache@ScriptCompiler@v8@@SAPEAUCachedData@12@V?$Local@VUnboundModuleScript@v8@@@2@@Z"]
            pub fn ScriptCompiler_CreateCodeCache1(
                unbound_module_script: root::v8::Local<root::v8::UnboundModuleScript>,
            ) -> *mut root::v8::ScriptCompiler_CachedData;
        }
        extern "C" {
            /// Creates and returns code cache for the specified function that was
            /// previously produced by CompileFunctionInContext.
            /// This will return nullptr if the script cannot be serialized. The
            /// CachedData returned by this function should be owned by the caller.
            #[link_name = "\u{1}?CreateCodeCacheForFunction@ScriptCompiler@v8@@SAPEAUCachedData@12@V?$Local@VFunction@v8@@@2@@Z"]
            pub fn ScriptCompiler_CreateCodeCacheForFunction(
                function: root::v8::Local<root::v8::Function>,
            ) -> *mut root::v8::ScriptCompiler_CachedData;
        }
        /// An error message.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Message {
            pub _address: u8,
        }
        pub const Message_kNoLineNumberInfo: ::std::os::raw::c_int = 0;
        pub const Message_kNoColumnInfo: ::std::os::raw::c_int = 0;
        pub const Message_kNoScriptIdInfo: ::std::os::raw::c_int = 0;
        #[test]
        fn bindgen_test_layout_Message() {
            assert_eq!(
                ::std::mem::size_of::<Message>(),
                1usize,
                concat!("Size of: ", stringify!(Message))
            );
            assert_eq!(
                ::std::mem::align_of::<Message>(),
                1usize,
                concat!("Alignment of ", stringify!(Message))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Get@Message@v8@@QEBA?AV?$Local@VString@v8@@@2@XZ"]
            pub fn Message_Get(this: *const root::v8::Message)
                -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Return the isolate to which the Message belongs.
            #[link_name = "\u{1}?GetIsolate@Message@v8@@QEBAPEAVIsolate@2@XZ"]
            pub fn Message_GetIsolate(this: *const root::v8::Message) -> *mut root::v8::Isolate;
        }
        extern "C" {
            #[link_name = "\u{1}?GetSourceLine@Message@v8@@QEBA?AV?$MaybeLocal@VString@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Message_GetSourceLine(
                this: *const root::v8::Message,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            /// Returns the origin for the script from where the function causing the
            /// error originates.
            #[link_name = "\u{1}?GetScriptOrigin@Message@v8@@QEBA?AVScriptOrigin@2@XZ"]
            pub fn Message_GetScriptOrigin(
                this: *const root::v8::Message,
            ) -> root::v8::ScriptOrigin;
        }
        extern "C" {
            /// Returns the resource name for the script from where the function causing
            /// the error originates.
            #[link_name = "\u{1}?GetScriptResourceName@Message@v8@@QEBA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn Message_GetScriptResourceName(
                this: *const root::v8::Message,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Exception stack trace. By default stack traces are not captured for
            /// uncaught exceptions. SetCaptureStackTraceForUncaughtExceptions allows
            /// to change this option.
            #[link_name = "\u{1}?GetStackTrace@Message@v8@@QEBA?AV?$Local@VStackTrace@v8@@@2@XZ"]
            pub fn Message_GetStackTrace(
                this: *const root::v8::Message,
            ) -> root::v8::Local<root::v8::StackTrace>;
        }
        extern "C" {
            /// Returns the number, 1-based, of the line where the error occurred.
            #[link_name = "\u{1}?GetLineNumber@Message@v8@@QEBA?AV?$Maybe@H@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Message_GetLineNumber(
                this: *const root::v8::Message,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<::std::os::raw::c_int>;
        }
        extern "C" {
            /// Returns the index within the script of the first character where
            /// the error occurred.
            #[link_name = "\u{1}?GetStartPosition@Message@v8@@QEBAHXZ"]
            pub fn Message_GetStartPosition(
                this: *const root::v8::Message,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the index within the script of the last character where
            /// the error occurred.
            #[link_name = "\u{1}?GetEndPosition@Message@v8@@QEBAHXZ"]
            pub fn Message_GetEndPosition(this: *const root::v8::Message) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the error level of the message.
            #[link_name = "\u{1}?ErrorLevel@Message@v8@@QEBAHXZ"]
            pub fn Message_ErrorLevel(this: *const root::v8::Message) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the index within the line of the first character where
            /// the error occurred.
            #[link_name = "\u{1}?GetStartColumn@Message@v8@@QEBAHXZ"]
            pub fn Message_GetStartColumn(this: *const root::v8::Message) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}?GetStartColumn@Message@v8@@QEBA?AV?$Maybe@H@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Message_GetStartColumn1(
                this: *const root::v8::Message,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<::std::os::raw::c_int>;
        }
        extern "C" {
            /// Returns the index within the line of the last character where
            /// the error occurred.
            #[link_name = "\u{1}?GetEndColumn@Message@v8@@QEBAHXZ"]
            pub fn Message_GetEndColumn(this: *const root::v8::Message) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}?GetEndColumn@Message@v8@@QEBA?AV?$Maybe@H@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Message_GetEndColumn1(
                this: *const root::v8::Message,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<::std::os::raw::c_int>;
        }
        extern "C" {
            /// Passes on the value set by the embedder when it fed the script from which
            /// this Message was generated to V8.
            #[link_name = "\u{1}?IsSharedCrossOrigin@Message@v8@@QEBA_NXZ"]
            pub fn Message_IsSharedCrossOrigin(this: *const root::v8::Message) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?IsOpaque@Message@v8@@QEBA_NXZ"]
            pub fn Message_IsOpaque(this: *const root::v8::Message) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?PrintCurrentStackTrace@Message@v8@@SAXPEAVIsolate@2@PEAU_iobuf@@@Z"]
            pub fn Message_PrintCurrentStackTrace(
                isolate: *mut root::v8::Isolate,
                out: *mut root::FILE,
            );
        }
        impl Message {
            #[inline]
            pub unsafe fn Get(&self) -> root::v8::Local<root::v8::String> {
                Message_Get(self)
            }
            #[inline]
            pub unsafe fn GetIsolate(&self) -> *mut root::v8::Isolate {
                Message_GetIsolate(self)
            }
            #[inline]
            pub unsafe fn GetSourceLine(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                Message_GetSourceLine(self, context)
            }
            #[inline]
            pub unsafe fn GetScriptOrigin(&self) -> root::v8::ScriptOrigin {
                Message_GetScriptOrigin(self)
            }
            #[inline]
            pub unsafe fn GetScriptResourceName(&self) -> root::v8::Local<root::v8::Value> {
                Message_GetScriptResourceName(self)
            }
            #[inline]
            pub unsafe fn GetStackTrace(&self) -> root::v8::Local<root::v8::StackTrace> {
                Message_GetStackTrace(self)
            }
            #[inline]
            pub unsafe fn GetLineNumber(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<::std::os::raw::c_int> {
                Message_GetLineNumber(self, context)
            }
            #[inline]
            pub unsafe fn GetStartPosition(&self) -> ::std::os::raw::c_int {
                Message_GetStartPosition(self)
            }
            #[inline]
            pub unsafe fn GetEndPosition(&self) -> ::std::os::raw::c_int {
                Message_GetEndPosition(self)
            }
            #[inline]
            pub unsafe fn ErrorLevel(&self) -> ::std::os::raw::c_int {
                Message_ErrorLevel(self)
            }
            #[inline]
            pub unsafe fn GetStartColumn(&self) -> ::std::os::raw::c_int {
                Message_GetStartColumn(self)
            }
            #[inline]
            pub unsafe fn GetStartColumn1(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<::std::os::raw::c_int> {
                Message_GetStartColumn1(self, context)
            }
            #[inline]
            pub unsafe fn GetEndColumn(&self) -> ::std::os::raw::c_int {
                Message_GetEndColumn(self)
            }
            #[inline]
            pub unsafe fn GetEndColumn1(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<::std::os::raw::c_int> {
                Message_GetEndColumn1(self, context)
            }
            #[inline]
            pub unsafe fn IsSharedCrossOrigin(&self) -> bool {
                Message_IsSharedCrossOrigin(self)
            }
            #[inline]
            pub unsafe fn IsOpaque(&self) -> bool {
                Message_IsOpaque(self)
            }
            #[inline]
            pub unsafe fn PrintCurrentStackTrace(
                isolate: *mut root::v8::Isolate,
                out: *mut root::FILE,
            ) {
                Message_PrintCurrentStackTrace(isolate, out)
            }
        }
        /// Representation of a JavaScript stack trace. The information collected is a
        /// snapshot of the execution stack and the information remains valid after
        /// execution continues.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct StackTrace {
            pub _address: u8,
        }
        pub const StackTrace_StackTraceOptions_kLineNumber: root::v8::StackTrace_StackTraceOptions =
            1;
        pub const StackTrace_StackTraceOptions_kColumnOffset:
            root::v8::StackTrace_StackTraceOptions = 3;
        pub const StackTrace_StackTraceOptions_kScriptName: root::v8::StackTrace_StackTraceOptions =
            4;
        pub const StackTrace_StackTraceOptions_kFunctionName:
            root::v8::StackTrace_StackTraceOptions = 8;
        pub const StackTrace_StackTraceOptions_kIsEval: root::v8::StackTrace_StackTraceOptions = 16;
        pub const StackTrace_StackTraceOptions_kIsConstructor:
            root::v8::StackTrace_StackTraceOptions = 32;
        pub const StackTrace_StackTraceOptions_kScriptNameOrSourceURL:
            root::v8::StackTrace_StackTraceOptions = 64;
        pub const StackTrace_StackTraceOptions_kScriptId: root::v8::StackTrace_StackTraceOptions =
            128;
        pub const StackTrace_StackTraceOptions_kExposeFramesAcrossSecurityOrigins:
            root::v8::StackTrace_StackTraceOptions = 256;
        pub const StackTrace_StackTraceOptions_kOverview: root::v8::StackTrace_StackTraceOptions =
            15;
        pub const StackTrace_StackTraceOptions_kDetailed: root::v8::StackTrace_StackTraceOptions =
            127;
        /// Flags that determine what information is placed captured for each
        /// StackFrame when grabbing the current stack trace.
        /// Note: these options are deprecated and we always collect all available
        /// information (kDetailed).
        pub type StackTrace_StackTraceOptions = i32;
        #[test]
        fn bindgen_test_layout_StackTrace() {
            assert_eq!(
                ::std::mem::size_of::<StackTrace>(),
                1usize,
                concat!("Size of: ", stringify!(StackTrace))
            );
            assert_eq!(
                ::std::mem::align_of::<StackTrace>(),
                1usize,
                concat!("Alignment of ", stringify!(StackTrace))
            );
        }
        extern "C" {
            /// Returns a StackFrame at a particular index.
            #[link_name = "\u{1}?GetFrame@StackTrace@v8@@QEBA?AV?$Local@VStackFrame@v8@@@2@PEAVIsolate@2@I@Z"]
            pub fn StackTrace_GetFrame(
                this: *const root::v8::StackTrace,
                isolate: *mut root::v8::Isolate,
                index: u32,
            ) -> root::v8::Local<root::v8::StackFrame>;
        }
        extern "C" {
            /// Returns the number of StackFrames.
            #[link_name = "\u{1}?GetFrameCount@StackTrace@v8@@QEBAHXZ"]
            pub fn StackTrace_GetFrameCount(
                this: *const root::v8::StackTrace,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Grab a snapshot of the current JavaScript execution stack.
            ///
            /// \param frame_limit The maximum number of stack frames we want to capture.
            /// \param options Enumerates the set of things we will capture for each
            /// StackFrame.
            #[link_name = "\u{1}?CurrentStackTrace@StackTrace@v8@@SA?AV?$Local@VStackTrace@v8@@@2@PEAVIsolate@2@HW4StackTraceOptions@12@@Z"]
            pub fn StackTrace_CurrentStackTrace(
                isolate: *mut root::v8::Isolate,
                frame_limit: ::std::os::raw::c_int,
                options: root::v8::StackTrace_StackTraceOptions,
            ) -> root::v8::Local<root::v8::StackTrace>;
        }
        impl StackTrace {
            #[inline]
            pub unsafe fn GetFrame(
                &self,
                isolate: *mut root::v8::Isolate,
                index: u32,
            ) -> root::v8::Local<root::v8::StackFrame> {
                StackTrace_GetFrame(self, isolate, index)
            }
            #[inline]
            pub unsafe fn GetFrameCount(&self) -> ::std::os::raw::c_int {
                StackTrace_GetFrameCount(self)
            }
            #[inline]
            pub unsafe fn CurrentStackTrace(
                isolate: *mut root::v8::Isolate,
                frame_limit: ::std::os::raw::c_int,
                options: root::v8::StackTrace_StackTraceOptions,
            ) -> root::v8::Local<root::v8::StackTrace> {
                StackTrace_CurrentStackTrace(isolate, frame_limit, options)
            }
        }
        /// A single JavaScript stack frame.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct StackFrame {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_StackFrame() {
            assert_eq!(
                ::std::mem::size_of::<StackFrame>(),
                1usize,
                concat!("Size of: ", stringify!(StackFrame))
            );
            assert_eq!(
                ::std::mem::align_of::<StackFrame>(),
                1usize,
                concat!("Alignment of ", stringify!(StackFrame))
            );
        }
        extern "C" {
            /// Returns the number, 1-based, of the line for the associate function call.
            /// This method will return Message::kNoLineNumberInfo if it is unable to
            /// retrieve the line number, or if kLineNumber was not passed as an option
            /// when capturing the StackTrace.
            #[link_name = "\u{1}?GetLineNumber@StackFrame@v8@@QEBAHXZ"]
            pub fn StackFrame_GetLineNumber(
                this: *const root::v8::StackFrame,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the 1-based column offset on the line for the associated function
            /// call.
            /// This method will return Message::kNoColumnInfo if it is unable to retrieve
            /// the column number, or if kColumnOffset was not passed as an option when
            /// capturing the StackTrace.
            #[link_name = "\u{1}?GetColumn@StackFrame@v8@@QEBAHXZ"]
            pub fn StackFrame_GetColumn(this: *const root::v8::StackFrame)
                -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the id of the script for the function for this StackFrame.
            /// This method will return Message::kNoScriptIdInfo if it is unable to
            /// retrieve the script id, or if kScriptId was not passed as an option when
            /// capturing the StackTrace.
            #[link_name = "\u{1}?GetScriptId@StackFrame@v8@@QEBAHXZ"]
            pub fn StackFrame_GetScriptId(
                this: *const root::v8::StackFrame,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the name of the resource that contains the script for the
            /// function for this StackFrame.
            #[link_name = "\u{1}?GetScriptName@StackFrame@v8@@QEBA?AV?$Local@VString@v8@@@2@XZ"]
            pub fn StackFrame_GetScriptName(
                this: *const root::v8::StackFrame,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Returns the name of the resource that contains the script for the
            /// function for this StackFrame or sourceURL value if the script name
            /// is undefined and its source ends with //# sourceURL=... string or
            /// deprecated //@ sourceURL=... string.
            #[link_name = "\u{1}?GetScriptNameOrSourceURL@StackFrame@v8@@QEBA?AV?$Local@VString@v8@@@2@XZ"]
            pub fn StackFrame_GetScriptNameOrSourceURL(
                this: *const root::v8::StackFrame,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Returns the name of the function associated with this stack frame.
            #[link_name = "\u{1}?GetFunctionName@StackFrame@v8@@QEBA?AV?$Local@VString@v8@@@2@XZ"]
            pub fn StackFrame_GetFunctionName(
                this: *const root::v8::StackFrame,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Returns whether or not the associated function is compiled via a call to
            /// eval().
            #[link_name = "\u{1}?IsEval@StackFrame@v8@@QEBA_NXZ"]
            pub fn StackFrame_IsEval(this: *const root::v8::StackFrame) -> bool;
        }
        extern "C" {
            /// Returns whether or not the associated function is called as a
            /// constructor via "new".
            #[link_name = "\u{1}?IsConstructor@StackFrame@v8@@QEBA_NXZ"]
            pub fn StackFrame_IsConstructor(this: *const root::v8::StackFrame) -> bool;
        }
        extern "C" {
            /// Returns whether or not the associated functions is defined in wasm.
            #[link_name = "\u{1}?IsWasm@StackFrame@v8@@QEBA_NXZ"]
            pub fn StackFrame_IsWasm(this: *const root::v8::StackFrame) -> bool;
        }
        impl StackFrame {
            #[inline]
            pub unsafe fn GetLineNumber(&self) -> ::std::os::raw::c_int {
                StackFrame_GetLineNumber(self)
            }
            #[inline]
            pub unsafe fn GetColumn(&self) -> ::std::os::raw::c_int {
                StackFrame_GetColumn(self)
            }
            #[inline]
            pub unsafe fn GetScriptId(&self) -> ::std::os::raw::c_int {
                StackFrame_GetScriptId(self)
            }
            #[inline]
            pub unsafe fn GetScriptName(&self) -> root::v8::Local<root::v8::String> {
                StackFrame_GetScriptName(self)
            }
            #[inline]
            pub unsafe fn GetScriptNameOrSourceURL(&self) -> root::v8::Local<root::v8::String> {
                StackFrame_GetScriptNameOrSourceURL(self)
            }
            #[inline]
            pub unsafe fn GetFunctionName(&self) -> root::v8::Local<root::v8::String> {
                StackFrame_GetFunctionName(self)
            }
            #[inline]
            pub unsafe fn IsEval(&self) -> bool {
                StackFrame_IsEval(self)
            }
            #[inline]
            pub unsafe fn IsConstructor(&self) -> bool {
                StackFrame_IsConstructor(self)
            }
            #[inline]
            pub unsafe fn IsWasm(&self) -> bool {
                StackFrame_IsWasm(self)
            }
        }
        pub const StateTag_JS: root::v8::StateTag = 0;
        pub const StateTag_GC: root::v8::StateTag = 1;
        pub const StateTag_PARSER: root::v8::StateTag = 2;
        pub const StateTag_BYTECODE_COMPILER: root::v8::StateTag = 3;
        pub const StateTag_COMPILER: root::v8::StateTag = 4;
        pub const StateTag_OTHER: root::v8::StateTag = 5;
        pub const StateTag_EXTERNAL: root::v8::StateTag = 6;
        pub const StateTag_IDLE: root::v8::StateTag = 7;
        pub type StateTag = i32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct RegisterState {
            pub pc: *mut ::std::os::raw::c_void,
            pub sp: *mut ::std::os::raw::c_void,
            pub fp: *mut ::std::os::raw::c_void,
        }
        #[test]
        fn bindgen_test_layout_RegisterState() {
            assert_eq!(
                ::std::mem::size_of::<RegisterState>(),
                24usize,
                concat!("Size of: ", stringify!(RegisterState))
            );
            assert_eq!(
                ::std::mem::align_of::<RegisterState>(),
                8usize,
                concat!("Alignment of ", stringify!(RegisterState))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<RegisterState>())).pc as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(RegisterState),
                    "::",
                    stringify!(pc)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<RegisterState>())).sp as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(RegisterState),
                    "::",
                    stringify!(sp)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<RegisterState>())).fp as *const _ as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(RegisterState),
                    "::",
                    stringify!(fp)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct SampleInfo {
            pub frames_count: usize,
            pub vm_state: root::v8::StateTag,
            pub external_callback_entry: *mut ::std::os::raw::c_void,
        }
        #[test]
        fn bindgen_test_layout_SampleInfo() {
            assert_eq!(
                ::std::mem::size_of::<SampleInfo>(),
                24usize,
                concat!("Size of: ", stringify!(SampleInfo))
            );
            assert_eq!(
                ::std::mem::align_of::<SampleInfo>(),
                8usize,
                concat!("Alignment of ", stringify!(SampleInfo))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<SampleInfo>())).frames_count as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SampleInfo),
                    "::",
                    stringify!(frames_count)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<SampleInfo>())).vm_state as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SampleInfo),
                    "::",
                    stringify!(vm_state)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<SampleInfo>())).external_callback_entry as *const _
                        as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SampleInfo),
                    "::",
                    stringify!(external_callback_entry)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct MemoryRange {
            pub start: *const ::std::os::raw::c_void,
            pub length_in_bytes: usize,
        }
        #[test]
        fn bindgen_test_layout_MemoryRange() {
            assert_eq!(
                ::std::mem::size_of::<MemoryRange>(),
                16usize,
                concat!("Size of: ", stringify!(MemoryRange))
            );
            assert_eq!(
                ::std::mem::align_of::<MemoryRange>(),
                8usize,
                concat!("Alignment of ", stringify!(MemoryRange))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<MemoryRange>())).start as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(MemoryRange),
                    "::",
                    stringify!(start)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<MemoryRange>())).length_in_bytes as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(MemoryRange),
                    "::",
                    stringify!(length_in_bytes)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Parse@JSON@v8@@SA?AV?$MaybeLocal@VValue@v8@@@2@PEAVIsolate@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn JSON_Parse(
                isolate: *mut root::v8::Isolate,
                json_string: root::v8::Local<root::v8::String>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            #[link_name = "\u{1}?Parse@JSON@v8@@SA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn JSON_Parse1(
                context: root::v8::Local<root::v8::Context>,
                json_string: root::v8::Local<root::v8::String>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Tries to stringify the JSON-serializable object |json_object| and returns
            /// it as string if successful.
            ///
            /// \param json_object The JSON-serializable object to stringify.
            /// \return The corresponding string if successfully stringified.
            #[link_name = "\u{1}?Stringify@JSON@v8@@SA?AV?$MaybeLocal@VString@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn JSON_Stringify(
                context: root::v8::Local<root::v8::Context>,
                json_object: root::v8::Local<root::v8::Value>,
                gap: root::v8::Local<root::v8::String>,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        /// Value serialization compatible with the HTML structured clone algorithm.
        /// The format is backward-compatible (i.e. safe to store to disk).
        ///
        /// WARNING: This API is under development, and changes (including incompatible
        /// changes to the API or wire format) may occur without notice until this
        /// warning is removed.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ValueSerializer {
            pub private_: *mut root::v8::ValueSerializer_PrivateData,
        }
        #[repr(C)]
        pub struct ValueSerializer_Delegate__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ValueSerializer_Delegate {
            pub vtable_: *const ValueSerializer_Delegate__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_ValueSerializer_Delegate() {
            assert_eq!(
                ::std::mem::size_of::<ValueSerializer_Delegate>(),
                8usize,
                concat!("Size of: ", stringify!(ValueSerializer_Delegate))
            );
            assert_eq!(
                ::std::mem::align_of::<ValueSerializer_Delegate>(),
                8usize,
                concat!("Alignment of ", stringify!(ValueSerializer_Delegate))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ValueSerializer_PrivateData {
            _unused: [u8; 0],
        }
        #[test]
        fn bindgen_test_layout_ValueSerializer() {
            assert_eq!(
                ::std::mem::size_of::<ValueSerializer>(),
                8usize,
                concat!("Size of: ", stringify!(ValueSerializer))
            );
            assert_eq!(
                ::std::mem::align_of::<ValueSerializer>(),
                8usize,
                concat!("Alignment of ", stringify!(ValueSerializer))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ValueSerializer>())).private_ as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ValueSerializer),
                    "::",
                    stringify!(private_)
                )
            );
        }
        extern "C" {
            /// Writes out a header, which includes the format version.
            #[link_name = "\u{1}?WriteHeader@ValueSerializer@v8@@QEAAXXZ"]
            pub fn ValueSerializer_WriteHeader(this: *mut root::v8::ValueSerializer);
        }
        extern "C" {
            /// Serializes a JavaScript value into the buffer.
            #[link_name = "\u{1}?WriteValue@ValueSerializer@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn ValueSerializer_WriteValue(
                this: *mut root::v8::ValueSerializer,
                context: root::v8::Local<root::v8::Context>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?ReleaseBuffer@ValueSerializer@v8@@QEAA?AV?$vector@EV?$allocator@E@std@@@std@@XZ"]
            pub fn ValueSerializer_ReleaseBuffer(this: *mut root::v8::ValueSerializer) -> u8;
        }
        extern "C" {
            /// Returns the stored data (allocated using the delegate's
            /// ReallocateBufferMemory) and its size. This serializer should not be used
            /// once the buffer is released. The contents are undefined if a previous write
            /// has failed. Ownership of the buffer is transferred to the caller.
            #[link_name = "\u{1}?Release@ValueSerializer@v8@@QEAA?AU?$pair@PEAE_K@std@@XZ"]
            pub fn ValueSerializer_Release(this: *mut root::v8::ValueSerializer) -> u8;
        }
        extern "C" {
            /// Marks an ArrayBuffer as havings its contents transferred out of band.
            /// Pass the corresponding ArrayBuffer in the deserializing context to
            /// ValueDeserializer::TransferArrayBuffer.
            #[link_name = "\u{1}?TransferArrayBuffer@ValueSerializer@v8@@QEAAXIV?$Local@VArrayBuffer@v8@@@2@@Z"]
            pub fn ValueSerializer_TransferArrayBuffer(
                this: *mut root::v8::ValueSerializer,
                transfer_id: u32,
                array_buffer: root::v8::Local<root::v8::ArrayBuffer>,
            );
        }
        extern "C" {
            #[link_name = "\u{1}?TransferSharedArrayBuffer@ValueSerializer@v8@@QEAAXIV?$Local@VSharedArrayBuffer@v8@@@2@@Z"]
            pub fn ValueSerializer_TransferSharedArrayBuffer(
                this: *mut root::v8::ValueSerializer,
                transfer_id: u32,
                shared_array_buffer: root::v8::Local<root::v8::SharedArrayBuffer>,
            );
        }
        extern "C" {
            /// Indicate whether to treat ArrayBufferView objects as host objects,
            /// i.e. pass them to Delegate::WriteHostObject. This should not be
            /// called when no Delegate was passed.
            ///
            /// The default is not to treat ArrayBufferViews as host objects.
            #[link_name = "\u{1}?SetTreatArrayBufferViewsAsHostObjects@ValueSerializer@v8@@QEAAX_N@Z"]
            pub fn ValueSerializer_SetTreatArrayBufferViewsAsHostObjects(
                this: *mut root::v8::ValueSerializer,
                mode: bool,
            );
        }
        extern "C" {
            /// Write raw data in various common formats to the buffer.
            /// Note that integer types are written in base-128 varint format, not with a
            /// binary copy. For use during an override of Delegate::WriteHostObject.
            #[link_name = "\u{1}?WriteUint32@ValueSerializer@v8@@QEAAXI@Z"]
            pub fn ValueSerializer_WriteUint32(this: *mut root::v8::ValueSerializer, value: u32);
        }
        extern "C" {
            #[link_name = "\u{1}?WriteUint64@ValueSerializer@v8@@QEAAX_K@Z"]
            pub fn ValueSerializer_WriteUint64(this: *mut root::v8::ValueSerializer, value: u64);
        }
        extern "C" {
            #[link_name = "\u{1}?WriteDouble@ValueSerializer@v8@@QEAAXN@Z"]
            pub fn ValueSerializer_WriteDouble(this: *mut root::v8::ValueSerializer, value: f64);
        }
        extern "C" {
            #[link_name = "\u{1}?WriteRawBytes@ValueSerializer@v8@@QEAAXPEBX_K@Z"]
            pub fn ValueSerializer_WriteRawBytes(
                this: *mut root::v8::ValueSerializer,
                source: *const ::std::os::raw::c_void,
                length: usize,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0ValueSerializer@v8@@QEAA@PEAVIsolate@1@@Z"]
            pub fn ValueSerializer_ValueSerializer(
                this: *mut root::v8::ValueSerializer,
                isolate: *mut root::v8::Isolate,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0ValueSerializer@v8@@QEAA@PEAVIsolate@1@PEAVDelegate@01@@Z"]
            pub fn ValueSerializer_ValueSerializer1(
                this: *mut root::v8::ValueSerializer,
                isolate: *mut root::v8::Isolate,
                delegate: *mut root::v8::ValueSerializer_Delegate,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DValueSerializer@v8@@QEAAXXZ"]
            pub fn ValueSerializer_ValueSerializer_destructor(this: *mut root::v8::ValueSerializer);
        }
        impl ValueSerializer {
            #[inline]
            pub unsafe fn WriteHeader(&mut self) {
                ValueSerializer_WriteHeader(self)
            }
            #[inline]
            pub unsafe fn WriteValue(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                ValueSerializer_WriteValue(self, context, value)
            }
            #[inline]
            pub unsafe fn ReleaseBuffer(&mut self) -> u8 {
                ValueSerializer_ReleaseBuffer(self)
            }
            #[inline]
            pub unsafe fn Release(&mut self) -> u8 {
                ValueSerializer_Release(self)
            }
            #[inline]
            pub unsafe fn TransferArrayBuffer(
                &mut self,
                transfer_id: u32,
                array_buffer: root::v8::Local<root::v8::ArrayBuffer>,
            ) {
                ValueSerializer_TransferArrayBuffer(self, transfer_id, array_buffer)
            }
            #[inline]
            pub unsafe fn TransferSharedArrayBuffer(
                &mut self,
                transfer_id: u32,
                shared_array_buffer: root::v8::Local<root::v8::SharedArrayBuffer>,
            ) {
                ValueSerializer_TransferSharedArrayBuffer(self, transfer_id, shared_array_buffer)
            }
            #[inline]
            pub unsafe fn SetTreatArrayBufferViewsAsHostObjects(&mut self, mode: bool) {
                ValueSerializer_SetTreatArrayBufferViewsAsHostObjects(self, mode)
            }
            #[inline]
            pub unsafe fn WriteUint32(&mut self, value: u32) {
                ValueSerializer_WriteUint32(self, value)
            }
            #[inline]
            pub unsafe fn WriteUint64(&mut self, value: u64) {
                ValueSerializer_WriteUint64(self, value)
            }
            #[inline]
            pub unsafe fn WriteDouble(&mut self, value: f64) {
                ValueSerializer_WriteDouble(self, value)
            }
            #[inline]
            pub unsafe fn WriteRawBytes(
                &mut self,
                source: *const ::std::os::raw::c_void,
                length: usize,
            ) {
                ValueSerializer_WriteRawBytes(self, source, length)
            }
            #[inline]
            pub unsafe fn new(isolate: *mut root::v8::Isolate) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ValueSerializer_ValueSerializer(&mut __bindgen_tmp, isolate);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(
                isolate: *mut root::v8::Isolate,
                delegate: *mut root::v8::ValueSerializer_Delegate,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ValueSerializer_ValueSerializer1(&mut __bindgen_tmp, isolate, delegate);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                ValueSerializer_ValueSerializer_destructor(self)
            }
        }
        extern "C" {
            /// The embedder overrides this method to write some kind of host object, if
            /// possible. If not, a suitable exception should be thrown and
            /// Nothing<bool>() returned.
            #[link_name = "\u{1}?WriteHostObject@Delegate@ValueSerializer@v8@@UEAA?AV?$Maybe@_N@3@PEAVIsolate@3@V?$Local@VObject@v8@@@3@@Z"]
            pub fn ValueSerializer_Delegate_WriteHostObject(
                this: *mut ::std::os::raw::c_void,
                isolate: *mut root::v8::Isolate,
                object: root::v8::Local<root::v8::Object>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Called when the ValueSerializer is going to serialize a
            /// SharedArrayBuffer object. The embedder must return an ID for the
            /// object, using the same ID if this SharedArrayBuffer has already been
            /// serialized in this buffer. When deserializing, this ID will be passed to
            /// ValueDeserializer::GetSharedArrayBufferFromId as |clone_id|.
            ///
            /// If the object cannot be serialized, an
            /// exception should be thrown and Nothing<uint32_t>() returned.
            #[link_name = "\u{1}?GetSharedArrayBufferId@Delegate@ValueSerializer@v8@@UEAA?AV?$Maybe@I@3@PEAVIsolate@3@V?$Local@VSharedArrayBuffer@v8@@@3@@Z"]
            pub fn ValueSerializer_Delegate_GetSharedArrayBufferId(
                this: *mut ::std::os::raw::c_void,
                isolate: *mut root::v8::Isolate,
                shared_array_buffer: root::v8::Local<root::v8::SharedArrayBuffer>,
            ) -> root::v8::Maybe<u32>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetWasmModuleTransferId@Delegate@ValueSerializer@v8@@UEAA?AV?$Maybe@I@3@PEAVIsolate@3@V?$Local@VWasmCompiledModule@v8@@@3@@Z"]
            pub fn ValueSerializer_Delegate_GetWasmModuleTransferId(
                this: *mut ::std::os::raw::c_void,
                isolate: *mut root::v8::Isolate,
                module: root::v8::Local<root::v8::WasmCompiledModule>,
            ) -> root::v8::Maybe<u32>;
        }
        extern "C" {
            /// Allocates memory for the buffer of at least the size provided. The actual
            /// size (which may be greater or equal) is written to |actual_size|. If no
            /// buffer has been allocated yet, nullptr will be provided.
            ///
            /// If the memory cannot be allocated, nullptr should be returned.
            /// |actual_size| will be ignored. It is assumed that |old_buffer| is still
            /// valid in this case and has not been modified.
            ///
            /// The default implementation uses the stdlib's `realloc()` function.
            #[link_name = "\u{1}?ReallocateBufferMemory@Delegate@ValueSerializer@v8@@UEAAPEAXPEAX_KPEA_K@Z"]
            pub fn ValueSerializer_Delegate_ReallocateBufferMemory(
                this: *mut ::std::os::raw::c_void,
                old_buffer: *mut ::std::os::raw::c_void,
                size: usize,
                actual_size: *mut usize,
            ) -> *mut ::std::os::raw::c_void;
        }
        extern "C" {
            /// Frees a buffer allocated with |ReallocateBufferMemory|.
            ///
            /// The default implementation uses the stdlib's `free()` function.
            #[link_name = "\u{1}?FreeBufferMemory@Delegate@ValueSerializer@v8@@UEAAXPEAX@Z"]
            pub fn ValueSerializer_Delegate_FreeBufferMemory(
                this: *mut ::std::os::raw::c_void,
                buffer: *mut ::std::os::raw::c_void,
            );
        }
        /// Deserializes values from data written with ValueSerializer, or a compatible
        /// implementation.
        ///
        /// WARNING: This API is under development, and changes (including incompatible
        /// changes to the API or wire format) may occur without notice until this
        /// warning is removed.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ValueDeserializer {
            pub private_: *mut root::v8::ValueDeserializer_PrivateData,
        }
        #[repr(C)]
        pub struct ValueDeserializer_Delegate__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct ValueDeserializer_Delegate {
            pub vtable_: *const ValueDeserializer_Delegate__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_ValueDeserializer_Delegate() {
            assert_eq!(
                ::std::mem::size_of::<ValueDeserializer_Delegate>(),
                8usize,
                concat!("Size of: ", stringify!(ValueDeserializer_Delegate))
            );
            assert_eq!(
                ::std::mem::align_of::<ValueDeserializer_Delegate>(),
                8usize,
                concat!("Alignment of ", stringify!(ValueDeserializer_Delegate))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ValueDeserializer_PrivateData {
            _unused: [u8; 0],
        }
        #[test]
        fn bindgen_test_layout_ValueDeserializer() {
            assert_eq!(
                ::std::mem::size_of::<ValueDeserializer>(),
                8usize,
                concat!("Size of: ", stringify!(ValueDeserializer))
            );
            assert_eq!(
                ::std::mem::align_of::<ValueDeserializer>(),
                8usize,
                concat!("Alignment of ", stringify!(ValueDeserializer))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ValueDeserializer>())).private_ as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ValueDeserializer),
                    "::",
                    stringify!(private_)
                )
            );
        }
        extern "C" {
            /// Reads and validates a header (including the format version).
            /// May, for example, reject an invalid or unsupported wire format.
            #[link_name = "\u{1}?ReadHeader@ValueDeserializer@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn ValueDeserializer_ReadHeader(
                this: *mut root::v8::ValueDeserializer,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Deserializes a JavaScript value from the buffer.
            #[link_name = "\u{1}?ReadValue@ValueDeserializer@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn ValueDeserializer_ReadValue(
                this: *mut root::v8::ValueDeserializer,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Accepts the array buffer corresponding to the one passed previously to
            /// ValueSerializer::TransferArrayBuffer.
            #[link_name = "\u{1}?TransferArrayBuffer@ValueDeserializer@v8@@QEAAXIV?$Local@VArrayBuffer@v8@@@2@@Z"]
            pub fn ValueDeserializer_TransferArrayBuffer(
                this: *mut root::v8::ValueDeserializer,
                transfer_id: u32,
                array_buffer: root::v8::Local<root::v8::ArrayBuffer>,
            );
        }
        extern "C" {
            /// Similar to TransferArrayBuffer, but for SharedArrayBuffer.
            /// The id is not necessarily in the same namespace as unshared ArrayBuffer
            /// objects.
            #[link_name = "\u{1}?TransferSharedArrayBuffer@ValueDeserializer@v8@@QEAAXIV?$Local@VSharedArrayBuffer@v8@@@2@@Z"]
            pub fn ValueDeserializer_TransferSharedArrayBuffer(
                this: *mut root::v8::ValueDeserializer,
                id: u32,
                shared_array_buffer: root::v8::Local<root::v8::SharedArrayBuffer>,
            );
        }
        extern "C" {
            /// Must be called before ReadHeader to enable support for reading the legacy
            /// wire format (i.e., which predates this being shipped).
            ///
            /// Don't use this unless you need to read data written by previous versions of
            /// blink::ScriptValueSerializer.
            #[link_name = "\u{1}?SetSupportsLegacyWireFormat@ValueDeserializer@v8@@QEAAX_N@Z"]
            pub fn ValueDeserializer_SetSupportsLegacyWireFormat(
                this: *mut root::v8::ValueDeserializer,
                supports_legacy_wire_format: bool,
            );
        }
        extern "C" {
            /// Expect inline wasm in the data stream (rather than in-memory transfer)
            #[link_name = "\u{1}?SetExpectInlineWasm@ValueDeserializer@v8@@QEAAX_N@Z"]
            pub fn ValueDeserializer_SetExpectInlineWasm(
                this: *mut root::v8::ValueDeserializer,
                allow_inline_wasm: bool,
            );
        }
        extern "C" {
            /// Reads the underlying wire format version. Likely mostly to be useful to
            /// legacy code reading old wire format versions. Must be called after
            /// ReadHeader.
            #[link_name = "\u{1}?GetWireFormatVersion@ValueDeserializer@v8@@QEBAIXZ"]
            pub fn ValueDeserializer_GetWireFormatVersion(
                this: *const root::v8::ValueDeserializer,
            ) -> u32;
        }
        extern "C" {
            /// Reads raw data in various common formats to the buffer.
            /// Note that integer types are read in base-128 varint format, not with a
            /// binary copy. For use during an override of Delegate::ReadHostObject.
            #[link_name = "\u{1}?ReadUint32@ValueDeserializer@v8@@QEAA_NPEAI@Z"]
            pub fn ValueDeserializer_ReadUint32(
                this: *mut root::v8::ValueDeserializer,
                value: *mut u32,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?ReadUint64@ValueDeserializer@v8@@QEAA_NPEA_K@Z"]
            pub fn ValueDeserializer_ReadUint64(
                this: *mut root::v8::ValueDeserializer,
                value: *mut u64,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?ReadDouble@ValueDeserializer@v8@@QEAA_NPEAN@Z"]
            pub fn ValueDeserializer_ReadDouble(
                this: *mut root::v8::ValueDeserializer,
                value: *mut f64,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?ReadRawBytes@ValueDeserializer@v8@@QEAA_N_KPEAPEBX@Z"]
            pub fn ValueDeserializer_ReadRawBytes(
                this: *mut root::v8::ValueDeserializer,
                length: usize,
                data: *mut *const ::std::os::raw::c_void,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}??0ValueDeserializer@v8@@QEAA@PEAVIsolate@1@PEBE_K@Z"]
            pub fn ValueDeserializer_ValueDeserializer(
                this: *mut root::v8::ValueDeserializer,
                isolate: *mut root::v8::Isolate,
                data: *const u8,
                size: usize,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0ValueDeserializer@v8@@QEAA@PEAVIsolate@1@PEBE_KPEAVDelegate@01@@Z"]
            pub fn ValueDeserializer_ValueDeserializer1(
                this: *mut root::v8::ValueDeserializer,
                isolate: *mut root::v8::Isolate,
                data: *const u8,
                size: usize,
                delegate: *mut root::v8::ValueDeserializer_Delegate,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DValueDeserializer@v8@@QEAAXXZ"]
            pub fn ValueDeserializer_ValueDeserializer_destructor(
                this: *mut root::v8::ValueDeserializer,
            );
        }
        impl ValueDeserializer {
            #[inline]
            pub unsafe fn ReadHeader(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<bool> {
                ValueDeserializer_ReadHeader(self, context)
            }
            #[inline]
            pub unsafe fn ReadValue(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                ValueDeserializer_ReadValue(self, context)
            }
            #[inline]
            pub unsafe fn TransferArrayBuffer(
                &mut self,
                transfer_id: u32,
                array_buffer: root::v8::Local<root::v8::ArrayBuffer>,
            ) {
                ValueDeserializer_TransferArrayBuffer(self, transfer_id, array_buffer)
            }
            #[inline]
            pub unsafe fn TransferSharedArrayBuffer(
                &mut self,
                id: u32,
                shared_array_buffer: root::v8::Local<root::v8::SharedArrayBuffer>,
            ) {
                ValueDeserializer_TransferSharedArrayBuffer(self, id, shared_array_buffer)
            }
            #[inline]
            pub unsafe fn SetSupportsLegacyWireFormat(
                &mut self,
                supports_legacy_wire_format: bool,
            ) {
                ValueDeserializer_SetSupportsLegacyWireFormat(self, supports_legacy_wire_format)
            }
            #[inline]
            pub unsafe fn SetExpectInlineWasm(&mut self, allow_inline_wasm: bool) {
                ValueDeserializer_SetExpectInlineWasm(self, allow_inline_wasm)
            }
            #[inline]
            pub unsafe fn GetWireFormatVersion(&self) -> u32 {
                ValueDeserializer_GetWireFormatVersion(self)
            }
            #[inline]
            pub unsafe fn ReadUint32(&mut self, value: *mut u32) -> bool {
                ValueDeserializer_ReadUint32(self, value)
            }
            #[inline]
            pub unsafe fn ReadUint64(&mut self, value: *mut u64) -> bool {
                ValueDeserializer_ReadUint64(self, value)
            }
            #[inline]
            pub unsafe fn ReadDouble(&mut self, value: *mut f64) -> bool {
                ValueDeserializer_ReadDouble(self, value)
            }
            #[inline]
            pub unsafe fn ReadRawBytes(
                &mut self,
                length: usize,
                data: *mut *const ::std::os::raw::c_void,
            ) -> bool {
                ValueDeserializer_ReadRawBytes(self, length, data)
            }
            #[inline]
            pub unsafe fn new(
                isolate: *mut root::v8::Isolate,
                data: *const u8,
                size: usize,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ValueDeserializer_ValueDeserializer(&mut __bindgen_tmp, isolate, data, size);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(
                isolate: *mut root::v8::Isolate,
                data: *const u8,
                size: usize,
                delegate: *mut root::v8::ValueDeserializer_Delegate,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ValueDeserializer_ValueDeserializer1(
                    &mut __bindgen_tmp,
                    isolate,
                    data,
                    size,
                    delegate,
                );
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                ValueDeserializer_ValueDeserializer_destructor(self)
            }
        }
        extern "C" {
            /// The embedder overrides this method to read some kind of host object, if
            /// possible. If not, a suitable exception should be thrown and
            /// MaybeLocal<Object>() returned.
            #[link_name = "\u{1}?ReadHostObject@Delegate@ValueDeserializer@v8@@UEAA?AV?$MaybeLocal@VObject@v8@@@3@PEAVIsolate@3@@Z"]
            pub fn ValueDeserializer_Delegate_ReadHostObject(
                this: *mut ::std::os::raw::c_void,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::MaybeLocal<root::v8::Object>;
        }
        extern "C" {
            /// Get a WasmCompiledModule given a transfer_id previously provided
            /// by ValueSerializer::GetWasmModuleTransferId
            #[link_name = "\u{1}?GetWasmModuleFromId@Delegate@ValueDeserializer@v8@@UEAA?AV?$MaybeLocal@VWasmCompiledModule@v8@@@3@PEAVIsolate@3@I@Z"]
            pub fn ValueDeserializer_Delegate_GetWasmModuleFromId(
                this: *mut ::std::os::raw::c_void,
                isolate: *mut root::v8::Isolate,
                transfer_id: u32,
            ) -> root::v8::MaybeLocal<root::v8::WasmCompiledModule>;
        }
        extern "C" {
            /// Get a SharedArrayBuffer given a clone_id previously provided
            /// by ValueSerializer::GetSharedArrayBufferId
            #[link_name = "\u{1}?GetSharedArrayBufferFromId@Delegate@ValueDeserializer@v8@@UEAA?AV?$MaybeLocal@VSharedArrayBuffer@v8@@@3@PEAVIsolate@3@I@Z"]
            pub fn ValueDeserializer_Delegate_GetSharedArrayBufferFromId(
                this: *mut ::std::os::raw::c_void,
                isolate: *mut root::v8::Isolate,
                clone_id: u32,
            ) -> root::v8::MaybeLocal<root::v8::SharedArrayBuffer>;
        }
        /// The superclass of all JavaScript values and objects.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Value {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Value() {
            assert_eq!(
                ::std::mem::size_of::<Value>(),
                1usize,
                concat!("Size of: ", stringify!(Value))
            );
            assert_eq!(
                ::std::mem::align_of::<Value>(),
                1usize,
                concat!("Alignment of ", stringify!(Value))
            );
        }
        extern "C" {
            /// Returns true if this value is true.
            #[link_name = "\u{1}?IsTrue@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsTrue(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is false.
            #[link_name = "\u{1}?IsFalse@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsFalse(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a symbol or a string.
            #[link_name = "\u{1}?IsName@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsName(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a symbol.
            #[link_name = "\u{1}?IsSymbol@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsSymbol(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a function.
            #[link_name = "\u{1}?IsFunction@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsFunction(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an array. Note that it will return false for
            /// an Proxy for an array.
            #[link_name = "\u{1}?IsArray@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsArray(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an object.
            #[link_name = "\u{1}?IsObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a bigint.
            #[link_name = "\u{1}?IsBigInt@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsBigInt(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is boolean.
            #[link_name = "\u{1}?IsBoolean@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsBoolean(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a number.
            #[link_name = "\u{1}?IsNumber@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsNumber(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is external.
            #[link_name = "\u{1}?IsExternal@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsExternal(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a 32-bit signed integer.
            #[link_name = "\u{1}?IsInt32@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsInt32(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a 32-bit unsigned integer.
            #[link_name = "\u{1}?IsUint32@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsUint32(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Date.
            #[link_name = "\u{1}?IsDate@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsDate(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Arguments object.
            #[link_name = "\u{1}?IsArgumentsObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsArgumentsObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a BigInt object.
            #[link_name = "\u{1}?IsBigIntObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsBigIntObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Boolean object.
            #[link_name = "\u{1}?IsBooleanObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsBooleanObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Number object.
            #[link_name = "\u{1}?IsNumberObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsNumberObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a String object.
            #[link_name = "\u{1}?IsStringObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsStringObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Symbol object.
            #[link_name = "\u{1}?IsSymbolObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsSymbolObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a NativeError.
            #[link_name = "\u{1}?IsNativeError@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsNativeError(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a RegExp.
            #[link_name = "\u{1}?IsRegExp@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsRegExp(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an async function.
            #[link_name = "\u{1}?IsAsyncFunction@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsAsyncFunction(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Generator function.
            #[link_name = "\u{1}?IsGeneratorFunction@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsGeneratorFunction(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Generator object (iterator).
            #[link_name = "\u{1}?IsGeneratorObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsGeneratorObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Promise.
            #[link_name = "\u{1}?IsPromise@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsPromise(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Map.
            #[link_name = "\u{1}?IsMap@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsMap(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Set.
            #[link_name = "\u{1}?IsSet@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsSet(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Map Iterator.
            #[link_name = "\u{1}?IsMapIterator@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsMapIterator(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Set Iterator.
            #[link_name = "\u{1}?IsSetIterator@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsSetIterator(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a WeakMap.
            #[link_name = "\u{1}?IsWeakMap@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsWeakMap(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a WeakSet.
            #[link_name = "\u{1}?IsWeakSet@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsWeakSet(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an ArrayBuffer.
            #[link_name = "\u{1}?IsArrayBuffer@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsArrayBuffer(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an ArrayBufferView.
            #[link_name = "\u{1}?IsArrayBufferView@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsArrayBufferView(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is one of TypedArrays.
            #[link_name = "\u{1}?IsTypedArray@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsTypedArray(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Uint8Array.
            #[link_name = "\u{1}?IsUint8Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsUint8Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Uint8ClampedArray.
            #[link_name = "\u{1}?IsUint8ClampedArray@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsUint8ClampedArray(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Int8Array.
            #[link_name = "\u{1}?IsInt8Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsInt8Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Uint16Array.
            #[link_name = "\u{1}?IsUint16Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsUint16Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Int16Array.
            #[link_name = "\u{1}?IsInt16Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsInt16Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Uint32Array.
            #[link_name = "\u{1}?IsUint32Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsUint32Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is an Int32Array.
            #[link_name = "\u{1}?IsInt32Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsInt32Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Float32Array.
            #[link_name = "\u{1}?IsFloat32Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsFloat32Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a Float64Array.
            #[link_name = "\u{1}?IsFloat64Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsFloat64Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a BigInt64Array.
            #[link_name = "\u{1}?IsBigInt64Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsBigInt64Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a BigUint64Array.
            #[link_name = "\u{1}?IsBigUint64Array@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsBigUint64Array(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a DataView.
            #[link_name = "\u{1}?IsDataView@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsDataView(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a SharedArrayBuffer.
            /// This is an experimental feature.
            #[link_name = "\u{1}?IsSharedArrayBuffer@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsSharedArrayBuffer(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if this value is a JavaScript Proxy.
            #[link_name = "\u{1}?IsProxy@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsProxy(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?IsWebAssemblyCompiledModule@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsWebAssemblyCompiledModule(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            /// Returns true if the value is a Module Namespace Object.
            #[link_name = "\u{1}?IsModuleNamespaceObject@Value@v8@@QEBA_NXZ"]
            pub fn Value_IsModuleNamespaceObject(this: *const root::v8::Value) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?ToBigInt@Value@v8@@QEBA?AV?$MaybeLocal@VBigInt@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToBigInt(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::BigInt>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToBoolean@Value@v8@@QEBA?AV?$MaybeLocal@VBoolean@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToBoolean(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Boolean>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToNumber@Value@v8@@QEBA?AV?$MaybeLocal@VNumber@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToNumber(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Number>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToString@Value@v8@@QEBA?AV?$MaybeLocal@VString@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToString(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToDetailString@Value@v8@@QEBA?AV?$MaybeLocal@VString@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToDetailString(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToObject@Value@v8@@QEBA?AV?$MaybeLocal@VObject@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToObject(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Object>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToInteger@Value@v8@@QEBA?AV?$MaybeLocal@VInteger@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToInteger(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Integer>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToUint32@Value@v8@@QEBA?AV?$MaybeLocal@VUint32@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToUint32(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Uint32>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToInt32@Value@v8@@QEBA?AV?$MaybeLocal@VInt32@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToInt32(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Int32>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToBoolean@Value@v8@@QEBA?AV?$Local@VBoolean@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Value_ToBoolean1(
                this: *const root::v8::Value,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Boolean>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToNumber@Value@v8@@QEBA?AV?$Local@VNumber@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Value_ToNumber1(
                this: *const root::v8::Value,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Number>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToString@Value@v8@@QEBA?AV?$Local@VString@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Value_ToString1(
                this: *const root::v8::Value,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToObject@Value@v8@@QEBA?AV?$Local@VObject@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Value_ToObject1(
                this: *const root::v8::Value,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Object>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToInteger@Value@v8@@QEBA?AV?$Local@VInteger@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Value_ToInteger1(
                this: *const root::v8::Value,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Integer>;
        }
        extern "C" {
            #[link_name = "\u{1}?ToInt32@Value@v8@@QEBA?AV?$Local@VInt32@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Value_ToInt321(
                this: *const root::v8::Value,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Int32>;
        }
        extern "C" {
            /// Attempts to convert a string to an array index.
            /// Returns an empty handle if the conversion fails.
            #[link_name = "\u{1}?ToArrayIndex@Value@v8@@QEBA?AV?$MaybeLocal@VUint32@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_ToArrayIndex(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Uint32>;
        }
        extern "C" {
            #[link_name = "\u{1}?BooleanValue@Value@v8@@QEBA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_BooleanValue(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?NumberValue@Value@v8@@QEBA?AV?$Maybe@N@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_NumberValue(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<f64>;
        }
        extern "C" {
            #[link_name = "\u{1}?IntegerValue@Value@v8@@QEBA?AV?$Maybe@_J@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_IntegerValue(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<i64>;
        }
        extern "C" {
            #[link_name = "\u{1}?Uint32Value@Value@v8@@QEBA?AV?$Maybe@I@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_Uint32Value(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<u32>;
        }
        extern "C" {
            #[link_name = "\u{1}?Int32Value@Value@v8@@QEBA?AV?$Maybe@H@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Value_Int32Value(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<i32>;
        }
        extern "C" {
            /// JS ==
            #[link_name = "\u{1}?Equals@Value@v8@@QEBA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Value_Equals(
                this: *const root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
                that: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?StrictEquals@Value@v8@@QEBA_NV?$Local@VValue@v8@@@2@@Z"]
            pub fn Value_StrictEquals(
                this: *const root::v8::Value,
                that: root::v8::Local<root::v8::Value>,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?SameValue@Value@v8@@QEBA_NV?$Local@VValue@v8@@@2@@Z"]
            pub fn Value_SameValue(
                this: *const root::v8::Value,
                that: root::v8::Local<root::v8::Value>,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?TypeOf@Value@v8@@QEAA?AV?$Local@VString@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Value_TypeOf(
                this: *mut root::v8::Value,
                arg1: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            #[link_name = "\u{1}?InstanceOf@Value@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VObject@v8@@@2@@Z"]
            pub fn Value_InstanceOf(
                this: *mut root::v8::Value,
                context: root::v8::Local<root::v8::Context>,
                object: root::v8::Local<root::v8::Object>,
            ) -> root::v8::Maybe<bool>;
        }
        impl Value {
            #[inline]
            pub unsafe fn IsTrue(&self) -> bool {
                Value_IsTrue(self)
            }
            #[inline]
            pub unsafe fn IsFalse(&self) -> bool {
                Value_IsFalse(self)
            }
            #[inline]
            pub unsafe fn IsName(&self) -> bool {
                Value_IsName(self)
            }
            #[inline]
            pub unsafe fn IsSymbol(&self) -> bool {
                Value_IsSymbol(self)
            }
            #[inline]
            pub unsafe fn IsFunction(&self) -> bool {
                Value_IsFunction(self)
            }
            #[inline]
            pub unsafe fn IsArray(&self) -> bool {
                Value_IsArray(self)
            }
            #[inline]
            pub unsafe fn IsObject(&self) -> bool {
                Value_IsObject(self)
            }
            #[inline]
            pub unsafe fn IsBigInt(&self) -> bool {
                Value_IsBigInt(self)
            }
            #[inline]
            pub unsafe fn IsBoolean(&self) -> bool {
                Value_IsBoolean(self)
            }
            #[inline]
            pub unsafe fn IsNumber(&self) -> bool {
                Value_IsNumber(self)
            }
            #[inline]
            pub unsafe fn IsExternal(&self) -> bool {
                Value_IsExternal(self)
            }
            #[inline]
            pub unsafe fn IsInt32(&self) -> bool {
                Value_IsInt32(self)
            }
            #[inline]
            pub unsafe fn IsUint32(&self) -> bool {
                Value_IsUint32(self)
            }
            #[inline]
            pub unsafe fn IsDate(&self) -> bool {
                Value_IsDate(self)
            }
            #[inline]
            pub unsafe fn IsArgumentsObject(&self) -> bool {
                Value_IsArgumentsObject(self)
            }
            #[inline]
            pub unsafe fn IsBigIntObject(&self) -> bool {
                Value_IsBigIntObject(self)
            }
            #[inline]
            pub unsafe fn IsBooleanObject(&self) -> bool {
                Value_IsBooleanObject(self)
            }
            #[inline]
            pub unsafe fn IsNumberObject(&self) -> bool {
                Value_IsNumberObject(self)
            }
            #[inline]
            pub unsafe fn IsStringObject(&self) -> bool {
                Value_IsStringObject(self)
            }
            #[inline]
            pub unsafe fn IsSymbolObject(&self) -> bool {
                Value_IsSymbolObject(self)
            }
            #[inline]
            pub unsafe fn IsNativeError(&self) -> bool {
                Value_IsNativeError(self)
            }
            #[inline]
            pub unsafe fn IsRegExp(&self) -> bool {
                Value_IsRegExp(self)
            }
            #[inline]
            pub unsafe fn IsAsyncFunction(&self) -> bool {
                Value_IsAsyncFunction(self)
            }
            #[inline]
            pub unsafe fn IsGeneratorFunction(&self) -> bool {
                Value_IsGeneratorFunction(self)
            }
            #[inline]
            pub unsafe fn IsGeneratorObject(&self) -> bool {
                Value_IsGeneratorObject(self)
            }
            #[inline]
            pub unsafe fn IsPromise(&self) -> bool {
                Value_IsPromise(self)
            }
            #[inline]
            pub unsafe fn IsMap(&self) -> bool {
                Value_IsMap(self)
            }
            #[inline]
            pub unsafe fn IsSet(&self) -> bool {
                Value_IsSet(self)
            }
            #[inline]
            pub unsafe fn IsMapIterator(&self) -> bool {
                Value_IsMapIterator(self)
            }
            #[inline]
            pub unsafe fn IsSetIterator(&self) -> bool {
                Value_IsSetIterator(self)
            }
            #[inline]
            pub unsafe fn IsWeakMap(&self) -> bool {
                Value_IsWeakMap(self)
            }
            #[inline]
            pub unsafe fn IsWeakSet(&self) -> bool {
                Value_IsWeakSet(self)
            }
            #[inline]
            pub unsafe fn IsArrayBuffer(&self) -> bool {
                Value_IsArrayBuffer(self)
            }
            #[inline]
            pub unsafe fn IsArrayBufferView(&self) -> bool {
                Value_IsArrayBufferView(self)
            }
            #[inline]
            pub unsafe fn IsTypedArray(&self) -> bool {
                Value_IsTypedArray(self)
            }
            #[inline]
            pub unsafe fn IsUint8Array(&self) -> bool {
                Value_IsUint8Array(self)
            }
            #[inline]
            pub unsafe fn IsUint8ClampedArray(&self) -> bool {
                Value_IsUint8ClampedArray(self)
            }
            #[inline]
            pub unsafe fn IsInt8Array(&self) -> bool {
                Value_IsInt8Array(self)
            }
            #[inline]
            pub unsafe fn IsUint16Array(&self) -> bool {
                Value_IsUint16Array(self)
            }
            #[inline]
            pub unsafe fn IsInt16Array(&self) -> bool {
                Value_IsInt16Array(self)
            }
            #[inline]
            pub unsafe fn IsUint32Array(&self) -> bool {
                Value_IsUint32Array(self)
            }
            #[inline]
            pub unsafe fn IsInt32Array(&self) -> bool {
                Value_IsInt32Array(self)
            }
            #[inline]
            pub unsafe fn IsFloat32Array(&self) -> bool {
                Value_IsFloat32Array(self)
            }
            #[inline]
            pub unsafe fn IsFloat64Array(&self) -> bool {
                Value_IsFloat64Array(self)
            }
            #[inline]
            pub unsafe fn IsBigInt64Array(&self) -> bool {
                Value_IsBigInt64Array(self)
            }
            #[inline]
            pub unsafe fn IsBigUint64Array(&self) -> bool {
                Value_IsBigUint64Array(self)
            }
            #[inline]
            pub unsafe fn IsDataView(&self) -> bool {
                Value_IsDataView(self)
            }
            #[inline]
            pub unsafe fn IsSharedArrayBuffer(&self) -> bool {
                Value_IsSharedArrayBuffer(self)
            }
            #[inline]
            pub unsafe fn IsProxy(&self) -> bool {
                Value_IsProxy(self)
            }
            #[inline]
            pub unsafe fn IsWebAssemblyCompiledModule(&self) -> bool {
                Value_IsWebAssemblyCompiledModule(self)
            }
            #[inline]
            pub unsafe fn IsModuleNamespaceObject(&self) -> bool {
                Value_IsModuleNamespaceObject(self)
            }
            #[inline]
            pub unsafe fn ToBigInt(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::BigInt> {
                Value_ToBigInt(self, context)
            }
            #[inline]
            pub unsafe fn ToBoolean(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Boolean> {
                Value_ToBoolean(self, context)
            }
            #[inline]
            pub unsafe fn ToNumber(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Number> {
                Value_ToNumber(self, context)
            }
            #[inline]
            pub unsafe fn ToString(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                Value_ToString(self, context)
            }
            #[inline]
            pub unsafe fn ToDetailString(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                Value_ToDetailString(self, context)
            }
            #[inline]
            pub unsafe fn ToObject(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Object> {
                Value_ToObject(self, context)
            }
            #[inline]
            pub unsafe fn ToInteger(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Integer> {
                Value_ToInteger(self, context)
            }
            #[inline]
            pub unsafe fn ToUint32(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Uint32> {
                Value_ToUint32(self, context)
            }
            #[inline]
            pub unsafe fn ToInt32(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Int32> {
                Value_ToInt32(self, context)
            }
            #[inline]
            pub unsafe fn ToBoolean1(
                &self,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Boolean> {
                Value_ToBoolean1(self, isolate)
            }
            #[inline]
            pub unsafe fn ToNumber1(
                &self,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Number> {
                Value_ToNumber1(self, isolate)
            }
            #[inline]
            pub unsafe fn ToString1(
                &self,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::String> {
                Value_ToString1(self, isolate)
            }
            #[inline]
            pub unsafe fn ToObject1(
                &self,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Object> {
                Value_ToObject1(self, isolate)
            }
            #[inline]
            pub unsafe fn ToInteger1(
                &self,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Integer> {
                Value_ToInteger1(self, isolate)
            }
            #[inline]
            pub unsafe fn ToInt321(
                &self,
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Int32> {
                Value_ToInt321(self, isolate)
            }
            #[inline]
            pub unsafe fn ToArrayIndex(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Uint32> {
                Value_ToArrayIndex(self, context)
            }
            #[inline]
            pub unsafe fn BooleanValue(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<bool> {
                Value_BooleanValue(self, context)
            }
            #[inline]
            pub unsafe fn NumberValue(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<f64> {
                Value_NumberValue(self, context)
            }
            #[inline]
            pub unsafe fn IntegerValue(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<i64> {
                Value_IntegerValue(self, context)
            }
            #[inline]
            pub unsafe fn Uint32Value(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<u32> {
                Value_Uint32Value(self, context)
            }
            #[inline]
            pub unsafe fn Int32Value(
                &self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::Maybe<i32> {
                Value_Int32Value(self, context)
            }
            #[inline]
            pub unsafe fn Equals(
                &self,
                context: root::v8::Local<root::v8::Context>,
                that: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Value_Equals(self, context, that)
            }
            #[inline]
            pub unsafe fn StrictEquals(&self, that: root::v8::Local<root::v8::Value>) -> bool {
                Value_StrictEquals(self, that)
            }
            #[inline]
            pub unsafe fn SameValue(&self, that: root::v8::Local<root::v8::Value>) -> bool {
                Value_SameValue(self, that)
            }
            #[inline]
            pub unsafe fn TypeOf(
                &mut self,
                arg1: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::String> {
                Value_TypeOf(self, arg1)
            }
            #[inline]
            pub unsafe fn InstanceOf(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                object: root::v8::Local<root::v8::Object>,
            ) -> root::v8::Maybe<bool> {
                Value_InstanceOf(self, context, object)
            }
        }
        /// The superclass of primitive values.  See ECMA-262 4.3.2.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Primitive {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Primitive() {
            assert_eq!(
                ::std::mem::size_of::<Primitive>(),
                1usize,
                concat!("Size of: ", stringify!(Primitive))
            );
            assert_eq!(
                ::std::mem::align_of::<Primitive>(),
                1usize,
                concat!("Alignment of ", stringify!(Primitive))
            );
        }
        /// A primitive boolean value (ECMA-262, 4.3.14).  Either the true
        /// or false value.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Boolean {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Boolean() {
            assert_eq!(
                ::std::mem::size_of::<Boolean>(),
                1usize,
                concat!("Size of: ", stringify!(Boolean))
            );
            assert_eq!(
                ::std::mem::align_of::<Boolean>(),
                1usize,
                concat!("Alignment of ", stringify!(Boolean))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Value@Boolean@v8@@QEBA_NXZ"]
            pub fn Boolean_Value(this: *const root::v8::Boolean) -> bool;
        }
        impl Boolean {
            #[inline]
            pub unsafe fn Value(&self) -> bool {
                Boolean_Value(self)
            }
        }
        /// A superclass for symbols and strings.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Name {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Name() {
            assert_eq!(
                ::std::mem::size_of::<Name>(),
                1usize,
                concat!("Size of: ", stringify!(Name))
            );
            assert_eq!(
                ::std::mem::align_of::<Name>(),
                1usize,
                concat!("Alignment of ", stringify!(Name))
            );
        }
        extern "C" {
            /// Returns the identity hash for this object. The current implementation
            /// uses an inline property on the object to store the identity hash.
            ///
            /// The return value will never be 0. Also, it is not guaranteed to be
            /// unique.
            #[link_name = "\u{1}?GetIdentityHash@Name@v8@@QEAAHXZ"]
            pub fn Name_GetIdentityHash(this: *mut root::v8::Name) -> ::std::os::raw::c_int;
        }
        impl Name {
            #[inline]
            pub unsafe fn GetIdentityHash(&mut self) -> ::std::os::raw::c_int {
                Name_GetIdentityHash(self)
            }
        }
        /// Create a new string, always allocating new storage memory.
        pub const NewStringType_kNormal: root::v8::NewStringType = 0;
        /// Acts as a hint that the string should be created in the
        /// old generation heap space and be deduplicated if an identical string
        /// already exists.
        pub const NewStringType_kInternalized: root::v8::NewStringType = 1;
        /// A flag describing different modes of string creation.
        ///
        /// Aside from performance implications there are no differences between the two
        /// creation modes.
        pub type NewStringType = i32;
        /// A JavaScript string value (ECMA-262, 4.3.17).
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct String {
            pub _address: u8,
        }
        pub const String_Encoding_UNKNOWN_ENCODING: root::v8::String_Encoding = 1;
        pub const String_Encoding_TWO_BYTE_ENCODING: root::v8::String_Encoding = 0;
        pub const String_Encoding_ONE_BYTE_ENCODING: root::v8::String_Encoding = 8;
        pub type String_Encoding = i32;
        pub const String_WriteOptions_NO_OPTIONS: root::v8::String_WriteOptions = 0;
        pub const String_WriteOptions_HINT_MANY_WRITES_EXPECTED: root::v8::String_WriteOptions = 1;
        pub const String_WriteOptions_NO_NULL_TERMINATION: root::v8::String_WriteOptions = 2;
        pub const String_WriteOptions_PRESERVE_ONE_BYTE_NULL: root::v8::String_WriteOptions = 4;
        pub const String_WriteOptions_REPLACE_INVALID_UTF8: root::v8::String_WriteOptions = 8;
        /// Write the contents of the string to an external buffer.
        /// If no arguments are given, expects the buffer to be large
        /// enough to hold the entire string and NULL terminator. Copies
        /// the contents of the string and the NULL terminator into the
        /// buffer.
        ///
        /// WriteUtf8 will not write partial UTF-8 sequences, preferring to stop
        /// before the end of the buffer.
        ///
        /// Copies up to length characters into the output buffer.
        /// Only null-terminates if there is enough space in the buffer.
        ///
        /// \param buffer The buffer into which the string will be copied.
        /// \param start The starting position within the string at which
        /// copying begins.
        /// \param length The number of characters to copy from the string.  For
        /// WriteUtf8 the number of bytes in the buffer.
        /// \param nchars_ref The number of characters written, can be NULL.
        /// \param options Various options that might affect performance of this or
        /// subsequent operations.
        /// \return The number of characters copied to the buffer excluding the null
        /// terminator.  For WriteUtf8: The number of bytes copied to the buffer
        /// including the null terminator (if written).
        pub type String_WriteOptions = i32;
        #[repr(C)]
        pub struct String_ExternalStringResourceBase__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct String_ExternalStringResourceBase {
            pub vtable_: *const String_ExternalStringResourceBase__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_String_ExternalStringResourceBase() {
            assert_eq!(
                ::std::mem::size_of::<String_ExternalStringResourceBase>(),
                8usize,
                concat!("Size of: ", stringify!(String_ExternalStringResourceBase))
            );
            assert_eq!(
                ::std::mem::align_of::<String_ExternalStringResourceBase>(),
                8usize,
                concat!(
                    "Alignment of ",
                    stringify!(String_ExternalStringResourceBase)
                )
            );
        }
        /// An ExternalStringResource is a wrapper around a two-byte string
        /// buffer that resides outside V8's heap. Implement an
        /// ExternalStringResource to manage the life cycle of the underlying
        /// buffer.  Note that the string data must be immutable.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct String_ExternalStringResource {
            pub _base: root::v8::String_ExternalStringResourceBase,
        }
        #[test]
        fn bindgen_test_layout_String_ExternalStringResource() {
            assert_eq!(
                ::std::mem::size_of::<String_ExternalStringResource>(),
                8usize,
                concat!("Size of: ", stringify!(String_ExternalStringResource))
            );
            assert_eq!(
                ::std::mem::align_of::<String_ExternalStringResource>(),
                8usize,
                concat!("Alignment of ", stringify!(String_ExternalStringResource))
            );
        }
        /// An ExternalOneByteStringResource is a wrapper around an one-byte
        /// string buffer that resides outside V8's heap. Implement an
        /// ExternalOneByteStringResource to manage the life cycle of the
        /// underlying buffer.  Note that the string data must be immutable
        /// and that the data must be Latin-1 and not UTF-8, which would require
        /// special treatment internally in the engine and do not allow efficient
        /// indexing.  Use String::New or convert to 16 bit data for non-Latin1.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct String_ExternalOneByteStringResource {
            pub _base: root::v8::String_ExternalStringResourceBase,
        }
        #[test]
        fn bindgen_test_layout_String_ExternalOneByteStringResource() {
            assert_eq!(
                ::std::mem::size_of::<String_ExternalOneByteStringResource>(),
                8usize,
                concat!(
                    "Size of: ",
                    stringify!(String_ExternalOneByteStringResource)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<String_ExternalOneByteStringResource>(),
                8usize,
                concat!(
                    "Alignment of ",
                    stringify!(String_ExternalOneByteStringResource)
                )
            );
        }
        pub const String_NewStringType_kNormalString: root::v8::String_NewStringType = 0;
        pub const String_NewStringType_kInternalizedString: root::v8::String_NewStringType = 1;
        pub type String_NewStringType = i32;
        /// Converts an object to a UTF-8-encoded character array.  Useful if
        /// you want to print the object.  If conversion to a string fails
        /// (e.g. due to an exception in the toString() method of the object)
        /// then the length() method returns 0 and the * operator returns
        /// NULL.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct String_Utf8Value {
            pub str_: *mut ::std::os::raw::c_char,
            pub length_: ::std::os::raw::c_int,
        }
        #[test]
        fn bindgen_test_layout_String_Utf8Value() {
            assert_eq!(
                ::std::mem::size_of::<String_Utf8Value>(),
                16usize,
                concat!("Size of: ", stringify!(String_Utf8Value))
            );
            assert_eq!(
                ::std::mem::align_of::<String_Utf8Value>(),
                8usize,
                concat!("Alignment of ", stringify!(String_Utf8Value))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<String_Utf8Value>())).str_ as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(String_Utf8Value),
                    "::",
                    stringify!(str_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<String_Utf8Value>())).length_ as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(String_Utf8Value),
                    "::",
                    stringify!(length_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0Utf8Value@String@v8@@QEAA@PEAVIsolate@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn String_Utf8Value_Utf8Value(
                this: *mut root::v8::String_Utf8Value,
                isolate: *mut root::v8::Isolate,
                obj: root::v8::Local<root::v8::Value>,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DUtf8Value@String@v8@@QEAAXXZ"]
            pub fn String_Utf8Value_Utf8Value_destructor(this: *mut root::v8::String_Utf8Value);
        }
        impl String_Utf8Value {
            #[inline]
            pub unsafe fn new(
                isolate: *mut root::v8::Isolate,
                obj: root::v8::Local<root::v8::Value>,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                String_Utf8Value_Utf8Value(&mut __bindgen_tmp, isolate, obj);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                String_Utf8Value_Utf8Value_destructor(self)
            }
        }
        /// Converts an object to a two-byte (UTF-16-encoded) string.
        /// If conversion to a string fails (eg. due to an exception in the toString()
        /// method of the object) then the length() method returns 0 and the * operator
        /// returns NULL.
        #[repr(C)]
        #[derive(Debug, Hash, PartialEq, Eq)]
        pub struct String_Value {
            pub str_: *mut u16,
            pub length_: ::std::os::raw::c_int,
        }
        #[test]
        fn bindgen_test_layout_String_Value() {
            assert_eq!(
                ::std::mem::size_of::<String_Value>(),
                16usize,
                concat!("Size of: ", stringify!(String_Value))
            );
            assert_eq!(
                ::std::mem::align_of::<String_Value>(),
                8usize,
                concat!("Alignment of ", stringify!(String_Value))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<String_Value>())).str_ as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(String_Value),
                    "::",
                    stringify!(str_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<String_Value>())).length_ as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(String_Value),
                    "::",
                    stringify!(length_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}??0Value@String@v8@@QEAA@PEAVIsolate@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn String_Value_Value(
                this: *mut root::v8::String_Value,
                isolate: *mut root::v8::Isolate,
                obj: root::v8::Local<root::v8::Value>,
            );
        }
        extern "C" {
            #[link_name = "\u{1}??_DValue@String@v8@@QEAAXXZ"]
            pub fn String_Value_Value_destructor(this: *mut root::v8::String_Value);
        }
        impl String_Value {
            #[inline]
            pub unsafe fn new(
                isolate: *mut root::v8::Isolate,
                obj: root::v8::Local<root::v8::Value>,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                String_Value_Value(&mut __bindgen_tmp, isolate, obj);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                String_Value_Value_destructor(self)
            }
        }
        pub const String_kMaxLength: ::std::os::raw::c_int = 1073741799;
        #[test]
        fn bindgen_test_layout_String() {
            assert_eq!(
                ::std::mem::size_of::<String>(),
                1usize,
                concat!("Size of: ", stringify!(String))
            );
            assert_eq!(
                ::std::mem::align_of::<String>(),
                1usize,
                concat!("Alignment of ", stringify!(String))
            );
        }
        extern "C" {
            /// Returns the number of characters (UTF-16 code units) in this string.
            #[link_name = "\u{1}?Length@String@v8@@QEBAHXZ"]
            pub fn String_Length(this: *const root::v8::String) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns the number of bytes in the UTF-8 encoded
            /// representation of this string.
            #[link_name = "\u{1}?Utf8Length@String@v8@@QEBAHPEAVIsolate@2@@Z"]
            pub fn String_Utf8Length(
                this: *const root::v8::String,
                isolate: *mut root::v8::Isolate,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns whether this string is known to contain only one byte data,
            /// i.e. ISO-8859-1 code points.
            /// Does not read the string.
            /// False negatives are possible.
            #[link_name = "\u{1}?IsOneByte@String@v8@@QEBA_NXZ"]
            pub fn String_IsOneByte(this: *const root::v8::String) -> bool;
        }
        extern "C" {
            /// Returns whether this string contain only one byte data,
            /// i.e. ISO-8859-1 code points.
            /// Will read the entire string in some cases.
            #[link_name = "\u{1}?ContainsOnlyOneByte@String@v8@@QEBA_NXZ"]
            pub fn String_ContainsOnlyOneByte(this: *const root::v8::String) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?Write@String@v8@@QEBAHPEAVIsolate@2@PEAGHHH@Z"]
            pub fn String_Write(
                this: *const root::v8::String,
                isolate: *mut root::v8::Isolate,
                buffer: *mut u16,
                start: ::std::os::raw::c_int,
                length: ::std::os::raw::c_int,
                options: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}?WriteOneByte@String@v8@@QEBAHPEAVIsolate@2@PEAEHHH@Z"]
            pub fn String_WriteOneByte(
                this: *const root::v8::String,
                isolate: *mut root::v8::Isolate,
                buffer: *mut u8,
                start: ::std::os::raw::c_int,
                length: ::std::os::raw::c_int,
                options: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}?WriteUtf8@String@v8@@QEBAHPEAVIsolate@2@PEADHPEAHH@Z"]
            pub fn String_WriteUtf8(
                this: *const root::v8::String,
                isolate: *mut root::v8::Isolate,
                buffer: *mut ::std::os::raw::c_char,
                length: ::std::os::raw::c_int,
                nchars_ref: *mut ::std::os::raw::c_int,
                options: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Returns true if the string is external
            #[link_name = "\u{1}?IsExternal@String@v8@@QEBA_NXZ"]
            pub fn String_IsExternal(this: *const root::v8::String) -> bool;
        }
        extern "C" {
            /// Returns true if the string is both external and one-byte.
            #[link_name = "\u{1}?IsExternalOneByte@String@v8@@QEBA_NXZ"]
            pub fn String_IsExternalOneByte(this: *const root::v8::String) -> bool;
        }
        extern "C" {
            /// Get the ExternalOneByteStringResource for an external one-byte string.
            /// Returns NULL if IsExternalOneByte() doesn't return true.
            #[link_name = "\u{1}?GetExternalOneByteStringResource@String@v8@@QEBAPEBVExternalOneByteStringResource@12@XZ"]
            pub fn String_GetExternalOneByteStringResource(
                this: *const root::v8::String,
            ) -> *const root::v8::String_ExternalOneByteStringResource;
        }
        extern "C" {
            #[link_name = "\u{1}?NewFromUtf8@String@v8@@SA?AV?$Local@VString@v8@@@2@PEAVIsolate@2@PEBDW4NewStringType@12@H@Z"]
            pub fn String_NewFromUtf8(
                isolate: *mut root::v8::Isolate,
                data: *const ::std::os::raw::c_char,
                type_: root::v8::String_NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Allocates a new string from UTF-8 data. Only returns an empty value when
            /// length > kMaxLength.
            #[link_name = "\u{1}?NewFromUtf8@String@v8@@SA?AV?$MaybeLocal@VString@v8@@@2@PEAVIsolate@2@PEBDW4NewStringType@2@H@Z"]
            pub fn String_NewFromUtf81(
                isolate: *mut root::v8::Isolate,
                data: *const ::std::os::raw::c_char,
                type_: root::v8::NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            /// Allocates a new string from Latin-1 data.  Only returns an empty value
            /// when length > kMaxLength.
            #[link_name = "\u{1}?NewFromOneByte@String@v8@@SA?AV?$MaybeLocal@VString@v8@@@2@PEAVIsolate@2@PEBEW4NewStringType@2@H@Z"]
            pub fn String_NewFromOneByte(
                isolate: *mut root::v8::Isolate,
                data: *const u8,
                type_: root::v8::NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            #[link_name = "\u{1}?NewFromTwoByte@String@v8@@SA?AV?$Local@VString@v8@@@2@PEAVIsolate@2@PEBGW4NewStringType@12@H@Z"]
            pub fn String_NewFromTwoByte(
                isolate: *mut root::v8::Isolate,
                data: *const u16,
                type_: root::v8::String_NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Allocates a new string from UTF-16 data. Only returns an empty value when
            /// length > kMaxLength.
            #[link_name = "\u{1}?NewFromTwoByte@String@v8@@SA?AV?$MaybeLocal@VString@v8@@@2@PEAVIsolate@2@PEBGW4NewStringType@2@H@Z"]
            pub fn String_NewFromTwoByte1(
                isolate: *mut root::v8::Isolate,
                data: *const u16,
                type_: root::v8::NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            /// Creates a new string by concatenating the left and the right strings
            /// passed in as parameters.
            #[link_name = "\u{1}?Concat@String@v8@@SA?AV?$Local@VString@v8@@@2@PEAVIsolate@2@V32@1@Z"]
            pub fn String_Concat(
                isolate: *mut root::v8::Isolate,
                left: root::v8::Local<root::v8::String>,
                right: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Creates a new external string using the data defined in the given
            /// resource. When the external string is no longer live on V8's heap the
            /// resource will be disposed by calling its Dispose method. The caller of
            /// this function should not otherwise delete or modify the resource. Neither
            /// should the underlying buffer be deallocated or modified except through the
            /// destructor of the external string resource.
            #[link_name = "\u{1}?NewExternalTwoByte@String@v8@@SA?AV?$MaybeLocal@VString@v8@@@2@PEAVIsolate@2@PEAVExternalStringResource@12@@Z"]
            pub fn String_NewExternalTwoByte(
                isolate: *mut root::v8::Isolate,
                resource: *mut root::v8::String_ExternalStringResource,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            /// Associate an external string resource with this string by transforming it
            /// in place so that existing references to this string in the JavaScript heap
            /// will use the external string resource. The external string resource's
            /// character contents need to be equivalent to this string.
            /// Returns true if the string has been changed to be an external string.
            /// The string is not modified if the operation fails. See NewExternal for
            /// information on the lifetime of the resource.
            #[link_name = "\u{1}?MakeExternal@String@v8@@QEAA_NPEAVExternalStringResource@12@@Z"]
            pub fn String_MakeExternal(
                this: *mut root::v8::String,
                resource: *mut root::v8::String_ExternalStringResource,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?NewExternal@String@v8@@SA?AV?$Local@VString@v8@@@2@PEAVIsolate@2@PEAVExternalOneByteStringResource@12@@Z"]
            pub fn String_NewExternal(
                isolate: *mut root::v8::Isolate,
                resource: *mut root::v8::String_ExternalOneByteStringResource,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            #[link_name = "\u{1}?NewExternalOneByte@String@v8@@SA?AV?$MaybeLocal@VString@v8@@@2@PEAVIsolate@2@PEAVExternalOneByteStringResource@12@@Z"]
            pub fn String_NewExternalOneByte(
                isolate: *mut root::v8::Isolate,
                resource: *mut root::v8::String_ExternalOneByteStringResource,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            /// Associate an external string resource with this string by transforming it
            /// in place so that existing references to this string in the JavaScript heap
            /// will use the external string resource. The external string resource's
            /// character contents need to be equivalent to this string.
            /// Returns true if the string has been changed to be an external string.
            /// The string is not modified if the operation fails. See NewExternal for
            /// information on the lifetime of the resource.
            #[link_name = "\u{1}?MakeExternal@String@v8@@QEAA_NPEAVExternalOneByteStringResource@12@@Z"]
            pub fn String_MakeExternal1(
                this: *mut root::v8::String,
                resource: *mut root::v8::String_ExternalOneByteStringResource,
            ) -> bool;
        }
        extern "C" {
            /// Returns true if this string can be made external.
            #[link_name = "\u{1}?CanMakeExternal@String@v8@@QEAA_NXZ"]
            pub fn String_CanMakeExternal(this: *mut root::v8::String) -> bool;
        }
        extern "C" {
            /// Returns true if the strings values are equal. Same as JS ==/===.
            #[link_name = "\u{1}?StringEquals@String@v8@@QEAA_NV?$Local@VString@v8@@@2@@Z"]
            pub fn String_StringEquals(
                this: *mut root::v8::String,
                str: root::v8::Local<root::v8::String>,
            ) -> bool;
        }
        impl String {
            #[inline]
            pub unsafe fn Length(&self) -> ::std::os::raw::c_int {
                String_Length(self)
            }
            #[inline]
            pub unsafe fn Utf8Length(
                &self,
                isolate: *mut root::v8::Isolate,
            ) -> ::std::os::raw::c_int {
                String_Utf8Length(self, isolate)
            }
            #[inline]
            pub unsafe fn IsOneByte(&self) -> bool {
                String_IsOneByte(self)
            }
            #[inline]
            pub unsafe fn ContainsOnlyOneByte(&self) -> bool {
                String_ContainsOnlyOneByte(self)
            }
            #[inline]
            pub unsafe fn Write(
                &self,
                isolate: *mut root::v8::Isolate,
                buffer: *mut u16,
                start: ::std::os::raw::c_int,
                length: ::std::os::raw::c_int,
                options: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int {
                String_Write(self, isolate, buffer, start, length, options)
            }
            #[inline]
            pub unsafe fn WriteOneByte(
                &self,
                isolate: *mut root::v8::Isolate,
                buffer: *mut u8,
                start: ::std::os::raw::c_int,
                length: ::std::os::raw::c_int,
                options: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int {
                String_WriteOneByte(self, isolate, buffer, start, length, options)
            }
            #[inline]
            pub unsafe fn WriteUtf8(
                &self,
                isolate: *mut root::v8::Isolate,
                buffer: *mut ::std::os::raw::c_char,
                length: ::std::os::raw::c_int,
                nchars_ref: *mut ::std::os::raw::c_int,
                options: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int {
                String_WriteUtf8(self, isolate, buffer, length, nchars_ref, options)
            }
            #[inline]
            pub unsafe fn IsExternal(&self) -> bool {
                String_IsExternal(self)
            }
            #[inline]
            pub unsafe fn IsExternalOneByte(&self) -> bool {
                String_IsExternalOneByte(self)
            }
            #[inline]
            pub unsafe fn GetExternalOneByteStringResource(
                &self,
            ) -> *const root::v8::String_ExternalOneByteStringResource {
                String_GetExternalOneByteStringResource(self)
            }
            #[inline]
            pub unsafe fn NewFromUtf8(
                isolate: *mut root::v8::Isolate,
                data: *const ::std::os::raw::c_char,
                type_: root::v8::String_NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::String> {
                String_NewFromUtf8(isolate, data, type_, length)
            }
            #[inline]
            pub unsafe fn NewFromUtf81(
                isolate: *mut root::v8::Isolate,
                data: *const ::std::os::raw::c_char,
                type_: root::v8::NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                String_NewFromUtf81(isolate, data, type_, length)
            }
            #[inline]
            pub unsafe fn NewFromOneByte(
                isolate: *mut root::v8::Isolate,
                data: *const u8,
                type_: root::v8::NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                String_NewFromOneByte(isolate, data, type_, length)
            }
            #[inline]
            pub unsafe fn NewFromTwoByte(
                isolate: *mut root::v8::Isolate,
                data: *const u16,
                type_: root::v8::String_NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::String> {
                String_NewFromTwoByte(isolate, data, type_, length)
            }
            #[inline]
            pub unsafe fn NewFromTwoByte1(
                isolate: *mut root::v8::Isolate,
                data: *const u16,
                type_: root::v8::NewStringType,
                length: ::std::os::raw::c_int,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                String_NewFromTwoByte1(isolate, data, type_, length)
            }
            #[inline]
            pub unsafe fn Concat(
                isolate: *mut root::v8::Isolate,
                left: root::v8::Local<root::v8::String>,
                right: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::String> {
                String_Concat(isolate, left, right)
            }
            #[inline]
            pub unsafe fn NewExternalTwoByte(
                isolate: *mut root::v8::Isolate,
                resource: *mut root::v8::String_ExternalStringResource,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                String_NewExternalTwoByte(isolate, resource)
            }
            #[inline]
            pub unsafe fn MakeExternal(
                &mut self,
                resource: *mut root::v8::String_ExternalStringResource,
            ) -> bool {
                String_MakeExternal(self, resource)
            }
            #[inline]
            pub unsafe fn NewExternal(
                isolate: *mut root::v8::Isolate,
                resource: *mut root::v8::String_ExternalOneByteStringResource,
            ) -> root::v8::Local<root::v8::String> {
                String_NewExternal(isolate, resource)
            }
            #[inline]
            pub unsafe fn NewExternalOneByte(
                isolate: *mut root::v8::Isolate,
                resource: *mut root::v8::String_ExternalOneByteStringResource,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                String_NewExternalOneByte(isolate, resource)
            }
            #[inline]
            pub unsafe fn MakeExternal1(
                &mut self,
                resource: *mut root::v8::String_ExternalOneByteStringResource,
            ) -> bool {
                String_MakeExternal1(self, resource)
            }
            #[inline]
            pub unsafe fn CanMakeExternal(&mut self) -> bool {
                String_CanMakeExternal(self)
            }
            #[inline]
            pub unsafe fn StringEquals(&mut self, str: root::v8::Local<root::v8::String>) -> bool {
                String_StringEquals(self, str)
            }
        }
        /// A JavaScript symbol (ECMA-262 edition 6)
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Symbol {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Symbol() {
            assert_eq!(
                ::std::mem::size_of::<Symbol>(),
                1usize,
                concat!("Size of: ", stringify!(Symbol))
            );
            assert_eq!(
                ::std::mem::align_of::<Symbol>(),
                1usize,
                concat!("Alignment of ", stringify!(Symbol))
            );
        }
        extern "C" {
            /// Returns the print name string of the symbol, or undefined if none.
            #[link_name = "\u{1}?Name@Symbol@v8@@QEBA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn Symbol_Name(this: *const root::v8::Symbol) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Create a symbol. If name is not empty, it will be used as the description.
            #[link_name = "\u{1}?New@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn Symbol_New(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            /// Access global symbol registry.
            /// Note that symbols created this way are never collected, so
            /// they should only be used for statically fixed properties.
            /// Also, there is only one global name space for the names used as keys.
            /// To minimize the potential for clashes, use qualified names as keys.
            #[link_name = "\u{1}?For@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn Symbol_For(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            /// Retrieve a global symbol. Similar to |For|, but using a separate
            /// registry that is not accessible by (and cannot clash with) JavaScript code.
            #[link_name = "\u{1}?ForApi@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn Symbol_ForApi(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetAsyncIterator@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetAsyncIterator(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetHasInstance@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetHasInstance(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetIsConcatSpreadable@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetIsConcatSpreadable(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetIterator@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetIterator(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetMatch@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetMatch(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetReplace@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetReplace(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetSearch@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetSearch(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetSplit@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetSplit(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetToPrimitive@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetToPrimitive(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetToStringTag@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetToStringTag(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetUnscopables@Symbol@v8@@SA?AV?$Local@VSymbol@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Symbol_GetUnscopables(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol>;
        }
        impl Symbol {
            #[inline]
            pub unsafe fn Name(&self) -> root::v8::Local<root::v8::Value> {
                Symbol_Name(self)
            }
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_New(isolate, name)
            }
            #[inline]
            pub unsafe fn For(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_For(isolate, name)
            }
            #[inline]
            pub unsafe fn ForApi(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_ForApi(isolate, name)
            }
            #[inline]
            pub unsafe fn GetAsyncIterator(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetAsyncIterator(isolate)
            }
            #[inline]
            pub unsafe fn GetHasInstance(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetHasInstance(isolate)
            }
            #[inline]
            pub unsafe fn GetIsConcatSpreadable(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetIsConcatSpreadable(isolate)
            }
            #[inline]
            pub unsafe fn GetIterator(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetIterator(isolate)
            }
            #[inline]
            pub unsafe fn GetMatch(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetMatch(isolate)
            }
            #[inline]
            pub unsafe fn GetReplace(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetReplace(isolate)
            }
            #[inline]
            pub unsafe fn GetSearch(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetSearch(isolate)
            }
            #[inline]
            pub unsafe fn GetSplit(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetSplit(isolate)
            }
            #[inline]
            pub unsafe fn GetToPrimitive(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetToPrimitive(isolate)
            }
            #[inline]
            pub unsafe fn GetToStringTag(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetToStringTag(isolate)
            }
            #[inline]
            pub unsafe fn GetUnscopables(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Symbol> {
                Symbol_GetUnscopables(isolate)
            }
        }
        /// A private symbol
        ///
        /// This is an experimental feature. Use at your own risk.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Private {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Private() {
            assert_eq!(
                ::std::mem::size_of::<Private>(),
                1usize,
                concat!("Size of: ", stringify!(Private))
            );
            assert_eq!(
                ::std::mem::align_of::<Private>(),
                1usize,
                concat!("Alignment of ", stringify!(Private))
            );
        }
        extern "C" {
            /// Returns the print name string of the private symbol, or undefined if none.
            #[link_name = "\u{1}?Name@Private@v8@@QEBA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn Private_Name(this: *const root::v8::Private)
                -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Create a private symbol. If name is not empty, it will be the description.
            #[link_name = "\u{1}?New@Private@v8@@SA?AV?$Local@VPrivate@v8@@@2@PEAVIsolate@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn Private_New(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Private>;
        }
        extern "C" {
            /// Retrieve a global private symbol. If a symbol with this name has not
            /// been retrieved in the same isolate before, it is created.
            /// Note that private symbols created this way are never collected, so
            /// they should only be used for statically fixed properties.
            /// Also, there is only one global name space for the names used as keys.
            /// To minimize the potential for clashes, use qualified names as keys,
            /// e.g., "Class#property".
            #[link_name = "\u{1}?ForApi@Private@v8@@SA?AV?$Local@VPrivate@v8@@@2@PEAVIsolate@2@V?$Local@VString@v8@@@2@@Z"]
            pub fn Private_ForApi(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Private>;
        }
        impl Private {
            #[inline]
            pub unsafe fn Name(&self) -> root::v8::Local<root::v8::Value> {
                Private_Name(self)
            }
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Private> {
                Private_New(isolate, name)
            }
            #[inline]
            pub unsafe fn ForApi(
                isolate: *mut root::v8::Isolate,
                name: root::v8::Local<root::v8::String>,
            ) -> root::v8::Local<root::v8::Private> {
                Private_ForApi(isolate, name)
            }
        }
        /// A JavaScript number value (ECMA-262, 4.3.20)
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Number {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Number() {
            assert_eq!(
                ::std::mem::size_of::<Number>(),
                1usize,
                concat!("Size of: ", stringify!(Number))
            );
            assert_eq!(
                ::std::mem::align_of::<Number>(),
                1usize,
                concat!("Alignment of ", stringify!(Number))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Value@Number@v8@@QEBANXZ"]
            pub fn Number_Value(this: *const root::v8::Number) -> f64;
        }
        extern "C" {
            #[link_name = "\u{1}?New@Number@v8@@SA?AV?$Local@VNumber@v8@@@2@PEAVIsolate@2@N@Z"]
            pub fn Number_New(
                isolate: *mut root::v8::Isolate,
                value: f64,
            ) -> root::v8::Local<root::v8::Number>;
        }
        impl Number {
            #[inline]
            pub unsafe fn Value(&self) -> f64 {
                Number_Value(self)
            }
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
                value: f64,
            ) -> root::v8::Local<root::v8::Number> {
                Number_New(isolate, value)
            }
        }
        /// A JavaScript value representing a signed integer.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Integer {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Integer() {
            assert_eq!(
                ::std::mem::size_of::<Integer>(),
                1usize,
                concat!("Size of: ", stringify!(Integer))
            );
            assert_eq!(
                ::std::mem::align_of::<Integer>(),
                1usize,
                concat!("Alignment of ", stringify!(Integer))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?New@Integer@v8@@SA?AV?$Local@VInteger@v8@@@2@PEAVIsolate@2@H@Z"]
            pub fn Integer_New(
                isolate: *mut root::v8::Isolate,
                value: i32,
            ) -> root::v8::Local<root::v8::Integer>;
        }
        extern "C" {
            #[link_name = "\u{1}?NewFromUnsigned@Integer@v8@@SA?AV?$Local@VInteger@v8@@@2@PEAVIsolate@2@I@Z"]
            pub fn Integer_NewFromUnsigned(
                isolate: *mut root::v8::Isolate,
                value: u32,
            ) -> root::v8::Local<root::v8::Integer>;
        }
        extern "C" {
            #[link_name = "\u{1}?Value@Integer@v8@@QEBA_JXZ"]
            pub fn Integer_Value(this: *const root::v8::Integer) -> i64;
        }
        impl Integer {
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
                value: i32,
            ) -> root::v8::Local<root::v8::Integer> {
                Integer_New(isolate, value)
            }
            #[inline]
            pub unsafe fn NewFromUnsigned(
                isolate: *mut root::v8::Isolate,
                value: u32,
            ) -> root::v8::Local<root::v8::Integer> {
                Integer_NewFromUnsigned(isolate, value)
            }
            #[inline]
            pub unsafe fn Value(&self) -> i64 {
                Integer_Value(self)
            }
        }
        /// A JavaScript value representing a 32-bit signed integer.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Int32 {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Int32() {
            assert_eq!(
                ::std::mem::size_of::<Int32>(),
                1usize,
                concat!("Size of: ", stringify!(Int32))
            );
            assert_eq!(
                ::std::mem::align_of::<Int32>(),
                1usize,
                concat!("Alignment of ", stringify!(Int32))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Value@Int32@v8@@QEBAHXZ"]
            pub fn Int32_Value(this: *const root::v8::Int32) -> i32;
        }
        impl Int32 {
            #[inline]
            pub unsafe fn Value(&self) -> i32 {
                Int32_Value(self)
            }
        }
        /// A JavaScript value representing a 32-bit unsigned integer.
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Uint32 {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Uint32() {
            assert_eq!(
                ::std::mem::size_of::<Uint32>(),
                1usize,
                concat!("Size of: ", stringify!(Uint32))
            );
            assert_eq!(
                ::std::mem::align_of::<Uint32>(),
                1usize,
                concat!("Alignment of ", stringify!(Uint32))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Value@Uint32@v8@@QEBAIXZ"]
            pub fn Uint32_Value(this: *const root::v8::Uint32) -> u32;
        }
        impl Uint32 {
            #[inline]
            pub unsafe fn Value(&self) -> u32 {
                Uint32_Value(self)
            }
        }
        /// A JavaScript BigInt value (https://tc39.github.io/proposal-bigint)
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct BigInt {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_BigInt() {
            assert_eq!(
                ::std::mem::size_of::<BigInt>(),
                1usize,
                concat!("Size of: ", stringify!(BigInt))
            );
            assert_eq!(
                ::std::mem::align_of::<BigInt>(),
                1usize,
                concat!("Alignment of ", stringify!(BigInt))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?New@BigInt@v8@@SA?AV?$Local@VBigInt@v8@@@2@PEAVIsolate@2@_J@Z"]
            pub fn BigInt_New(
                isolate: *mut root::v8::Isolate,
                value: i64,
            ) -> root::v8::Local<root::v8::BigInt>;
        }
        extern "C" {
            #[link_name = "\u{1}?NewFromUnsigned@BigInt@v8@@SA?AV?$Local@VBigInt@v8@@@2@PEAVIsolate@2@_K@Z"]
            pub fn BigInt_NewFromUnsigned(
                isolate: *mut root::v8::Isolate,
                value: u64,
            ) -> root::v8::Local<root::v8::BigInt>;
        }
        extern "C" {
            /// Creates a new BigInt object using a specified sign bit and a
            /// specified list of digits/words.
            /// The resulting number is calculated as:
            ///
            /// (-1)^sign_bit * (words[0] * (2^64)^0 + words[1] * (2^64)^1 + ...)
            #[link_name = "\u{1}?NewFromWords@BigInt@v8@@SA?AV?$MaybeLocal@VBigInt@v8@@@2@V?$Local@VContext@v8@@@2@HHPEB_K@Z"]
            pub fn BigInt_NewFromWords(
                context: root::v8::Local<root::v8::Context>,
                sign_bit: ::std::os::raw::c_int,
                word_count: ::std::os::raw::c_int,
                words: *const u64,
            ) -> root::v8::MaybeLocal<root::v8::BigInt>;
        }
        extern "C" {
            /// Returns the value of this BigInt as an unsigned 64-bit integer.
            /// If `lossless` is provided, it will reflect whether the return value was
            /// truncated or wrapped around. In particular, it is set to `false` if this
            /// BigInt is negative.
            #[link_name = "\u{1}?Uint64Value@BigInt@v8@@QEBA_KPEA_N@Z"]
            pub fn BigInt_Uint64Value(this: *const root::v8::BigInt, lossless: *mut bool) -> u64;
        }
        extern "C" {
            /// Returns the value of this BigInt as a signed 64-bit integer.
            /// If `lossless` is provided, it will reflect whether this BigInt was
            /// truncated or not.
            #[link_name = "\u{1}?Int64Value@BigInt@v8@@QEBA_JPEA_N@Z"]
            pub fn BigInt_Int64Value(this: *const root::v8::BigInt, lossless: *mut bool) -> i64;
        }
        extern "C" {
            /// Returns the number of 64-bit words needed to store the result of
            /// ToWordsArray().
            #[link_name = "\u{1}?WordCount@BigInt@v8@@QEBAHXZ"]
            pub fn BigInt_WordCount(this: *const root::v8::BigInt) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Writes the contents of this BigInt to a specified memory location.
            /// `sign_bit` must be provided and will be set to 1 if this BigInt is
            /// negative.
            /// `*word_count` has to be initialized to the length of the `words` array.
            /// Upon return, it will be set to the actual number of words that would
            /// be needed to store this BigInt (i.e. the return value of `WordCount()`).
            #[link_name = "\u{1}?ToWordsArray@BigInt@v8@@QEBAXPEAH0PEA_K@Z"]
            pub fn BigInt_ToWordsArray(
                this: *const root::v8::BigInt,
                sign_bit: *mut ::std::os::raw::c_int,
                word_count: *mut ::std::os::raw::c_int,
                words: *mut u64,
            );
        }
        impl BigInt {
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
                value: i64,
            ) -> root::v8::Local<root::v8::BigInt> {
                BigInt_New(isolate, value)
            }
            #[inline]
            pub unsafe fn NewFromUnsigned(
                isolate: *mut root::v8::Isolate,
                value: u64,
            ) -> root::v8::Local<root::v8::BigInt> {
                BigInt_NewFromUnsigned(isolate, value)
            }
            #[inline]
            pub unsafe fn NewFromWords(
                context: root::v8::Local<root::v8::Context>,
                sign_bit: ::std::os::raw::c_int,
                word_count: ::std::os::raw::c_int,
                words: *const u64,
            ) -> root::v8::MaybeLocal<root::v8::BigInt> {
                BigInt_NewFromWords(context, sign_bit, word_count, words)
            }
            #[inline]
            pub unsafe fn Uint64Value(&self, lossless: *mut bool) -> u64 {
                BigInt_Uint64Value(self, lossless)
            }
            #[inline]
            pub unsafe fn Int64Value(&self, lossless: *mut bool) -> i64 {
                BigInt_Int64Value(self, lossless)
            }
            #[inline]
            pub unsafe fn WordCount(&self) -> ::std::os::raw::c_int {
                BigInt_WordCount(self)
            }
            #[inline]
            pub unsafe fn ToWordsArray(
                &self,
                sign_bit: *mut ::std::os::raw::c_int,
                word_count: *mut ::std::os::raw::c_int,
                words: *mut u64,
            ) {
                BigInt_ToWordsArray(self, sign_bit, word_count, words)
            }
        }
        /// None.
        pub const PropertyAttribute_None: root::v8::PropertyAttribute = 0;
        /// ReadOnly, i.e., not writable.
        pub const PropertyAttribute_ReadOnly: root::v8::PropertyAttribute = 1;
        /// DontEnum, i.e., not enumerable.
        pub const PropertyAttribute_DontEnum: root::v8::PropertyAttribute = 2;
        /// DontDelete, i.e., not configurable.
        pub const PropertyAttribute_DontDelete: root::v8::PropertyAttribute = 4;
        /// PropertyAttribute.
        pub type PropertyAttribute = i32;
        /// Accessor[Getter|Setter] are used as callback functions when
        /// setting|getting a particular property. See Object and ObjectTemplate's
        /// method SetAccessor.
        pub type AccessorGetterCallback = ::std::option::Option<
            unsafe extern "C" fn(
                property: root::v8::Local<root::v8::String>,
                info: *const root::v8::PropertyCallbackInfo,
            ),
        >;
        pub type AccessorNameGetterCallback = ::std::option::Option<
            unsafe extern "C" fn(
                property: root::v8::Local<root::v8::Name>,
                info: *const root::v8::PropertyCallbackInfo,
            ),
        >;
        pub type AccessorSetterCallback = ::std::option::Option<
            unsafe extern "C" fn(
                property: root::v8::Local<root::v8::String>,
                value: root::v8::Local<root::v8::Value>,
                info: *const root::v8::PropertyCallbackInfo,
            ),
        >;
        pub type AccessorNameSetterCallback = ::std::option::Option<
            unsafe extern "C" fn(
                property: root::v8::Local<root::v8::Name>,
                value: root::v8::Local<root::v8::Value>,
                info: *const root::v8::PropertyCallbackInfo,
            ),
        >;
        pub const AccessControl_DEFAULT: root::v8::AccessControl = 0;
        pub const AccessControl_ALL_CAN_READ: root::v8::AccessControl = 1;
        pub const AccessControl_ALL_CAN_WRITE: root::v8::AccessControl = 2;
        pub const AccessControl_PROHIBITS_OVERWRITING: root::v8::AccessControl = 4;
        /// Access control specifications.
        ///
        /// Some accessors should be accessible across contexts.  These
        /// accessors have an explicit access control parameter which specifies
        /// the kind of cross-context access that should be allowed.
        ///
        /// TODO(dcarney): Remove PROHIBITS_OVERWRITING as it is now unused.
        pub type AccessControl = i32;
        pub const PropertyFilter_ALL_PROPERTIES: root::v8::PropertyFilter = 0;
        pub const PropertyFilter_ONLY_WRITABLE: root::v8::PropertyFilter = 1;
        pub const PropertyFilter_ONLY_ENUMERABLE: root::v8::PropertyFilter = 2;
        pub const PropertyFilter_ONLY_CONFIGURABLE: root::v8::PropertyFilter = 4;
        pub const PropertyFilter_SKIP_STRINGS: root::v8::PropertyFilter = 8;
        pub const PropertyFilter_SKIP_SYMBOLS: root::v8::PropertyFilter = 16;
        /// Property filter bits. They can be or'ed to build a composite filter.
        pub type PropertyFilter = i32;
        pub const SideEffectType_kHasSideEffect: root::v8::SideEffectType = 0;
        pub const SideEffectType_kHasNoSideEffect: root::v8::SideEffectType = 1;
        /// Options for marking whether callbacks may trigger JS-observable side effects.
        /// Side-effect-free callbacks are whitelisted during debug evaluation with
        /// throwOnSideEffect. It applies when calling a Function, FunctionTemplate,
        /// or an Accessor's getter callback. For Interceptors, please see
        /// PropertyHandlerFlags's kHasNoSideEffect.
        pub type SideEffectType = i32;
        pub const KeyCollectionMode_kOwnOnly: root::v8::KeyCollectionMode = 0;
        pub const KeyCollectionMode_kIncludePrototypes: root::v8::KeyCollectionMode = 1;
        /// Keys/Properties filter enums:
        ///
        /// KeyCollectionMode limits the range of collected properties. kOwnOnly limits
        /// the collected properties to the given Object only. kIncludesPrototypes will
        /// include all keys of the objects's prototype chain as well.
        pub type KeyCollectionMode = i32;
        pub const IndexFilter_kIncludeIndices: root::v8::IndexFilter = 0;
        pub const IndexFilter_kSkipIndices: root::v8::IndexFilter = 1;
        /// kIncludesIndices allows for integer indices to be collected, while
        /// kSkipIndices will exclude integer indices from being collected.
        pub type IndexFilter = i32;
        pub const KeyConversionMode_kConvertToString: root::v8::KeyConversionMode = 0;
        pub const KeyConversionMode_kKeepNumbers: root::v8::KeyConversionMode = 1;
        /// kConvertToString will convert integer indices to strings.
        /// kKeepNumbers will return numbers for integer indices.
        pub type KeyConversionMode = i32;
        pub const IntegrityLevel_kFrozen: root::v8::IntegrityLevel = 0;
        pub const IntegrityLevel_kSealed: root::v8::IntegrityLevel = 1;
        /// Integrity level for objects.
        pub type IntegrityLevel = i32;
        /// A JavaScript object (ECMA-262, 4.3.3)
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Object {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Object() {
            assert_eq!(
                ::std::mem::size_of::<Object>(),
                1usize,
                concat!("Size of: ", stringify!(Object))
            );
            assert_eq!(
                ::std::mem::align_of::<Object>(),
                1usize,
                concat!("Alignment of ", stringify!(Object))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Set@Object@v8@@QEAA_NV?$Local@VValue@v8@@@2@0@Z"]
            pub fn Object_Set(
                this: *mut root::v8::Object,
                key: root::v8::Local<root::v8::Value>,
                value: root::v8::Local<root::v8::Value>,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?Set@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@1@Z"]
            pub fn Object_Set1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?Set@Object@v8@@QEAA_NIV?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_Set2(
                this: *mut root::v8::Object,
                index: u32,
                value: root::v8::Local<root::v8::Value>,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?Set@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@IV?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_Set3(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?CreateDataProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_CreateDataProperty(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?CreateDataProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@IV?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_CreateDataProperty1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?DefineOwnProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@V?$Local@VValue@v8@@@2@W4PropertyAttribute@2@@Z"]
            pub fn Object_DefineOwnProperty(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
                value: root::v8::Local<root::v8::Value>,
                attributes: root::v8::PropertyAttribute,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?DefineProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@AEAVPropertyDescriptor@2@@Z"]
            pub fn Object_DefineProperty(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
                descriptor: *mut root::v8::PropertyDescriptor,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?Get@Object@v8@@QEAA?AV?$Local@VValue@v8@@@2@V32@@Z"]
            pub fn Object_Get(
                this: *mut root::v8::Object,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            #[link_name = "\u{1}?Get@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_Get1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            #[link_name = "\u{1}?Get@Object@v8@@QEAA?AV?$Local@VValue@v8@@@2@I@Z"]
            pub fn Object_Get2(
                this: *mut root::v8::Object,
                index: u32,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            #[link_name = "\u{1}?Get@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@I@Z"]
            pub fn Object_Get3(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Gets the property attributes of a property which can be None or
            /// any combination of ReadOnly, DontEnum and DontDelete. Returns
            /// None when the property doesn't exist.
            #[link_name = "\u{1}?GetPropertyAttributes@Object@v8@@QEAA?AV?$Maybe@W4PropertyAttribute@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_GetPropertyAttributes(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<root::v8::PropertyAttribute>;
        }
        extern "C" {
            /// Returns Object.getOwnPropertyDescriptor as per ES2016 section 19.1.2.6.
            #[link_name = "\u{1}?GetOwnPropertyDescriptor@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_GetOwnPropertyDescriptor(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            #[link_name = "\u{1}?Has@Object@v8@@QEAA_NV?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_Has(
                this: *mut root::v8::Object,
                key: root::v8::Local<root::v8::Value>,
            ) -> bool;
        }
        extern "C" {
            /// Object::Has() calls the abstract operation HasProperty(O, P) described
            /// in ECMA-262, 7.3.10. Has() returns
            /// true, if the object has the property, either own or on the prototype chain.
            /// Interceptors, i.e., PropertyQueryCallbacks, are called if present.
            ///
            /// Has() has the same side effects as JavaScript's `variable in object`.
            /// For example, calling Has() on a revoked proxy will throw an exception.
            ///
            /// \note Has() converts the key to a name, which possibly calls back into
            /// JavaScript.
            ///
            /// See also v8::Object::HasOwnProperty() and
            /// v8::Object::HasRealNamedProperty().
            #[link_name = "\u{1}?Has@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_Has1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?Delete@Object@v8@@QEAA_NV?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_Delete(
                this: *mut root::v8::Object,
                key: root::v8::Local<root::v8::Value>,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?Delete@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_Delete1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?Has@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@I@Z"]
            pub fn Object_Has2(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?Delete@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@I@Z"]
            pub fn Object_Delete2(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Note: SideEffectType affects the getter only, not the setter.
            #[link_name = "\u{1}?SetAccessor@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@P6AX1AEBV?$PropertyCallbackInfo@VValue@v8@@@2@@ZP6AX1V?$Local@VValue@v8@@@2@AEBV?$PropertyCallbackInfo@X@2@@ZV?$MaybeLocal@VValue@v8@@@2@W4AccessControl@2@W4PropertyAttribute@2@W4SideEffectType@2@@Z"]
            pub fn Object_SetAccessor(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::AccessorNameGetterCallback,
                setter: root::v8::AccessorNameSetterCallback,
                data: root::v8::MaybeLocal<root::v8::Value>,
                settings: root::v8::AccessControl,
                attribute: root::v8::PropertyAttribute,
                getter_side_effect_type: root::v8::SideEffectType,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?SetAccessorProperty@Object@v8@@QEAAXV?$Local@VName@v8@@@2@V?$Local@VFunction@v8@@@2@1W4PropertyAttribute@2@W4AccessControl@2@@Z"]
            pub fn Object_SetAccessorProperty(
                this: *mut root::v8::Object,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::Local<root::v8::Function>,
                setter: root::v8::Local<root::v8::Function>,
                attribute: root::v8::PropertyAttribute,
                settings: root::v8::AccessControl,
            );
        }
        extern "C" {
            /// Sets a native data property like Template::SetNativeDataProperty, but
            /// this method sets on this object directly.
            #[link_name = "\u{1}?SetNativeDataProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@P6AX1AEBV?$PropertyCallbackInfo@VValue@v8@@@2@@ZP6AX1V?$Local@VValue@v8@@@2@AEBV?$PropertyCallbackInfo@X@2@@Z4W4PropertyAttribute@2@W4SideEffectType@2@@Z"]
            pub fn Object_SetNativeDataProperty(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::AccessorNameGetterCallback,
                setter: root::v8::AccessorNameSetterCallback,
                data: root::v8::Local<root::v8::Value>,
                attributes: root::v8::PropertyAttribute,
                getter_side_effect_type: root::v8::SideEffectType,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Attempts to create a property with the given name which behaves like a data
            /// property, except that the provided getter is invoked (and provided with the
            /// data value) to supply its value the first time it is read. After the
            /// property is accessed once, it is replaced with an ordinary data property.
            ///
            /// Analogous to Template::SetLazyDataProperty.
            #[link_name = "\u{1}?SetLazyDataProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@P6AX1AEBV?$PropertyCallbackInfo@VValue@v8@@@2@@ZV?$Local@VValue@v8@@@2@W4PropertyAttribute@2@W4SideEffectType@2@@Z"]
            pub fn Object_SetLazyDataProperty(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::AccessorNameGetterCallback,
                data: root::v8::Local<root::v8::Value>,
                attributes: root::v8::PropertyAttribute,
                getter_side_effect_type: root::v8::SideEffectType,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Functionality for private properties.
            /// This is an experimental feature, use at your own risk.
            /// Note: Private properties are not inherited. Do not rely on this, since it
            /// may change.
            #[link_name = "\u{1}?HasPrivate@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VPrivate@v8@@@2@@Z"]
            pub fn Object_HasPrivate(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?SetPrivate@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VPrivate@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_SetPrivate(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?DeletePrivate@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VPrivate@v8@@@2@@Z"]
            pub fn Object_DeletePrivate(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetPrivate@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VPrivate@v8@@@2@@Z"]
            pub fn Object_GetPrivate(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetPropertyNames@Object@v8@@QEAA?AV?$Local@VArray@v8@@@2@XZ"]
            pub fn Object_GetPropertyNames(
                this: *mut root::v8::Object,
            ) -> root::v8::Local<root::v8::Array>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetPropertyNames@Object@v8@@QEAA?AV?$MaybeLocal@VArray@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Object_GetPropertyNames1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Array>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetPropertyNames@Object@v8@@QEAA?AV?$MaybeLocal@VArray@v8@@@2@V?$Local@VContext@v8@@@2@W4KeyCollectionMode@2@W4PropertyFilter@2@W4IndexFilter@2@W4KeyConversionMode@2@@Z"]
            pub fn Object_GetPropertyNames2(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                mode: root::v8::KeyCollectionMode,
                property_filter: root::v8::PropertyFilter,
                index_filter: root::v8::IndexFilter,
                key_conversion: root::v8::KeyConversionMode,
            ) -> root::v8::MaybeLocal<root::v8::Array>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetOwnPropertyNames@Object@v8@@QEAA?AV?$Local@VArray@v8@@@2@XZ"]
            pub fn Object_GetOwnPropertyNames(
                this: *mut root::v8::Object,
            ) -> root::v8::Local<root::v8::Array>;
        }
        extern "C" {
            #[link_name = "\u{1}?GetOwnPropertyNames@Object@v8@@QEAA?AV?$MaybeLocal@VArray@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Object_GetOwnPropertyNames1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Array>;
        }
        extern "C" {
            /// Returns an array containing the names of the filtered properties
            /// of this object, including properties from prototype objects.  The
            /// array returned by this method contains the same values as would
            /// be enumerated by a for-in statement over this object.
            #[link_name = "\u{1}?GetOwnPropertyNames@Object@v8@@QEAA?AV?$MaybeLocal@VArray@v8@@@2@V?$Local@VContext@v8@@@2@W4PropertyFilter@2@W4KeyConversionMode@2@@Z"]
            pub fn Object_GetOwnPropertyNames2(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                filter: root::v8::PropertyFilter,
                key_conversion: root::v8::KeyConversionMode,
            ) -> root::v8::MaybeLocal<root::v8::Array>;
        }
        extern "C" {
            /// Get the prototype object.  This does not skip objects marked to
            /// be skipped by __proto__ and it does not consult the security
            /// handler.
            #[link_name = "\u{1}?GetPrototype@Object@v8@@QEAA?AV?$Local@VValue@v8@@@2@XZ"]
            pub fn Object_GetPrototype(
                this: *mut root::v8::Object,
            ) -> root::v8::Local<root::v8::Value>;
        }
        extern "C" {
            /// Set the prototype object.  This does not skip objects marked to
            /// be skipped by __proto__ and it does not consult the security
            /// handler.
            #[link_name = "\u{1}?SetPrototype@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_SetPrototype(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                prototype: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Finds an instance of the given function template in the prototype
            /// chain.
            #[link_name = "\u{1}?FindInstanceInPrototypeChain@Object@v8@@QEAA?AV?$Local@VObject@v8@@@2@V?$Local@VFunctionTemplate@v8@@@2@@Z"]
            pub fn Object_FindInstanceInPrototypeChain(
                this: *mut root::v8::Object,
                tmpl: root::v8::Local<root::v8::FunctionTemplate>,
            ) -> root::v8::Local<root::v8::Object>;
        }
        extern "C" {
            /// Call builtin Object.prototype.toString on this object.
            /// This is different from Value::ToString() that may call
            /// user-defined toString function. This one does not.
            #[link_name = "\u{1}?ObjectProtoToString@Object@v8@@QEAA?AV?$MaybeLocal@VString@v8@@@2@V?$Local@VContext@v8@@@2@@Z"]
            pub fn Object_ObjectProtoToString(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String>;
        }
        extern "C" {
            /// Returns the name of the function invoked as a constructor for this object.
            #[link_name = "\u{1}?GetConstructorName@Object@v8@@QEAA?AV?$Local@VString@v8@@@2@XZ"]
            pub fn Object_GetConstructorName(
                this: *mut root::v8::Object,
            ) -> root::v8::Local<root::v8::String>;
        }
        extern "C" {
            /// Sets the integrity level of the object.
            #[link_name = "\u{1}?SetIntegrityLevel@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@W4IntegrityLevel@2@@Z"]
            pub fn Object_SetIntegrityLevel(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                level: root::v8::IntegrityLevel,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Gets the number of internal fields for this Object.
            #[link_name = "\u{1}?InternalFieldCount@Object@v8@@QEAAHXZ"]
            pub fn Object_InternalFieldCount(this: *mut root::v8::Object) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Sets the value in an internal field.
            #[link_name = "\u{1}?SetInternalField@Object@v8@@QEAAXHV?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_SetInternalField(
                this: *mut root::v8::Object,
                index: ::std::os::raw::c_int,
                value: root::v8::Local<root::v8::Value>,
            );
        }
        extern "C" {
            /// Sets a 2-byte-aligned native pointer in an internal field. To retrieve such
            /// a field, GetAlignedPointerFromInternalField must be used, everything else
            /// leads to undefined behavior.
            #[link_name = "\u{1}?SetAlignedPointerInInternalField@Object@v8@@QEAAXHPEAX@Z"]
            pub fn Object_SetAlignedPointerInInternalField(
                this: *mut root::v8::Object,
                index: ::std::os::raw::c_int,
                value: *mut ::std::os::raw::c_void,
            );
        }
        extern "C" {
            #[link_name = "\u{1}?SetAlignedPointerInInternalFields@Object@v8@@QEAAXHQEAHQEAPEAX@Z"]
            pub fn Object_SetAlignedPointerInInternalFields(
                this: *mut root::v8::Object,
                argc: ::std::os::raw::c_int,
                indices: *mut ::std::os::raw::c_int,
                values: *mut *mut ::std::os::raw::c_void,
            );
        }
        extern "C" {
            /// HasOwnProperty() is like JavaScript's Object.prototype.hasOwnProperty().
            ///
            /// See also v8::Object::Has() and v8::Object::HasRealNamedProperty().
            #[link_name = "\u{1}?HasOwnProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_HasOwnProperty(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?HasOwnProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@I@Z"]
            pub fn Object_HasOwnProperty1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?HasRealNamedProperty@Object@v8@@QEAA_NV?$Local@VString@v8@@@2@@Z"]
            pub fn Object_HasRealNamedProperty(
                this: *mut root::v8::Object,
                key: root::v8::Local<root::v8::String>,
            ) -> bool;
        }
        extern "C" {
            /// Use HasRealNamedProperty() if you want to check if an object has an own
            /// property without causing side effects, i.e., without calling interceptors.
            ///
            /// This function is similar to v8::Object::HasOwnProperty(), but it does not
            /// call interceptors.
            ///
            /// \note Consider using non-masking interceptors, i.e., the interceptors are
            /// not called if the receiver has the real named property. See
            /// `v8::PropertyHandlerFlags::kNonMasking`.
            ///
            /// See also v8::Object::Has().
            #[link_name = "\u{1}?HasRealNamedProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_HasRealNamedProperty1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?HasRealIndexedProperty@Object@v8@@QEAA_NI@Z"]
            pub fn Object_HasRealIndexedProperty(this: *mut root::v8::Object, index: u32) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?HasRealIndexedProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@I@Z"]
            pub fn Object_HasRealIndexedProperty1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?HasRealNamedCallbackProperty@Object@v8@@QEAA_NV?$Local@VString@v8@@@2@@Z"]
            pub fn Object_HasRealNamedCallbackProperty(
                this: *mut root::v8::Object,
                key: root::v8::Local<root::v8::String>,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}?HasRealNamedCallbackProperty@Object@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_HasRealNamedCallbackProperty1(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// If result.IsEmpty() no real property was located in the prototype chain.
            /// This means interceptors in the prototype chain are not called.
            #[link_name = "\u{1}?GetRealNamedPropertyInPrototypeChain@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_GetRealNamedPropertyInPrototypeChain(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Gets the property attributes of a real property in the prototype chain,
            /// which can be None or any combination of ReadOnly, DontEnum and DontDelete.
            /// Interceptors in the prototype chain are not called.
            #[link_name = "\u{1}?GetRealNamedPropertyAttributesInPrototypeChain@Object@v8@@QEAA?AV?$Maybe@W4PropertyAttribute@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_GetRealNamedPropertyAttributesInPrototypeChain(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<root::v8::PropertyAttribute>;
        }
        extern "C" {
            /// If result.IsEmpty() no real property was located on the object or
            /// in the prototype chain.
            /// This means interceptors in the prototype chain are not called.
            #[link_name = "\u{1}?GetRealNamedProperty@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_GetRealNamedProperty(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Gets the property attributes of a real property which can be
            /// None or any combination of ReadOnly, DontEnum and DontDelete.
            /// Interceptors in the prototype chain are not called.
            #[link_name = "\u{1}?GetRealNamedPropertyAttributes@Object@v8@@QEAA?AV?$Maybe@W4PropertyAttribute@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VName@v8@@@2@@Z"]
            pub fn Object_GetRealNamedPropertyAttributes(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<root::v8::PropertyAttribute>;
        }
        extern "C" {
            /// Tests for a named lookup interceptor.
            #[link_name = "\u{1}?HasNamedLookupInterceptor@Object@v8@@QEAA_NXZ"]
            pub fn Object_HasNamedLookupInterceptor(this: *mut root::v8::Object) -> bool;
        }
        extern "C" {
            /// Tests for an index lookup interceptor.
            #[link_name = "\u{1}?HasIndexedLookupInterceptor@Object@v8@@QEAA_NXZ"]
            pub fn Object_HasIndexedLookupInterceptor(this: *mut root::v8::Object) -> bool;
        }
        extern "C" {
            /// Returns the identity hash for this object. The current implementation
            /// uses a hidden property on the object to store the identity hash.
            ///
            /// The return value will never be 0. Also, it is not guaranteed to be
            /// unique.
            #[link_name = "\u{1}?GetIdentityHash@Object@v8@@QEAAHXZ"]
            pub fn Object_GetIdentityHash(this: *mut root::v8::Object) -> ::std::os::raw::c_int;
        }
        extern "C" {
            /// Clone this object with a fast but shallow copy.  Values will point
            /// to the same values as the original object.
            #[link_name = "\u{1}?Clone@Object@v8@@QEAA?AV?$Local@VObject@v8@@@2@XZ"]
            pub fn Object_Clone(this: *mut root::v8::Object) -> root::v8::Local<root::v8::Object>;
        }
        extern "C" {
            /// Returns the context in which the object was created.
            #[link_name = "\u{1}?CreationContext@Object@v8@@QEAA?AV?$Local@VContext@v8@@@2@XZ"]
            pub fn Object_CreationContext(
                this: *mut root::v8::Object,
            ) -> root::v8::Local<root::v8::Context>;
        }
        extern "C" {
            /// Checks whether a callback is set by the
            /// ObjectTemplate::SetCallAsFunctionHandler method.
            /// When an Object is callable this method returns true.
            #[link_name = "\u{1}?IsCallable@Object@v8@@QEAA_NXZ"]
            pub fn Object_IsCallable(this: *mut root::v8::Object) -> bool;
        }
        extern "C" {
            /// True if this object is a constructor.
            #[link_name = "\u{1}?IsConstructor@Object@v8@@QEAA_NXZ"]
            pub fn Object_IsConstructor(this: *mut root::v8::Object) -> bool;
        }
        extern "C" {
            /// Call an Object as a function if a callback is set by the
            /// ObjectTemplate::SetCallAsFunctionHandler method.
            #[link_name = "\u{1}?CallAsFunction@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@HQEAV52@@Z"]
            pub fn Object_CallAsFunction(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                recv: root::v8::Local<root::v8::Value>,
                argc: ::std::os::raw::c_int,
                argv: *mut root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Call an Object as a constructor if a callback is set by the
            /// ObjectTemplate::SetCallAsFunctionHandler method.
            /// Note: This method behaves like the Function::NewInstance method.
            #[link_name = "\u{1}?CallAsConstructor@Object@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@HQEAV?$Local@VValue@v8@@@2@@Z"]
            pub fn Object_CallAsConstructor(
                this: *mut root::v8::Object,
                context: root::v8::Local<root::v8::Context>,
                argc: ::std::os::raw::c_int,
                argv: *mut root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            /// Return the isolate to which the Object belongs to.
            #[link_name = "\u{1}?GetIsolate@Object@v8@@QEAAPEAVIsolate@2@XZ"]
            pub fn Object_GetIsolate(this: *mut root::v8::Object) -> *mut root::v8::Isolate;
        }
        extern "C" {
            /// If this object is a Set, Map, WeakSet or WeakMap, this returns a
            /// representation of the elements of this object as an array.
            /// If this object is a SetIterator or MapIterator, this returns all
            /// elements of the underlying collection, starting at the iterator's current
            /// position.
            /// For other types, this will return an empty MaybeLocal<Array> (without
            /// scheduling an exception).
            #[link_name = "\u{1}?PreviewEntries@Object@v8@@QEAA?AV?$MaybeLocal@VArray@v8@@@2@PEA_N@Z"]
            pub fn Object_PreviewEntries(
                this: *mut root::v8::Object,
                is_key_value: *mut bool,
            ) -> root::v8::MaybeLocal<root::v8::Array>;
        }
        extern "C" {
            #[link_name = "\u{1}?New@Object@v8@@SA?AV?$Local@VObject@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Object_New(isolate: *mut root::v8::Isolate)
                -> root::v8::Local<root::v8::Object>;
        }
        impl Object {
            #[inline]
            pub unsafe fn Set(
                &mut self,
                key: root::v8::Local<root::v8::Value>,
                value: root::v8::Local<root::v8::Value>,
            ) -> bool {
                Object_Set(self, key, value)
            }
            #[inline]
            pub unsafe fn Set1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_Set1(self, context, key, value)
            }
            #[inline]
            pub unsafe fn Set2(
                &mut self,
                index: u32,
                value: root::v8::Local<root::v8::Value>,
            ) -> bool {
                Object_Set2(self, index, value)
            }
            #[inline]
            pub unsafe fn Set3(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_Set3(self, context, index, value)
            }
            #[inline]
            pub unsafe fn CreateDataProperty(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_CreateDataProperty(self, context, key, value)
            }
            #[inline]
            pub unsafe fn CreateDataProperty1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_CreateDataProperty1(self, context, index, value)
            }
            #[inline]
            pub unsafe fn DefineOwnProperty(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
                value: root::v8::Local<root::v8::Value>,
                attributes: root::v8::PropertyAttribute,
            ) -> root::v8::Maybe<bool> {
                Object_DefineOwnProperty(self, context, key, value, attributes)
            }
            #[inline]
            pub unsafe fn DefineProperty(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
                descriptor: *mut root::v8::PropertyDescriptor,
            ) -> root::v8::Maybe<bool> {
                Object_DefineProperty(self, context, key, descriptor)
            }
            #[inline]
            pub unsafe fn Get(
                &mut self,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Local<root::v8::Value> {
                Object_Get(self, key)
            }
            #[inline]
            pub unsafe fn Get1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_Get1(self, context, key)
            }
            #[inline]
            pub unsafe fn Get2(&mut self, index: u32) -> root::v8::Local<root::v8::Value> {
                Object_Get2(self, index)
            }
            #[inline]
            pub unsafe fn Get3(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_Get3(self, context, index)
            }
            #[inline]
            pub unsafe fn GetPropertyAttributes(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<root::v8::PropertyAttribute> {
                Object_GetPropertyAttributes(self, context, key)
            }
            #[inline]
            pub unsafe fn GetOwnPropertyDescriptor(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_GetOwnPropertyDescriptor(self, context, key)
            }
            #[inline]
            pub unsafe fn Has(&mut self, key: root::v8::Local<root::v8::Value>) -> bool {
                Object_Has(self, key)
            }
            #[inline]
            pub unsafe fn Has1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_Has1(self, context, key)
            }
            #[inline]
            pub unsafe fn Delete(&mut self, key: root::v8::Local<root::v8::Value>) -> bool {
                Object_Delete(self, key)
            }
            #[inline]
            pub unsafe fn Delete1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_Delete1(self, context, key)
            }
            #[inline]
            pub unsafe fn Has2(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool> {
                Object_Has2(self, context, index)
            }
            #[inline]
            pub unsafe fn Delete2(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool> {
                Object_Delete2(self, context, index)
            }
            #[inline]
            pub unsafe fn SetAccessor(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::AccessorNameGetterCallback,
                setter: root::v8::AccessorNameSetterCallback,
                data: root::v8::MaybeLocal<root::v8::Value>,
                settings: root::v8::AccessControl,
                attribute: root::v8::PropertyAttribute,
                getter_side_effect_type: root::v8::SideEffectType,
            ) -> root::v8::Maybe<bool> {
                Object_SetAccessor(
                    self,
                    context,
                    name,
                    getter,
                    setter,
                    data,
                    settings,
                    attribute,
                    getter_side_effect_type,
                )
            }
            #[inline]
            pub unsafe fn SetAccessorProperty(
                &mut self,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::Local<root::v8::Function>,
                setter: root::v8::Local<root::v8::Function>,
                attribute: root::v8::PropertyAttribute,
                settings: root::v8::AccessControl,
            ) {
                Object_SetAccessorProperty(self, name, getter, setter, attribute, settings)
            }
            #[inline]
            pub unsafe fn SetNativeDataProperty(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::AccessorNameGetterCallback,
                setter: root::v8::AccessorNameSetterCallback,
                data: root::v8::Local<root::v8::Value>,
                attributes: root::v8::PropertyAttribute,
                getter_side_effect_type: root::v8::SideEffectType,
            ) -> root::v8::Maybe<bool> {
                Object_SetNativeDataProperty(
                    self,
                    context,
                    name,
                    getter,
                    setter,
                    data,
                    attributes,
                    getter_side_effect_type,
                )
            }
            #[inline]
            pub unsafe fn SetLazyDataProperty(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                name: root::v8::Local<root::v8::Name>,
                getter: root::v8::AccessorNameGetterCallback,
                data: root::v8::Local<root::v8::Value>,
                attributes: root::v8::PropertyAttribute,
                getter_side_effect_type: root::v8::SideEffectType,
            ) -> root::v8::Maybe<bool> {
                Object_SetLazyDataProperty(
                    self,
                    context,
                    name,
                    getter,
                    data,
                    attributes,
                    getter_side_effect_type,
                )
            }
            #[inline]
            pub unsafe fn HasPrivate(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
            ) -> root::v8::Maybe<bool> {
                Object_HasPrivate(self, context, key)
            }
            #[inline]
            pub unsafe fn SetPrivate(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_SetPrivate(self, context, key, value)
            }
            #[inline]
            pub unsafe fn DeletePrivate(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
            ) -> root::v8::Maybe<bool> {
                Object_DeletePrivate(self, context, key)
            }
            #[inline]
            pub unsafe fn GetPrivate(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Private>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_GetPrivate(self, context, key)
            }
            #[inline]
            pub unsafe fn GetPropertyNames(&mut self) -> root::v8::Local<root::v8::Array> {
                Object_GetPropertyNames(self)
            }
            #[inline]
            pub unsafe fn GetPropertyNames1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Array> {
                Object_GetPropertyNames1(self, context)
            }
            #[inline]
            pub unsafe fn GetPropertyNames2(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                mode: root::v8::KeyCollectionMode,
                property_filter: root::v8::PropertyFilter,
                index_filter: root::v8::IndexFilter,
                key_conversion: root::v8::KeyConversionMode,
            ) -> root::v8::MaybeLocal<root::v8::Array> {
                Object_GetPropertyNames2(
                    self,
                    context,
                    mode,
                    property_filter,
                    index_filter,
                    key_conversion,
                )
            }
            #[inline]
            pub unsafe fn GetOwnPropertyNames(&mut self) -> root::v8::Local<root::v8::Array> {
                Object_GetOwnPropertyNames(self)
            }
            #[inline]
            pub unsafe fn GetOwnPropertyNames1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::Array> {
                Object_GetOwnPropertyNames1(self, context)
            }
            #[inline]
            pub unsafe fn GetOwnPropertyNames2(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                filter: root::v8::PropertyFilter,
                key_conversion: root::v8::KeyConversionMode,
            ) -> root::v8::MaybeLocal<root::v8::Array> {
                Object_GetOwnPropertyNames2(self, context, filter, key_conversion)
            }
            #[inline]
            pub unsafe fn GetPrototype(&mut self) -> root::v8::Local<root::v8::Value> {
                Object_GetPrototype(self)
            }
            #[inline]
            pub unsafe fn SetPrototype(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                prototype: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Object_SetPrototype(self, context, prototype)
            }
            #[inline]
            pub unsafe fn FindInstanceInPrototypeChain(
                &mut self,
                tmpl: root::v8::Local<root::v8::FunctionTemplate>,
            ) -> root::v8::Local<root::v8::Object> {
                Object_FindInstanceInPrototypeChain(self, tmpl)
            }
            #[inline]
            pub unsafe fn ObjectProtoToString(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
            ) -> root::v8::MaybeLocal<root::v8::String> {
                Object_ObjectProtoToString(self, context)
            }
            #[inline]
            pub unsafe fn GetConstructorName(&mut self) -> root::v8::Local<root::v8::String> {
                Object_GetConstructorName(self)
            }
            #[inline]
            pub unsafe fn SetIntegrityLevel(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                level: root::v8::IntegrityLevel,
            ) -> root::v8::Maybe<bool> {
                Object_SetIntegrityLevel(self, context, level)
            }
            #[inline]
            pub unsafe fn InternalFieldCount(&mut self) -> ::std::os::raw::c_int {
                Object_InternalFieldCount(self)
            }
            #[inline]
            pub unsafe fn SetInternalField(
                &mut self,
                index: ::std::os::raw::c_int,
                value: root::v8::Local<root::v8::Value>,
            ) {
                Object_SetInternalField(self, index, value)
            }
            #[inline]
            pub unsafe fn SetAlignedPointerInInternalField(
                &mut self,
                index: ::std::os::raw::c_int,
                value: *mut ::std::os::raw::c_void,
            ) {
                Object_SetAlignedPointerInInternalField(self, index, value)
            }
            #[inline]
            pub unsafe fn SetAlignedPointerInInternalFields(
                &mut self,
                argc: ::std::os::raw::c_int,
                indices: *mut ::std::os::raw::c_int,
                values: *mut *mut ::std::os::raw::c_void,
            ) {
                Object_SetAlignedPointerInInternalFields(self, argc, indices, values)
            }
            #[inline]
            pub unsafe fn HasOwnProperty(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<bool> {
                Object_HasOwnProperty(self, context, key)
            }
            #[inline]
            pub unsafe fn HasOwnProperty1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool> {
                Object_HasOwnProperty1(self, context, index)
            }
            #[inline]
            pub unsafe fn HasRealNamedProperty(
                &mut self,
                key: root::v8::Local<root::v8::String>,
            ) -> bool {
                Object_HasRealNamedProperty(self, key)
            }
            #[inline]
            pub unsafe fn HasRealNamedProperty1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<bool> {
                Object_HasRealNamedProperty1(self, context, key)
            }
            #[inline]
            pub unsafe fn HasRealIndexedProperty(&mut self, index: u32) -> bool {
                Object_HasRealIndexedProperty(self, index)
            }
            #[inline]
            pub unsafe fn HasRealIndexedProperty1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                index: u32,
            ) -> root::v8::Maybe<bool> {
                Object_HasRealIndexedProperty1(self, context, index)
            }
            #[inline]
            pub unsafe fn HasRealNamedCallbackProperty(
                &mut self,
                key: root::v8::Local<root::v8::String>,
            ) -> bool {
                Object_HasRealNamedCallbackProperty(self, key)
            }
            #[inline]
            pub unsafe fn HasRealNamedCallbackProperty1(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<bool> {
                Object_HasRealNamedCallbackProperty1(self, context, key)
            }
            #[inline]
            pub unsafe fn GetRealNamedPropertyInPrototypeChain(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_GetRealNamedPropertyInPrototypeChain(self, context, key)
            }
            #[inline]
            pub unsafe fn GetRealNamedPropertyAttributesInPrototypeChain(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<root::v8::PropertyAttribute> {
                Object_GetRealNamedPropertyAttributesInPrototypeChain(self, context, key)
            }
            #[inline]
            pub unsafe fn GetRealNamedProperty(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_GetRealNamedProperty(self, context, key)
            }
            #[inline]
            pub unsafe fn GetRealNamedPropertyAttributes(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Name>,
            ) -> root::v8::Maybe<root::v8::PropertyAttribute> {
                Object_GetRealNamedPropertyAttributes(self, context, key)
            }
            #[inline]
            pub unsafe fn HasNamedLookupInterceptor(&mut self) -> bool {
                Object_HasNamedLookupInterceptor(self)
            }
            #[inline]
            pub unsafe fn HasIndexedLookupInterceptor(&mut self) -> bool {
                Object_HasIndexedLookupInterceptor(self)
            }
            #[inline]
            pub unsafe fn GetIdentityHash(&mut self) -> ::std::os::raw::c_int {
                Object_GetIdentityHash(self)
            }
            #[inline]
            pub unsafe fn Clone(&mut self) -> root::v8::Local<root::v8::Object> {
                Object_Clone(self)
            }
            #[inline]
            pub unsafe fn CreationContext(&mut self) -> root::v8::Local<root::v8::Context> {
                Object_CreationContext(self)
            }
            #[inline]
            pub unsafe fn IsCallable(&mut self) -> bool {
                Object_IsCallable(self)
            }
            #[inline]
            pub unsafe fn IsConstructor(&mut self) -> bool {
                Object_IsConstructor(self)
            }
            #[inline]
            pub unsafe fn CallAsFunction(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                recv: root::v8::Local<root::v8::Value>,
                argc: ::std::os::raw::c_int,
                argv: *mut root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_CallAsFunction(self, context, recv, argc, argv)
            }
            #[inline]
            pub unsafe fn CallAsConstructor(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                argc: ::std::os::raw::c_int,
                argv: *mut root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Object_CallAsConstructor(self, context, argc, argv)
            }
            #[inline]
            pub unsafe fn GetIsolate(&mut self) -> *mut root::v8::Isolate {
                Object_GetIsolate(self)
            }
            #[inline]
            pub unsafe fn PreviewEntries(
                &mut self,
                is_key_value: *mut bool,
            ) -> root::v8::MaybeLocal<root::v8::Array> {
                Object_PreviewEntries(self, is_key_value)
            }
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
            ) -> root::v8::Local<root::v8::Object> {
                Object_New(isolate)
            }
        }
        /// An instance of the built-in array constructor (ECMA-262, 15.4.2).
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Array {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Array() {
            assert_eq!(
                ::std::mem::size_of::<Array>(),
                1usize,
                concat!("Size of: ", stringify!(Array))
            );
            assert_eq!(
                ::std::mem::align_of::<Array>(),
                1usize,
                concat!("Alignment of ", stringify!(Array))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Length@Array@v8@@QEBAIXZ"]
            pub fn Array_Length(this: *const root::v8::Array) -> u32;
        }
        extern "C" {
            /// Creates a JavaScript array with the given length. If the length
            /// is negative the returned array will have length 0.
            #[link_name = "\u{1}?New@Array@v8@@SA?AV?$Local@VArray@v8@@@2@PEAVIsolate@2@H@Z"]
            pub fn Array_New(
                isolate: *mut root::v8::Isolate,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::Array>;
        }
        impl Array {
            #[inline]
            pub unsafe fn Length(&self) -> u32 {
                Array_Length(self)
            }
            #[inline]
            pub unsafe fn New(
                isolate: *mut root::v8::Isolate,
                length: ::std::os::raw::c_int,
            ) -> root::v8::Local<root::v8::Array> {
                Array_New(isolate, length)
            }
        }
        /// An instance of the built-in Map constructor (ECMA-262, 6th Edition, 23.1.1).
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Map {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Map() {
            assert_eq!(
                ::std::mem::size_of::<Map>(),
                1usize,
                concat!("Size of: ", stringify!(Map))
            );
            assert_eq!(
                ::std::mem::align_of::<Map>(),
                1usize,
                concat!("Alignment of ", stringify!(Map))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Size@Map@v8@@QEBA_KXZ"]
            pub fn Map_Size(this: *const root::v8::Map) -> usize;
        }
        extern "C" {
            #[link_name = "\u{1}?Clear@Map@v8@@QEAAXXZ"]
            pub fn Map_Clear(this: *mut root::v8::Map);
        }
        extern "C" {
            #[link_name = "\u{1}?Get@Map@v8@@QEAA?AV?$MaybeLocal@VValue@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Map_Get(
                this: *mut root::v8::Map,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value>;
        }
        extern "C" {
            #[link_name = "\u{1}?Set@Map@v8@@QEAA?AV?$MaybeLocal@VMap@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@1@Z"]
            pub fn Map_Set(
                this: *mut root::v8::Map,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Map>;
        }
        extern "C" {
            #[link_name = "\u{1}?Has@Map@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Map_Has(
                this: *mut root::v8::Map,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}?Delete@Map@v8@@QEAA?AV?$Maybe@_N@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Map_Delete(
                this: *mut root::v8::Map,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool>;
        }
        extern "C" {
            /// Returns an array of length Size() * 2, where index N is the Nth key and
            /// index N + 1 is the Nth value.
            #[link_name = "\u{1}?AsArray@Map@v8@@QEBA?AV?$Local@VArray@v8@@@2@XZ"]
            pub fn Map_AsArray(this: *const root::v8::Map) -> root::v8::Local<root::v8::Array>;
        }
        extern "C" {
            /// Creates a new empty Map.
            #[link_name = "\u{1}?New@Map@v8@@SA?AV?$Local@VMap@v8@@@2@PEAVIsolate@2@@Z"]
            pub fn Map_New(isolate: *mut root::v8::Isolate) -> root::v8::Local<root::v8::Map>;
        }
        impl Map {
            #[inline]
            pub unsafe fn Size(&self) -> usize {
                Map_Size(self)
            }
            #[inline]
            pub unsafe fn Clear(&mut self) {
                Map_Clear(self)
            }
            #[inline]
            pub unsafe fn Get(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Value> {
                Map_Get(self, context, key)
            }
            #[inline]
            pub unsafe fn Set(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
                value: root::v8::Local<root::v8::Value>,
            ) -> root::v8::MaybeLocal<root::v8::Map> {
                Map_Set(self, context, key, value)
            }
            #[inline]
            pub unsafe fn Has(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Map_Has(self, context, key)
            }
            #[inline]
            pub unsafe fn Delete(
                &mut self,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
            ) -> root::v8::Maybe<bool> {
                Map_Delete(self, context, key)
            }
            #[inline]
            pub unsafe fn AsArray(&self) -> root::v8::Local<root::v8::Array> {
                Map_AsArray(self)
            }
            #[inline]
            pub unsafe fn New(isolate: *mut root::v8::Isolate) -> root::v8::Local<root::v8::Map> {
                Map_New(isolate)
            }
        }
        /// An instance of the built-in Set constructor (ECMA-262, 6th Edition, 23.2.1).
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub struct Set {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Set() {
            assert_eq!(
                ::std::mem::size_of::<Set>(),
                1usize,
                concat!("Size of: ", stringify!(Set))
            );
            assert_eq!(
                ::std::mem::align_of::<Set>(),
                1usize,
                concat!("Alignment of ", stringify!(Set))
            );
        }
        extern "C" {
            #[link_name = "\u{1}?Size@Set@v8@@QEBA_KXZ"]
            pub fn Set_Size(this: *const root::v8::Set) -> usize;
        }
        extern "C" {
            #[link_name = "\u{1}?Clear@Set@v8@@QEAAXXZ"]
            pub fn Set_Clear(this: *mut root::v8::Set);
        }
        extern "C" {
            #[link_name = "\u{1}?Add@Set@v8@@QEAA?AV?$MaybeLocal@VSet@v8@@@2@V?$Local@VContext@v8@@@2@V?$Local@VValue@v8@@@2@@Z"]
            pub fn Set_Add(
                this: *mut root::v8::Set,
                context: root::v8::Local<root::v8::Context>,
                key: root::v8::Local<root::v8::Value>,
